{"results":[{"content":{"url":"https://www.amazon.com/product-reviews/B08LQNL42Z?reviewerType=all_reviews&pageNumber=1","asin":"B08LQNL42Z","page":1,"pages":616,"reviews":[{"id":"R18FJK33IP7ADX","title":"5.0 out of 5 stars You can’t go wrong with this.","author":"Amazon Customer","rating":5,"content":"This tiny speaker has been such a joy to listen to music with. For context, I am by no means an audiophile, but love listening to music loudly and with a lot of bass. I listen on Spotify, YouTube, and occasionally Apple Music. Here is a detailed review from an avid music listener:Sound quality:This speaker is so crisp and clear it is unbelievable. Even at max volume it doesn’t clip or distort unless the mix on the song is off. The bass is incredible, pretty much the main reason I bought it, for that BOOM. Since the speaker uses 2 passive radiators, to really feel the bass you need to place the speaker by a wall or in the corner of two walls so the sound can bounce off them. It is actually insane how powerful the bass gets when you do that. You can feel parts of your body as well as the floor vibrating. One thing to note, there is a “bass “ button on the speaker and it definitely improves the bass, but look on to the next paragraph to make the bass even better.Out of the box, the speaker doesn’t sound as good as it could. This is because the equalizer has not been adjusted, so the sound signature is pretty flat. If you’re into that then great, but if not you can download the soundcore app and tweak the sound to your liking. In the picture I posted you can find my EQ, and boy does it make the sound louder, the bass bigger, and the songs overall more vibrant and bouncy. I listen to a lot of hip hop, so the bass and low end sounds great with that genre. But I also listen to a lot of indie and folklore, and the highs sound equally nice. Also, for EDM, this speaker is spectacular. The synths are bright and poppy, the drums are commanding and hard hitting, and the singer’s voice sounds great, not muffled or overpowered by the other aspects of the song. (And if they are, you can change the EQ) You can also power off your speaker from your phone app, which is pretty cool.Portability:The speaker is relatively easy to carry around. It has a rubberized handle and is only a couple pounds. I like to put it in my backpack when walking around or hanging out outside. It is waterproof too I believe, so you could get it wet, but I wouldn’t recommend submerging it in the pool because you never really know how waterproof it is until that happens. It is pretty tough too, but it has a hard plastic exterior so it might crack if dropped multiple times. But from my experience with it it’s super tough but easy to carry.Other aspects:The price is completely justifiable, sitting at around $100. It is by far the loudest and clearest speaker you will find in that price range, and can probably compete with $200-300 speakers as well. Battery life is amazing. I can go a whole week, hours a day, at half-volume, listening to music without charging it. And because it’s USB C I can use my Mac or iPad charger to charge it. Bluetooth connectivity is pretty much flawless; I usually connect it to my iPhone, iPad or Mac, and rarely experience a pause or interruption unless I walk very far from the speaker. (Probably 50 feet no walls, or 30 feet with some walls if I had to guess). The only issue I see with this speaker is that it lacks a 3.5mm headphone jack. This could be problematic if your device doesn’t have Bluetooth, but thankfully everything I need to connect the speaker to has Bluetooth. ALSO, forgot to mention that I also watch a lot of YouTube vids with the speaker and there is almost no latency. This means the voices sync up great with characters in the shows you watch, and everything works perfectly for other means of media besides music.Final thoughts:As I said before, I love listening to music out loud, and with a lot of bass. Not just punchy artificial bass, but bass you can feel; deep booming bass. This speaker has that. I literally bought this speaker to replace a full sound system with dual tweeters and dedicated sub because this speaker is more convenient and sounds pretty comparable to the sound system with the right EQ. Obviously it won’t be able to replace the bass from a good subwoofer, but it is more than enough for me and the clarity is actually better than the sound system I replaced. (It is an old altec Lansing system for reference). If you are looking for a more enjoyable listening experience, for basically any genre of music, OR if you are looking to enhance your TV’s sound system (assuming it has Bluetooth), then this is absolutely the speaker for you. The soundcore motion boom makes listening to music more enjoyable and ultimately I’m so glad I bought it. Do yourself a favor and pull the trigger on this one, I really have no complaints about it besides no 3.5mm aux, but it is truly a gem.","timestamp":"Reviewed in the United States October 23, 2021","profile_id":"AGWMGBFA36PTVZKPEQBWBVV5VWJA","is_verified":true,"helpful_count":153,"product_attributes":"Color: Black"},{"id":"R1B7TOI9GECWNW","title":"5.0 out of 5 stars These things are pretty amazing","author":"StanDaMan1985","rating":5,"content":"So, I purchased the first speaker on Black Friday, and the second one a week after. I’m now just getting around to writing a review.When I received the first speaker, I thought that it sounded amazing. The sound is crisp. It’s clear. The bass sounds awesome. I am using these as indoor speakers for now.After receiving the first speaker, and then receiving the second one, I realize that the first speaker is making an odd hissing sound compared to the second one. I reached out to the seller, and I was able to receive a replacement within a few days.They are both connected to each other. And they sound amazing.The Bluetooth connectivity is quick. The sound coming out of both of these speakers is pretty incredible especially if you think about the amount of money that is spent on both.Out the door, because I purchased both speakers when they were on clearance, I’ve paid around $150.Is that a lot? Comparatively. However, if you look at their direct competitors, such as JBL or Sony or Bose, two of these cost as much as one of those.I understand that these are waterproof. I have not tested that out yet, but if I do, I will definitely update my review.Also, and keep in mind that these are exactly what they say these are. These are speakers that sound amazing that have an awesome base, and awesome trouble, and all in all sound like they are double or triple the cost of what I paid.Not Shamie, but just some the fact that these don’t have any sort of a smart assistant built in, may be an issue. However, they are connected to your device. So, your devices assistant, still technically works.The battery life on these things is pretty incredible as well.Keep in mind, I don’t have these on 24 seven. I can’t tell you this, since I’ve had these, and since I’ve been using these, I’ve only had to charge these things two times.Even at loud volumes, there is no sound distortion. There is no distortion of base, or the voice, or the trouble.To sum up, if you are in the market for a Bluetooth speaker that can function and work outside. A speaker that also has the ability of being around water, and a speaker that can float, definitely pick one or two or three of these up.If you’re looking for indoor speakers that sound amazing when they are paired together, definitely pick up a couple of these. If you think about it, two of these cost as much as one of the competitors. Trust me, I don’t think anyone would be disappointed if they were to grab one of these, even if it’s at full price.I’ve been ranting and raving about the speakers ever since I’ve got them to all of my family and friends. Two of my buddies have already picked up several of these for their boats and RVs.Oh… Almost forgot. There is an app that goes along with the speakers. Definitely download the app. You can change sound profiles, and you also can set your own custom EQ settings.The speakers will also install their own updates when you turn them on and you open the app. It will update drivers and update its own firmware. That’s pretty awesome.","timestamp":"Reviewed in the United States January 31, 2022","profile_id":"AGSEQMSONU5HO2LUCAMQ67KFKS3A","is_verified":true,"helpful_count":18,"product_attributes":"Color: Black"},{"id":"R3PPAH3PEC8081","title":"5.0 out of 5 stars Great sound, water proof, it floats","author":"Ghendorf","rating":5,"content":"Since I already have a Soundcore Motion Boom Plus, the big brother I decided to get this one for my Nephew. Its perfect for him. A little smaller than its big brother but the right Size for a little portable. It has great sound, It paired easily and is very well made. It a quality made product. Its Waterproof So I don't have to worry about him getting it wet and he can have it around the pool without worrying about it us it also floats.* Small with good Sound* water proof* It Floats* It pairs easily* USB C port for charging fast* USB A port for charging a phone* 24 hour All day batteryBest little boombox for the price. Would recommend this to anyone looking for a smaller great sounding waterproof boombox for the go.","timestamp":"Reviewed in the United States June 18, 2024","profile_id":"AFMG4J5PO6HICXT7QSOJWM74XISQ","is_verified":true,"helpful_count":3,"product_attributes":"Color: Black"},{"id":"RRXRN4T659JSZ","title":"5.0 out of 5 stars The little speaker that could","author":"THE LITTLE SPEAKER THAT COULD !","rating":5,"content":"The ancher sound core motion boom speaker is a 10 out of 10 all-around very portable very light very durable and sounds amazing for the low price It is listed for. The only thing I can say that could see improvement Are the lower base frequencies but besides that a great bang for buck. The speaker includes two affairs and two all-around all range speakers in the front that sound incredible outside and inside. if you want to take it to the beach or the pool, you can literally submerge the whole speaker and it will float and play music as you swim and play around. Not to mention the battery last 24 hours of playing music at medium volume how amazing. After you’re done with the speaker and you need to charge all of your devices, you can connect it via the USB port in the back to any of your smart devices. You may need to charge.","timestamp":"Reviewed in the United States July 17, 2024","profile_id":"AGSDUX5L6WMMHBVJXXL4MEBQEAPQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R123EOTRRUAETZ","title":"4.0 out of 5 stars A whole lot to like, but not five stars","author":"Allen","rating":4,"content":"After reading most of the other reviews here, I was prepared to be totally wowed and bowled over.I wasn't.There is a whole lot to like about this speaker:* The 10 Ah battery lasts about a day and a half short of forever. The only BT speaker I own which beats it is the original Anker Soundcore. Real world conditions, 60 hours.* You can reverse its power to charge another device; In other words, it's also a power bank. And like I said, its battery life is so long that you could charge a 5000 mah phone from E to F from this device after it itself is full, and you'll still have half a tank left in the speaker, which will still last a long time.* Second best sound quality and rocking out ability of all my BT speakers, second only to the DOSS SoundBox XL - But that device has an actual powered subwoofer, and has a battery life as short as the Soundcore Motion Boom is long.* The Soundcore Motion Boom (SCMB) is I think the inverted version of its cousin, the Soundcore 3, which I also own. The SC3 is a small daily driver speaker that has the ability to rock out pretty hard for its size in a pinch. The SCMB is a rocking out speaker that has the ability to be a perfectly rational daily driver at lower volumes, though its size means that actually doing so is impractical, even though the unibody handle makes that not as hard as it otherwise would be.* The Anker app and its sound options, pretty good. Recommended.* The fact that it does not make any kind of noise, boops or beeps for its low battery warning (WHICH IS THE WAY IT SHOULD BE, PAY CLOSE ATTENTION, OTHER MANUFACTURERS). The red power light will flash on and off, but that's it. And that starts at around 10% battery in my observation. I would have set that at 1%, but that's just a nit pick. And it's a good thing that it makes no low battery noises, because, like I said, the battery lasts so long that even starting low battery warning noises at 1% still means you'd have a half hour or so of low battery beeping interrupting whatever you're listening to.A strange quirk that should be fixed for future generations of this product: The power button, the TWS button, the BT pairing button and the Bass-Up button are lighted. But the up/down volume rockers and the center soft function key are not lighted. I don't catch the drift of that omission.I'll also note that it accepts only 2.1 A of charging current max, so even if you charge this on a 2.4 A or higher charger, it will only take in 2.1 A, which means six hours to charge from E to F. Longer if your charging outlet is below 2.1 A. Which means charging is an overnight thing. Perhaps the next generation will upgrade to 2.4 A or maybe 3 A. With a 10 Ah battery, the charging rate should be higher. In addition, one good thing about charging is that, when it is charging, the power button stays steady red, and switches to steady white when it's done. My peeve with other BT speakers in my collection is that it uses red for charging and green for charged, or vice versa, when I'm red-green colorblind.\"Okay, so why not five stars?\"Because most of you in this review section were so extra and over the top with your cheerleading, that the sound quality, while overall pretty good not great, in terms of quality, accuracy, bass, mids, trebles, the whole nine, it's just not commensurate with the garish reviews. I'll put it another way: The only reason I am disappointed in this device is precisely because all the hype gave me over-inflated expectations.It's as if the people writing these reviews have never heard any audible sounds in their lives before. Though we know it's not that. Probably more so the truth is that they're paid shills.I'll also add that you really need to pick the right EQ options with your source material and/or the Soundcore app if you want this thing to show is good (not great) treble ability.No 3.5 mm wired headphone jack, if that matters.","timestamp":"Reviewed in the United States May 30, 2021","profile_id":"AHAXGVYQVJUIU2SKOOR4MIM4SZVQ","is_verified":true,"helpful_count":86,"product_attributes":"Color: Black"},{"id":"RLEA1CK5IC615","title":"5.0 out of 5 stars Sound and quality!","author":"DW 101","rating":5,"content":"This Bluetooth speaker is small enough to easily pack up and travel with. The materials used seems like great quality, long battery life, built solid and looks great. It's very easy to operate, connects to Bluetooth easily. The sound quality is very impressive, it's loud for being small, clean and clear sounding, there's the optional app that enables the equalizer for extra features. I've owned it for a year now and it works flawlessly still.","timestamp":"Reviewed in the United States July 2, 2024","profile_id":"AFNX4DTPX6XSJTF6BWVQSSZ7BHYA","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"R3GJFOJJ911UHH","title":"5.0 out of 5 stars Simply Amazing (and at this price, just get it!)","author":"A","rating":5,"content":"The media could not be loaded. Update - I bought a second speaker to pair them for full stereo sound. And they are amazing. We have a bonfire on the beach in a week and I know these will be great. Full stereo sound, deep bass, ultra long battery life, and so easy to pair with my phone. As noted, I have a house full of bluetooth speakers, in a side by side comparison this is simply the best speaker on the market.I have bought a dozen bluetooth speakers over the years. I bought this \"cheap\" speaker to play music while riding in a Mardi Gras parade float (All Hail Krewe of King Arthur). I figured if it got ruined, I'd be okay with it. It is simply amazing. Volume is loud and clear for a speaker this size. Bass is solid but not floor shaking (size counts with woofers). The highs are a little bright, but well within an acceptable range. Mids are solid. I put it side by side with my \"best\" bluetooth speaker and this was better at a 1/3 of the cost. The battery life is stellar. We played it continuously for 7 hours at high volume and it still had plenty of life left when we got home. At this price get two, pair them for true stereo and rock out a backyard, boat, or float. The included music in the video is from incomptech.com (royalty free and a wide range of music to accompany your videos)","timestamp":"Reviewed in the United States March 6, 2024","profile_id":"AGPB74L6Q5S2G5VWLFPMQYJC6MZA","is_verified":true,"helpful_count":7,"product_attributes":"Color: Black"},{"id":"R1GK07JYPVAM6H","title":"5.0 out of 5 stars It's great, so let's just talk about th cons...","author":"The Great Cornholio","rating":5,"content":"Five stars, just to get that out of the way. Stunning battery life, able to charge a phone in a pinch, sound quality is really good.First off, some audiophile freaks are saying that it's not \"that\" good. Look genius, these have 2.75\" speakers. If you expected more than what you're getting, you need to read less snake oil and learn more physics. I rate sound quality 1-4. Passable alone, passable in a loud place, enjoyable at home a room away, and makes-your-hairs-stand-up. This is a 3/4 on this scale which is surprising given the size of these speakers. This is what the \"nicer\" PC speakers were 20 years ago. They've come a long way...Next, I hear from other people that this should float rightside-up while in a pool or river. I agree. And I don't doubt the truth of what they say, it just never occurred to me to expect electronics to function in water unless explicitly advertised as such. This isn't advertised as a floating device, it just has a nice waterproof rating. Those are different things.Next, people say you need to download the app to get decent sound out of it. If you don't like the sound, this is true. But if your mother is over 70 years old and her hearing is going and she just wants to be able to hear music better, then the app isn't needed. I have it. I use it. I appreciate it. I even move the speaker around my rooms to make it sound better. But even I don't really need to app that much. It saves the settings, so you really only need to use the app once, if that.Next, the volume buttons really should be illuminated. I agree with the people saying that. And a pause/play button would be nice. Other than that, it's a phenomenal value for the price.","timestamp":"Reviewed in the United States December 31, 2023","profile_id":"AG4SJ5JBYXGL42GRWTRAHQMV54MQ","is_verified":true,"helpful_count":16,"product_attributes":"Color: Black"},{"id":"R30109GO569YCW","title":"5.0 out of 5 stars Boomin'","author":"Marc V.","rating":5,"content":"I'll be honest, right out the box, I was not impressed. The default Soundcore sound is very flat. Thankfully, you are able to adjust the sound with the Soundcore app's equalizer. Once I adjusted the sound to my liking, I was pleasantly surprised. Audiophiles will not be blown away by the sound, but at this price point, I can't see how some people expect $300+ sound from an under $100 speaker. Also, this thing is loud! The bass doesn't blow you over, but you feel it.So far, I've used this during tailgates and at the beach and it sounds great outdoors. It's lightweight and compact, but it doesn't look or feel cheap. I think my only \"con\" is that you can't pair with other bluetooth speakers unless it's another Soundcore Boom. Other than that, I'm happy with my purchase.","timestamp":"Reviewed in the United States August 2, 2024","profile_id":"AFVFXAKH2LI2RRYEJXDGHCHLRBEQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2DPREBVBQ8MQ7","title":"5.0 out of 5 stars Awesome","author":"Patrick Sheeley","rating":5,"content":"I don't usually write reviews but in this case I feel that I have to. I originally ordered the Sony Ult field 1 wireless ultra and after living with it for over a week and listening to different genres of music I decided that I had to return it. Not that it's a bad Bluetooth speaker but when I played bass heavy content it seemed like I constantly adjusting the bass because of the distortion I was getting;that being said content that wasn't bass heavy was ok. Another issue that I had was the volume,I thought that it would play louder than it did but it did not. Volume was \"ok\" but for my tastes I wish it had a bit more oomph to it. I've owned many Sony products in my life but this just didn't do it for me, even the equalizer on the app was about as basic as they come. Now the Souncore motion boom...this thing just sounds more meatier than the Sony did. Volume goes louder, equalizer on the app is much better than the Sony, and like I said to my ears it just sounds more thick, music has more substance to it. This looks like it's going to be a keeper, highly recommended.","timestamp":"Reviewed in the United States June 30, 2024","profile_id":"AFUNJ7HWDPAKNIYGZKQEO3VZ6PDA","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B08LQNL42Z","product_name":"Soundcore Anker Motion Boom Waterproof Bluetooth Speaker with Titanium Drivers, BassUp Technology, IPX7, 24H Playtime, App, Built-in Handle, Outdoor Speaker for Camping, Pool, Beach, Backyard","parse_status_code":12000},"created_at":"2024-08-05 07:54:34","updated_at":"2024-08-05 07:54:36","page":1,"url":"https://www.amazon.com/product-reviews/B08LQNL42Z?reviewerType=all_reviews&pageNumber=1","job_id":"7226133471809269761","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B08LQNL42Z?reviewerType=all_reviews&pageNumber=2","asin":"B08LQNL42Z","page":2,"pages":616,"reviews":[{"id":"R2U6B0N78540QJ","title":"5.0 out of 5 stars Best Bluetooth speaker I've ever heard … when using the custom 9-band EQ App","author":"Jim","rating":5,"content":"The Soundcore Motion Boom is the best sounding Bluetooth speaker I've ever heard … but only after installing the phone App and creating a custom \"mid-scoop\" EQ with it.Words fail to describe how wonderful and \"musical\" it sounds with the custom EQ. Rich, warm, full, detailed sound and effortless, deep bass.For a comparison, here are some advantages compared to the similar size JBL Xtreme 3 … which also has end-mounted, passive radiators to enhance deep bass:-- Motion Boom is $110; JBL is $380-- Motion Boom battery life is 24 hours; JBL is 15-- Motion Boom deep bass has no compression artifacts; JBL compresses at high volume-- Motion Boom sounds so much better with the 9-band custom EQ (not offered by JBL)*** Human Hearing & Loudness Contour ***Streaming music has a wide frequency range from ~50 Hz low bass to ~12kHz high treble. But human ears are most sensitive to 1kHz~5kHz … which can make music sound brash in the midrange. For more on this, do a web-search for: Fletcher Munson curve / equal loudness contour / ISO 226:2003.*** Custom EQ is The Key Feature ***The way our ears hear music is why home stereos have a \"Loudness Compensation\" button to cut mid-range. Pro musicians & sound men do the same thing with graphic equalizers and the resulting curve resembles a \"U\" or a \"smiley-face\".Being able to do this with the Soundcore phone app's 9-band EQ is a \"game changer\". It transforms the sound … but only IF you know how to set it (\"mid-scoop\" is not one of the standard Presets … it needs to be created as a custom setting)As a suggestion to Soundcore, they will get even more enthusiastic, happy customers and great reviews if \"Mid-Scoop\" is added as one of the four standard Presets in a future firmware update.*** How to Install & Activate the phone App ***1. Visit apps.apple.com or play.google.com, search for the free Soundcore app and install2. On the phone, go to Settings > Soundcore and make sure Bluetooth Access is enabled3. Turn the speaker on, pair to the phone via Bluetooth and start playing music4. Open the Soundcore app on the phone5. In the Devices section, scroll down to the Motion Series, find Motion Boom icon and click on it to activate on this phone*** How to Set the Custom EQ ***1. With Motion Boom selected. click on \"Device Settings\" on the App2. Under the word Equalizer, click on \"Soundcore Signature\" … a new view opens with four Preset EQ options (none of them are very useful in my opinion)3. Click on the small, grayed-out word \"Custom\" in the right bottom corner … a Graphic Equalizer appears with 9 adjustment points4. Move the sliders to something resembling the photo in this review … my custom \"mid-scoop\" curve which makes changes in these areas:80 Hz: up a bit - enhances deep, low bass300 & 600 Hz: down a lot - cuts \"boomy\" upper bass1.2 & 2.5 kHz: sharply down - mid-range cut for smoother sound9 kHz: up a bit - boosts treble \"sparkle\" without adding harshness*** Notes ***To prevent physical damage, many Bluetooth speakers including the JBL Xtreme 3 use electronic circuitry to limit bass output at high volume. This can create unpleasant \"compression artifacts\" … odd, flattened dynamics & popping sounds on peak transients. By comparison, the Motion Boom's deep bass is effortless & relaxed, with no noticeable artifacts.In addition to the custom EQ, this is one of Motion Boom's most remarkable features … music sounds warm, full and unprocessed. It makes me think I'm listening to a small home stereo, not a portable speaker.Motion Boom's high capacity 10,000 mAh battery is rated for 24 hour run time. It can also be used as a power bank to keep cellphones alive during power outages (plug the phone's charge cable in the USB-A connector in the back of the speaker, under the waterproof flap)A USB-A to USB-C charging cable for the speaker is in the box but you need to provide your own USB-A wall charger. With a battery this big, its much faster to recharge with a MacBook or iPad charger, not a small iPhone cube charger. Or buy an Anker charger like the PowerPort 2 Elite.With the rear rubber flap fully closed, it's waterproof and floats if dropped in water (great for days at the beach or swimming pool)If you want to splurge, buy two and pair them together as dedicated \"Right\" and \"Left\" channel speakers by pressing the TWS (True Wireless Stereo) button.I hope this review is helpful.","timestamp":"Reviewed in the United States October 11, 2021","profile_id":"AFFUKQKLKOMT4MYTEI52X4ILRPIQ","is_verified":true,"helpful_count":167,"product_attributes":"Color: Black"},{"id":"R9XH8YHEHDS90","title":"5.0 out of 5 stars Buy it. Just do it.","author":"Cole Langford","rating":5,"content":"Absolutely ridiculous for the price. Put it in a big box and rock your socks off. Very excellent sound quality for the size and price. Does a great job. If you want less bass, dont put it in a box. It will shake the floor if you put it in a box. No aux port. Boo. But other than that, absolutely wicked.","timestamp":"Reviewed in the United States July 23, 2024","profile_id":"AFOUR3FPCFC5Z4SXZSHCSKGO47VA","is_verified":true,"product_attributes":"Color: Black"},{"id":"RKEGCDM5YP2RU","title":"4.0 out of 5 stars Great for near the pool","author":"Amanda Gregg","rating":4,"content":"This puts out great sound for pool days. The only thing I don't like is that I can't tell how much battery is left. It seems to hold a charge for several days when I use it for 1-2 hours per day. I usually just charge it after 2-3 days... even though I bet it would go longer, I just don't want my music to die while I'm mid pool-day :)","timestamp":"Reviewed in the United States July 31, 2024","profile_id":"AFYZSTRQ6JEVN2GPAJHO4KAV2UXQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1PDBICVM1REG8","title":"5.0 out of 5 stars GREAT SPEAKER!!!","author":"Nick Rispoli","rating":5,"content":"USED TO BRING MY JBL CHARGE 5 WITH ME TO WORK FROM TIME TO TIME BUT JUST WASN'T LOUD ENOUGH AND IT SOUNDED GOOD BUT THE HIGHER THE VOLUME OF COURSE WOULD LAST NOT LONG AT ALL.SOUNDCORE ANKER MOTION BOOM SOUNDS GREAT AND CAN KEEP VOLUME ALL THE WAY UP AND STILL LASTS TWICE AS LONG AS THE JBL'S I HAD IN THE PAST.HAVE BEEN BRINGING SPEAKER TO WORK EVERY NIGHT AND SOUNDS GREAT AND OVER POWERS THE OTHER EMPLOYEES I WORK WITH THAT ARE ANNOYING.","timestamp":"Reviewed in the United States July 12, 2024","profile_id":"AFNKTMCIBUZKIHGYERASNYSEYAKA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R23O1K0D0UVWFZ","title":"5.0 out of 5 stars mmmmmmbass","author":"rob","rating":5,"content":"download the app to eq it etc. not a big deal.30 watts turns out not to be deafeningly loud, but quite loud enough for a remodeling jobsite. mind you, working in clients' homes, we try not to be as annoyingly loud and obnoxious as possible. that said, this thing is plenty loud!the sound quality, though, is really good. much bass.haven't tried throwing it in a lake yet, but it has gotten rained and snowed on with absolutely no ill effectsi like it","timestamp":"Reviewed in the United States July 6, 2024","profile_id":"AHPC5AP6CDJTKPHT2UDUHU5BJCMQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R13NQ34IXBYHOS","title":"5.0 out of 5 stars Love it 🤗","author":"Maria Veresh","rating":5,"content":"The speaker is badass!! The sound quality is major, especially with the base! And yes, it is waterproof! I use it in the shower! If you want an actual bluetooth speaker that's worth the money, this is it! Enjoy!","timestamp":"Reviewed in the United States July 25, 2024","profile_id":"AGTBKFF4RLTQDL57C47BSRBGR33A","is_verified":true,"product_attributes":"Color: Black"},{"id":"RJKKY6AU3TF80","title":"5.0 out of 5 stars Still amazing 3 years later","author":"C. Tomlinson","rating":5,"content":"I’ve had this speaker for 3 years. It has gone all over the earth with me. It’s still working like the day I bought it. I use this speaker nearly everyday. The battery last seemingly forever. I charge is once every two months. It’s be wet hundreds of times with no issues. I cannot recommend this speaker enough.","timestamp":"Reviewed in the United States July 13, 2024","profile_id":"AGAJR5AJUQZWWTXRISKFZFHYFXMQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1HFHF6SC95ZXS","title":"5.0 out of 5 stars She’s so loud for a small and good priced outdoor speaker","author":"AMM","rating":5,"content":"Does a great job annoying the neighbors at the pool. Has very good bass for what you need and just download the app to change the equalizer - made it 50% louder! It’s super waterproof and weighs nothing - it even connects a second one with the touch of a button! Grab one for a party or just to play your favorite tunes","timestamp":"Reviewed in the United States July 8, 2024","profile_id":"AEWHFMGIZNMB544QOOTFBM6FPPPA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2XREEU5UCU9YT","title":"5.0 out of 5 stars Great speaker","author":"daniel o","rating":5,"content":"This was better than expected. Sound is great for such a small little speaker. You can’t go wrong with this.","timestamp":"Reviewed in the United States July 28, 2024","profile_id":"AFSZCHC5GHPGYJOK74UNBC2E232Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2C2E2GVMBXQNU","title":"5.0 out of 5 stars Great for my needs","author":"WON","rating":5,"content":"I already had one of these units and I paired them using the TWS (true wireless stereo) function. It works great. Not a ton of bass, but that's fine with me.","timestamp":"Reviewed in the United States July 20, 2024","profile_id":"AGEIW4ZVAHON5TVFNZEMTEGCCV2A","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B08LQNL42Z","product_name":"Soundcore Anker Motion Boom Waterproof Bluetooth Speaker with Titanium Drivers, BassUp Technology, IPX7, 24H Playtime, App, Built-in Handle, Outdoor Speaker for Camping, Pool, Beach, Backyard","parse_status_code":12000},"created_at":"2024-08-05 07:54:34","updated_at":"2024-08-05 07:54:37","page":2,"url":"https://www.amazon.com/product-reviews/B08LQNL42Z?reviewerType=all_reviews&pageNumber=2","job_id":"7226133471809269761","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B08LQNL42Z?reviewerType=all_reviews&pageNumber=3","asin":"B08LQNL42Z","page":3,"pages":616,"reviews":[{"id":"RH3WBTE5SY14K","title":"5.0 out of 5 stars Most excellent","author":"Angie","rating":5,"content":"My first Bluetooth speaker was a Soundcore. Years later and several other BT speakers later, my Soundcore is still alive and performs like it’s brand new, while all the others have died. This led me to purchasing Soundcore BT headphones, and after that, this BT Boom. Again, ⭐️⭐️⭐️⭐️⭐️, across the board. Sound ore is more affordable than other name brands, and the app isn’t required for using these products. They all connect just fine right to your phone via BT. Highest of fives Soundcore, for producing quality and affordable products!","timestamp":"Reviewed in the United States June 20, 2024","profile_id":"AHH3UJN2XRYADITUFFMVVQE7EDVQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R32RHJMLC8WHXS","title":"5.0 out of 5 stars Simplemente increíble","author":"Dergis","rating":5,"content":"Recomiendo esta bocina, tremenda calidad de sonido y diseño, con un precio demasiado bajo para la calidad.Todavía no me lo creo.","timestamp":"Reviewed in the United States July 24, 2024","profile_id":"AGSZIOOIS4ANQM6HL6F3A3CCVCNA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R2H2R4KQ4WM851","title":"5.0 out of 5 stars Great value and performance","author":"Beth A. Heffren","rating":5,"content":"Charges quickly and love that the speaker has a handle. Great for out by the pool and on the sidelines at sporting events.","timestamp":"Reviewed in the United States July 23, 2024","profile_id":"AF74SB5AX4QRGZ6GD2YZWOZNZC2Q","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R2FE6ZK99H22GN","title":"5.0 out of 5 stars Surprisingly Good","author":"CB","rating":5,"content":"Great quality sound and connectivity.","timestamp":"Reviewed in the United States July 29, 2024","profile_id":"AEGDHOQYTSFRFAEXIYBM4USAEODA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3DVN5G7BG078P","title":"5.0 out of 5 stars Good deal","author":"MIKE J","rating":5,"content":"It's really good for the price","timestamp":"Reviewed in the United States July 24, 2024","profile_id":"AFS7ILMAPGGXFLNNGTYD56W2PUSA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1H7UNSI85G26C","title":"5.0 out of 5 stars Loud and clear","author":"Jason Day","rating":5,"content":"Best Bluetooth portable speaker I've used recently, especially in such a small size. Sound is clear, loud, and battery life is great. Setup is easy and quick.","timestamp":"Reviewed in the United States July 12, 2024","profile_id":"AER6GTPRRC4DYX6LY7G2NYMZZYMQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1D33Q0KDNO5ZK","title":"5.0 out of 5 stars Excellent","author":"S. Giddens","rating":5,"content":"Great sound. Better than expected.","timestamp":"Reviewed in the United States July 24, 2024","profile_id":"AFEDN5WRZ7E7MOJRHOS5T44YOI2A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1JZRCTVY7D7RV","title":"5.0 out of 5 stars good sound great battery life","author":"deskPotato","rating":5,"content":"connects great to our phones. download the app so you can change the equalizer and see the battery stats were on ios.sound is customizable super clear highs and impressive lows.","timestamp":"Reviewed in the United States July 6, 2024","profile_id":"AGB75XNTKR2JWG4NO2C6QH4YJNNQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R28NERXPJZD9PR","title":"5.0 out of 5 stars Very well made","author":"Cerberus","rating":5,"content":"I use this to listen to music and podcasts at home. The sound quality is good, gets nice and loud if I need it to, which normally I keep it low. Battery life lasts me about a week before needing a recharge, and never has problems staying connected.I like it.","timestamp":"Reviewed in the United States June 23, 2024","profile_id":"AGKPH5C5ORHNSFOBTRFFQMSFRC3A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2ERBUN36N4C82","title":"4.0 out of 5 stars Bought this instead of the jbl xtreme 3!","author":"H B","rating":4,"content":"If you need a speaker for a vehicle that has no car radio, you'll need at least a 30w speaker that can hold its own bass wise, as vehicle interior size is small, and roadnoise quite often drown out the bass of smaller sized speakers.Initially I had purchased the JBL Extreme 3 speaker, which undeniably sounds much better than this speaker out of the box.However, this speaker has 3 redeeming qualities that made it my preferred device, and 2 additional features that surprised me.1- most importantly is price. At half the price, and me using the xtreme 3 at work, the repeating question on my mind was \"what if this speaker gets stolen, or breaks? Can I really afford to lose a $180-250 speaker like this?\". Hence I started looking around for cheaper alternatives, and stumbled on this soundcore anker boom, which has about the same dimensions as the jbl xtreme 3 (fitting perfectly in the dash cubby holder of my company's Mercedes sprinter van).2- Both the jbl extreme, and the soundcore anker motion boom produce sufficient volume, bass, mids and treble to be used in a car or portable speaker for house parties. I'm probably not convinced they will do for outside (yard) parties by themselves, but that's what surprised me about the motion boom: it has a button to pair it with more speakers, like JBL party mode! Meaning, you can connect 2 speakers together on one device. I didn't know that feature existed on the boom too (it does exist on the boom plus).3- out of the box, I was a bit disappointed by the boom's sound quality. And while it was easy to add bass with the bass button, soundcore's speaker has an app, that allows me to adjust the eq quite nicely. All of a sudden the boom sound quality was nearing the jbl xtreme 3! I got about 90-98% of the sound quality, for half to 1/3rd the price!4- The JBL Xtreme 3 has a rated battery life of about 14 hours, but after 8 hours at moderately louder volumes (75%), the battery indicator was at about 1/3rd, indicating me there's less than 12 hours of music, and less each time the battery degrades. The motion boom has a rated battery life closer to 24 hours, but my experience playing at louder volumes is closer to 14 to 18hours, which can span 2 or 3 workdays. Another win for the boom!It's amazing that the boom can be relatively loud (75% volume), and my 5v 1A usb charger can keep up with the charge, meaning, on average this 30W speaker only uses about 5W of continuous power, and closer to 10W continuous at close to max volume.Conclusion:The sound quality was nearing the jbl xtreme 3, and volume wise the boom was actually louder, at nearly 1/3rd the price, and I was able to make the boom less sharp sounding than the xtreme thanks to the built in eq of the app, as well as adjust my sound for different music styles, and save the presets, something jbl doesn't offer in their app.The cheaper price also is less of a loss in case stolen or broken, and the battery life of the boom was better, sounding better in the higher frequencies when playing back lower bitrate (<144kbits) of mp3 files.The boom like most Bluetooth speakers, doesn't play compressed audio natively, so you'll need an intelligent device, like a phone or laptop to hear any sound.","timestamp":"Reviewed in the United States March 24, 2023","profile_id":"AHRXQBON4ZKFMHICQLXN7SIASVKA","is_verified":true,"helpful_count":82,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B08LQNL42Z","product_name":"Soundcore Anker Motion Boom Waterproof Bluetooth Speaker with Titanium Drivers, BassUp Technology, IPX7, 24H Playtime, App, Built-in Handle, Outdoor Speaker for Camping, Pool, Beach, Backyard","parse_status_code":12000},"created_at":"2024-08-05 07:54:34","updated_at":"2024-08-05 07:54:38","page":3,"url":"https://www.amazon.com/product-reviews/B08LQNL42Z?reviewerType=all_reviews&pageNumber=3","job_id":"7226133471809269761","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B08LQNL42Z?reviewerType=all_reviews&pageNumber=4","asin":"B08LQNL42Z","page":4,"pages":616,"reviews":[{"id":"R14L52NTPL57HL","title":"5.0 out of 5 stars SMALL BOX BUT GREAT SOUND","author":"Summerrat","rating":5,"content":"I purchased this item to replace a Harmon Kardon Kardon Onyx Studio 7 which has become a useless piece of junk, disconnecting from Bluetooth, turning off by itself. This box sounds great has some nice features and is not too big and bulky. If you are looking for a nice Bluetooth box I would recommend this one. I will see how the durability goes in the next year.","timestamp":"Reviewed in the United States June 13, 2024","profile_id":"AESEWJADSZWQCVYY6KKYN33SLY3A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3639CBRGN74UX","title":"5.0 out of 5 stars #Worthit - A loooong review for dual Boom setup vs Trance Go","author":"DAUN","rating":5,"content":"I finally got both my BOOMS and my TRANCE GO speakers in the mail today and got a chance to hook everything up. This response is super loooooong but, for people like us I think it's worth the read. In short - the BOOMS for the win!! \"Pound for Pound World Champion\" slams again! The Trance Go DOES have more bass.... but not that much really. Honestly I hoped they had more bass for the size & I'm surprised it didn't. It's QUITE a bit heavier than the BOOM for sure. I think taking this out to the park or beach would be much easier with the BOOM. The mids and the highs are louder on the GO but they do sound pretty harsh on my ears. Even with a custom EQ setting. None of us could hang at max inside. Too shrill. My gf and my roommate also said the GO was annoying at high volume but the BOOM sounded really clean and not too ear stabbing at max volume. Both of these tests were using dual speakers. 2 Booms or 2 Go's. Inside both these sound good (favoring the booms) outside the GO's were louder and did have more kick. Mostly mid kick. Honestly I wouldn't say these are party proof for serious party wolves. They can get the job done but compared to my friends Onyx 4 they dont hold up. But I ruled the Onyx series out because of the poor battery, no IPX, and its massive in a backpack. The nice thing about the booms is that you can have 1 person put one in their backpack and someone takes the other to split the load. I do wish that the Boom had a removable handle for easy storage (not my favorite design) I LOVE the handle on the go. It's suuper nice. Oh yeah I got both to play using the TWS or the party cast OR dual audio using the bluetooth feature on my phone. All of them work great. I did have trouble with the directions with the Party Cast with the Go's because the directions SUCK. The Youtube video says to do it one way but it doesn't work! The light doesnt turn blue and it doesnt tell you to double press the button after it blinks. The paper instructions don't tell you to double press either! I had to go to the webpage and read the instructions and do it that way. But it still wasn't correct either. They should really streamline their info. I talked with ANKER and they said you can fill out a forum on their site and a designated team will review all the comments and make changes if they see a need to. So I feel with picky people like us, we can do that and hopefully with the new \"Mega Boom Rave mini Pro 3 Plus Neo Upgraded version 3.2\" they should get it right. :/ There is a micro latency on (with all speakers) videos where you are watching someone's lips. But not too bad. After a while you get over it. I did some 3D spatial audio tests and the booms worked but not the GOs. IDK why? Oh yeah - and one other fun fact is that you can connect the Soundcore Liberty Pro 3 (maybe 2 also?) to the same track that is playing on the speakers! So right now my gf is in the kitchen listening to the same mix as me in the office. Thats handy! Hope this review helps you and others also! Party on!!","timestamp":"Reviewed in the United States April 16, 2022","profile_id":"AEDK2QJPDJSPGZLPQPXYENKCHJEQ","is_verified":true,"helpful_count":10,"product_attributes":"Color: Black"},{"id":"R4178Q9GXZT41","title":"5.0 out of 5 stars Great little sound box","author":"Andreina B Landis","rating":5,"content":"After much debate I decided on this little guy. Sound is big and bass Is surprisingly big for such a small unit.Definitely download their app which allows for an equalizer and battery status info. Connecting is easy and holds the connection for a good distance. When on sale, it is worth looking at.Only drawback is that the bass baffles on each end of the music box are not protected. Could be easily damaged if not careful when packing. Company should have not chintzed out and should have added protective grills.","timestamp":"Reviewed in the United States May 28, 2024","profile_id":"AEE3PIVQFFNJXCY2S5QSNBFWFFMA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R2CQ5UT3QNDWTJ","title":"5.0 out of 5 stars Great sound","author":"John Andreas","rating":5,"content":"Of all the Bluetooth speakers I’ve owned this is the best. Full sound, great battery life, and connects right away to my phone. Highly recommend.","timestamp":"Reviewed in the United States July 1, 2024","profile_id":"AELRTTFYP7BRAPYCVQD2IHA2SS3Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2PL2JKW3JUHHK","title":"4.0 out of 5 stars 4.5 stars.","author":"Tracy Di","rating":4,"content":"For a tiny speaker, it sounds REALLY good, IF you download the app and adjust the equalizer. Sound quality and bass are great. Realistically I'd give it 4.5 stars only because it's not as loud as I was hoping. It still suits my needs okay, but I was expecting more volume.","timestamp":"Reviewed in the United States June 14, 2024","profile_id":"AEBUWIPSCXPL7JQUPP73ZPVULKYA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R3HGF3CDK7EG28","title":"5.0 out of 5 stars Excellent speaker","author":"Sherrie","rating":5,"content":"Excellent speaker. The sound is great, the battery lasts a super long time and it is completely water proof! I love this speaker, especially for the price, you can't beat it! I have submerged it in water and it sounds great. I will play it for over 24 hours and the battery keeps going. The sound quality is excellent. I have recommended it to others since it is such a great value. I can't say enough good about it.","timestamp":"Reviewed in the United States May 28, 2024","profile_id":"AGEPSOWOUQRUGLBMCG6KXSCQZWWQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"RMT7WNR5ACE07","title":"5.0 out of 5 stars great sound","author":"Tami","rating":5,"content":"Small and powerful. Good bass.","timestamp":"Reviewed in the United States July 14, 2024","profile_id":"AH44GEUASKTV2B36J55Z7K2JYQGA","is_verified":true,"product_attributes":"Color: Black"},{"id":"RSASAAXBMQHG0","title":"5.0 out of 5 stars Works good","author":"Mark E. Wilson","rating":5,"content":"Good sound quality, good battery life , easy to use.","timestamp":"Reviewed in the United States July 9, 2024","profile_id":"AETLUJXL2N3TNX6KOT6RRT64Q7BQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1A5XXKABN3JTA","title":"5.0 out of 5 stars Versus Boom+","author":"Esot Eric","rating":5,"content":"Got this and the Motion+ at the same time as I could not decide which was right for me based on reviews. Watched a bunch of videos, but still wasn't sure.Hopefully I can make this simple for those in the same boat, the Motion+ audio quality in the highs is definitely better, however lacks bass. So a very load and clear iPhone/iPad style sound which you don't feel as there isn't real bass. If you are using it for movies/podcasts/audiobooks or anything that is primarily speaking and you want to hear what they are saying, get the Plus.If you are listening to music (especially any electronic/hip hop) then the Boom gives you that feeling from the bass that you want. While using the Plus I would never find myself jamming out, it was more of an audiophile experience trying to hear all the higher notes really clear. When I would play the same song on the Boom though, I would jam out and it feels like a lower quality version of my studio monitors.For me being able to bring this camping/boating and jamming out is something I wanted to be able to do, even though listening to podcasts is probably the primary use. The Boom sounds fine with podcasts (not as good as the Plus), but gives you a boombox style sound for music that the Plus can't get close to. And the second you go outside with these speakers, the Plus falls on its face whereas the Boom is thumping and carrying that sound.In the end I went with the Boom because it seemed more well rounded, the plus really feels like it is made for a specific purpose and I don't fit that purpose. If in doubt I would recommend the Boom to anyone, and only if you think it sounds bad, then give the Plus a shot, but for the majority I think they will prefer the Boom. And don't forget you can set custom EQs on these through the app, do some youtube searches and try out some custom EQs, that is what really made the Boom the easy choice for me.So for the Boom itself, build quality is good, this is my 3rd Soundcore/Anker speaker and they are all very durable and well made. The top handle is really sturdy and a great big handle, doesn't feel like I need to be gentle with it which is a plus as I like to travel with it, and knowing it is waterproof is a relief when in the woods. Battery life is ridiculous, I believe their 24 hour claims, typically I use mine for 1.5 hours when I shower/get ready and I have used it weeks without charging. Not sure I will ever be in the situation to fully test the battery, a full weekend of camping was no problem at all. Also love the Bass Boost button on the device so it's not reliant on the app, for podcasts I turn it off and then when I listen to music I turn it on and it works really well with the EQ setup I like.Only downside is hard to call a downside, but that would be size. If you want bigger sound you need a bigger device, so can't knock it for being big. Just be aware of this depending on your uses, if you plan on having it more stationary make sure it will fit.","timestamp":"Reviewed in the United States March 11, 2022","profile_id":"AHA7WK2SN76CQDHCUKZP3IJMN34A","is_verified":true,"helpful_count":10,"product_attributes":"Color: Black"},{"id":"R164ZQBKGNXY2V","title":"4.0 out of 5 stars Actually 4.5 stars because nothing is perfect.....but","author":"Mossydog","rating":4,"content":"Great speaker-s, good base, crisp highs, good midrange, works well in a home theater setting, and the background noise or theme music doesn't obscure the actors speaking. It also comes with an app that includes a graphic equalizer, so you can customize the sound to fit whatever space you are in at the moment.The sound quality when listening to music is good by itself, but it really shines when you pair with another Soundcore speaker. I just got my second one and the stereo quality is as good as any I've ever heard. I'm a bit of an audiophile and have owned a lot of good quality stereo and quadrophonic equipment. I also build computers and it sounds as good, or close enough to, any home entertainment system I've ever built It can be a bit tricky to pair and the app won't install on my chromebook (I exist on small portable devices like tablets, TV's, phones and the like, having ditched the Microsoft world years ago) but it does on Android phones, so no worries there, and once you figure out how your speakers pair....there are a couple of ways I've found and it is different on different devices, so I won't go into it here, but it's not difficult no matter what.I tend to charge my speakers after each use, but I haven't run either of them out of charge yet and I sometimes use them all day and on TV at night, so they last basically forever.I bought both of mine on sale, so for a total of 120 bucks, I don't know that there is any better portable music or theater sound system out there, and I've checked, so in my mind this is a an excellent value and one that I will recommend to friends and colleagues. All things considered, A solid high quality choice and a good value, one I'm comfortable recommending.","timestamp":"Reviewed in the United States January 11, 2024","profile_id":"AEP3XUFZU2L2Q6IXDYGY2RNEVNLQ","is_verified":true,"helpful_count":4,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B08LQNL42Z","product_name":"Soundcore Anker Motion Boom Waterproof Bluetooth Speaker with Titanium Drivers, BassUp Technology, IPX7, 24H Playtime, App, Built-in Handle, Outdoor Speaker for Camping, Pool, Beach, Backyard","parse_status_code":12000},"created_at":"2024-08-05 07:54:34","updated_at":"2024-08-05 07:54:38","page":4,"url":"https://www.amazon.com/product-reviews/B08LQNL42Z?reviewerType=all_reviews&pageNumber=4","job_id":"7226133471809269761","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B08LQNL42Z?reviewerType=all_reviews&pageNumber=5","asin":"B08LQNL42Z","page":5,"pages":616,"reviews":[{"id":"R3C1TN3P5ZGQK1","title":"5.0 out of 5 stars Powerful Little Guy","author":"E. F. Paredes","rating":5,"content":"The media could not be loaded. It was smaller than expected but sure packed a wallop, especially with the bass sound. This speaker is pretty much a bantam 90s subwoofer with two impressive 3\" tweeters added to it. It vibrates like a 90s subwoofer, so be careful where you set it down, lol. I foresee hours of fun strolling up and down the boardwalk with this little guy, or filling my backyard with tunes for an easy afternoon bbq. Built like a tank and worth the price. highly recommend.","timestamp":"Reviewed in the United States July 20, 2024","profile_id":"AEPLGGCFW5NYUEVG3FARJE7RU3NA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3ROVKX685VZBN","title":"5.0 out of 5 stars Excellent sound quality!","author":"Beth C.","rating":5,"content":"For a budget speaker, this sounds amazing! We've been happy with both speakers purchases from this brand. Very pleased!","timestamp":"Reviewed in the United States July 1, 2024","profile_id":"AEXMSWFJMRLFFFHZVJW2QO6FNC4A","is_verified":true,"product_attributes":"Color: Black"},{"id":"RL9IVDLXU9YHU","title":"5.0 out of 5 stars Sleeker","author":"Cynthia R Warr","rating":5,"content":"Love itGreat sound","timestamp":"Reviewed in the United States July 14, 2024","profile_id":"AH24LGD3R6K2IHGD4QQCRB3KKUPQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2K1R85ZXJA4MZ","title":"5.0 out of 5 stars Very good","author":"Joel Demegillo","rating":5,"content":"This is wow product, highly recommended this product","timestamp":"Reviewed in the United States July 11, 2024","profile_id":"AGBV4W7XMAXT5SXFOV3YZO6LB4BQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R5AOQRS0MQYII","title":"5.0 out of 5 stars Great at it’s price","author":"Amazon Customer","rating":5,"content":"Great at it price. I’ve had it for 3 years.","timestamp":"Reviewed in the United States July 7, 2024","profile_id":"AGLRDUKMPVZHR23GT77H4OFFMUUQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2505UT3AVLV0R","title":"5.0 out of 5 stars Muy buen producto","author":"Alfonso Nicho Cortez","rating":5,"content":"Cumple con las especificaciones","timestamp":"Reviewed in the United States July 10, 2024","profile_id":"AEHUHTUMHKMN2NKS7QHS7RIJ65PQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R8FVPDSUXW20U","title":"5.0 out of 5 stars Great sound!!!","author":"cmar7","rating":5,"content":"Purchased for back deck and hangout out in yard. Great sound, stays paired, and has excellent battery life.","timestamp":"Reviewed in the United States June 23, 2024","profile_id":"AGXDRBIAOGHAKNG6GNQB764ASW4A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2BP5RLJUH8NZO","title":"5.0 out of 5 stars Huge sound, from a little box","author":"John Kirton","rating":5,"content":"Connect quickly with any Bluetooth set up. I use it with my phone and with my laptop works great for hooking my laptop up with my projector and this is my sound source to take on outdoor trips.","timestamp":"Reviewed in the United States June 12, 2024","profile_id":"AFMTNN6S6A3Y57DFI7OXD7KFCGEA","is_verified":true,"product_attributes":"Color: Black"},{"id":"RJ7MDBE4OMES9","title":"5.0 out of 5 stars Best in sub-$150 class!","author":"B. M. Hinz","rating":5,"content":"I tried it against bose sound flex, jbl flip 6, jbl charge 5, ue boom 3. (Top competitors)This speaker has more bass and is louder than the rest! I was looking for someone cheaper to use in my garage. I love the flip 6, but it's not up to lighting up a garage. The boom motion is PLENTY loud enough for my garage without distortion or loss of bass!I am buying a second to pair up with the first!Thank YOU, Alan Ross, for your reviews!Ue boom 3 has no bass, sounds poor. Flip 6 is awesome, but taking it back, not enough bass for larger spaces. Bose is just not loud enough.Motion boom is a HANDS DOWN winner! And cheaper than the rest!","timestamp":"Reviewed in the United States April 24, 2024","profile_id":"AHJJXYHDVJ3RVOGDMYPX7FFSQ65Q","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R34OCBRN3NPBNA","title":"5.0 out of 5 stars Great quality sound & power for a reasonable price","author":"Ridge Runner","rating":5,"content":"This being my 1st bluetooth speaker, I was unsure what expect, but I am very pleased with this product! I had considered a much larger speaker on wheels but was discouraged by its price and weight so I ordered this item & am very pleased with its quality, sound, size, weight, bass boost feature, ease of use & portability! It has the power to fill any room with excellent sound at about half volume, so it has more to give if needed! Very happy, would recommend & purchase again","timestamp":"Reviewed in the United States May 14, 2024","profile_id":"AEQO3BMNMEUFOMFO6PXUFR4D3YKQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B08LQNL42Z","product_name":"Soundcore Anker Motion Boom Waterproof Bluetooth Speaker with Titanium Drivers, BassUp Technology, IPX7, 24H Playtime, App, Built-in Handle, Outdoor Speaker for Camping, Pool, Beach, Backyard","parse_status_code":12000},"created_at":"2024-08-05 07:54:34","updated_at":"2024-08-05 07:54:39","page":5,"url":"https://www.amazon.com/product-reviews/B08LQNL42Z?reviewerType=all_reviews&pageNumber=5","job_id":"7226133471809269761","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B08LQNL42Z?reviewerType=all_reviews&pageNumber=6","asin":"B08LQNL42Z","page":6,"pages":616,"reviews":[{"id":"RCUG61N9ZLHIP","title":"5.0 out of 5 stars I LOVE This Speaker - So do the Kids!","author":"LocalYokal","rating":5,"content":"This is the perfect speaker for party time with my kiddos! It is loud enough to rock our family room. Indoor dance parties, decent sound outdoors, it is just what we needed. I like the EQ options through the app, and the fact that the app allows me to turn the speaker off. It is much more affordable from other similar sized speakers, and I have no complaints about sound quality. If you looking for a loud little speaker at this size, this is what you need!","timestamp":"Reviewed in the United States May 8, 2024","profile_id":"AE2UZMTJQ6JS3ZDBL4L23BAAAJXA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2YLH1N5H3KWRQ","title":"5.0 out of 5 stars Works","author":"J","rating":5,"content":"Great Value for the money. Works great.","timestamp":"Reviewed in the United States June 25, 2024","profile_id":"AGIRXMPG2IGDARCKNJ7VZBYOJ72Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2KLQL4FP1QI50","title":"5.0 out of 5 stars Insane bass, lightweight, customizable eq, great sound quality, good battery","author":"Philip Bourke","rating":5,"content":"This speaker I snagged for $80 and it is easily one of the best portable speakers for bass. I previously had the Bose soundflex but it didn’t have enough bass for me (while the sound quality was insane, I love bass and wanted more). I thought I might be sacrificing sound quality for bass by switching from the Soundflex to the Motion Boom but I can’t say I really have lost any sound quality but rather actually gained some. I also considered getting a JBL speaker but I wanted something that really packed a punch with bass and risked this one. Insane what you get for the price.Unless you are planning on spending a lot of money, I would definitely recommend this one.The handle makes it super portable. Not very heavy.The battery life is as advertised.The customizable eq is what makes this sound really good. Out of the box it is decent, but I would try these following settings to get insane bass without sacrificing sound quality:Hertz: Slider80 +8150. +4300. -1600. -21.2k. +12.5k. +25k. +69k. +613k. +1This can all be done with the soundcore app. The hertz is on the x axis of the equalizer and the +/- is the adjustable line in regards to the y axis.I always listen with the bass boost on. I also highly recommend placing the speaker right up against a wall or in a corner to amplify sound and bass.","timestamp":"Reviewed in the United States January 1, 2024","profile_id":"AF5C2HI2OXOKIRNTPMCB2DDEB5XA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"RWNAWY8OHYJA","title":"5.0 out of 5 stars I like it!","author":"DJ EJ ones","rating":5,"content":"Edit: I did a little custom paint job with my Motion Boom. It involves delicately removing the 2 side pieces. Removing the speaker grill. Separating it from the plastic. Sanding down the black paint. And spraying it with your prefered color. Which brings to mind the one thing that this speaker could be lacking is different color choice options. Anyways here is an idea. If you attempt I recommend to turn it off first, be gentle, take your time, and start removing the 2 side pieces in the back in case you make any scratches you won't have to see them from the front.Great portable bluetooth speaker. Looks cute, has a useful handle, charges via USB C, and can charge your phone (at a crawl, but enough for an emergency) through the USB A port. The sound is good, and even better after you adjust the EQ to your preference.I advise that you download the Soundcore app to your phone to adjust the EQ and to quickly update the firmware.Also a quick perusal of the quick start guide is advised so that you know what's what with your speaker and so that you don't complain about not being able to skip songs via the speaker in your review like another review did (to do that you just double press the Soundcore play/pause button).It's a fun device that should satisy almost anyone who uses it correctly (again update the firmware and set the EQ to your liking). You can also use it in concert with another device of the same model, the device has a dedicated button for that function to make it easy. Haven't used that yet but from what I've read it sounds even better and louder than one alone.I remember reading a review complaining about the battery life. That has not been my experience. Battery life is more than adequate. I think this person may have recieved a lemon. These things happen. In these types of cases you should exchange it if you still can through Amazon. If not contact Souncore as the device comes with an 18 month warranty. I myself got the speaker on sale and the 3 year warranty was only $10 so I got that for added peace of mind. But with the water proof/resistance rating and the very solid build I don't anticipate needing to utilize the warranty.Overall, very pleased with my purchase. If you want something that gets even louder, sounds even better, and has dust/dirt protection in addition to watter resistance than I advise you to get the Motion Boom Plus. That one is more expensive and not quite as easily portable but that will be the correct choice for some folks.Best of luck to you and have fun with your speaker. And be mindful of neighbors. And no mumble rap please. These speakers and anyone within earshot deserve better!","timestamp":"Reviewed in the United States July 31, 2022","profile_id":"AFN6GMFSBCTWAJXXIF5EZ3S2OB3A","is_verified":true,"helpful_count":38,"product_attributes":"Color: Black"},{"id":"R13XSBIE0XNBX0","title":"5.0 out of 5 stars Excelente equipo","author":"Manuel Acevedo","rating":5,"content":"Suena bien , como para cargar","timestamp":"Reviewed in the United States June 20, 2024","profile_id":"AGIOAMJRBVEZ4SX3EJ4C3BLLVN6A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2EEB94JSH5H0R","title":"5.0 out of 5 stars Solid built speaker with good sound","author":"Ellie84","rating":5,"content":"I bought this to replace the soundbar sitting on my workspace desk. I needed something portable that I could also use when I go camping with the kids. This fit the bill and the price was on point. The sound quality is better than I expected and the fact that you can have multiple units synchronized is even better.The overall feel of the speaker is hard plastic with a mesh cover over the front of the speaker, but this doesn't detract from the quality of the item. I haven't tested the waterproof rating so cant speak to that but I am presuming that the hard plastic feel is due to the waterproofing.As far as sound quality goes this is a 30w system and pushes a decent bass feel. I tried different genres of music and the best quality came in on pop/rnb/dance with rock a close second place. It does get a little scratchy on the treble at higher volumes but if you're not planning on max volume you should be fine.Easy to setup and no issues out of the box. In my opinion for the price I paid I could not have received a better sounding bluetooth speaker.","timestamp":"Reviewed in the United States January 17, 2024","profile_id":"AHKQCIY3XMIU6YXHX3QLPF73NAMA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R30MTFK79XRTK2","title":"5.0 out of 5 stars Works really good","author":"Tiffany Duran","rating":5,"content":"I got this for my son. He was wanting a Bluetooth speaker that has good bass but I didn't want to spend over $100.We're very happy with this speaker, and the bass is pretty good for a smaller speaker.","timestamp":"Reviewed in the United States May 26, 2024","profile_id":"AGLRZH3ERCSLRXPN6MC2HNUY7DLQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1B7JZIMRSYHCR","title":"5.0 out of 5 stars Best Speaker I Have Ever Used","author":"Randy Neves","rating":5,"content":"After searching for a bit I decided to give Soundcore a shot, and I am blown away with the quality that I got for 90$. I have owned UE, Bose, Beats, JBL and several other brands, and the only brand I can say comes close is UE, but for 90$ you can buy a speaker that competes with these high end brands at a cost of a 1/3 of them, and get something that although is a plastic body, is durable, water proof with the ability to float. This speaker has good weight to it, lighter than what I was anticipating, and in a good way. The implemented handle is something I love and makes carrying it distances much easier than having to hold it in both hands or get a carry on case. As well as having a battery life that can last 24 hours, this speaker outshine majority of the competition out there.The speaker has several buttons on it, such as volume up/down, with the pause button in the middle using the Soundcore app logo, which I didn't know when I first got it, but upon finding out thought it was a nice touch. There is also a Bluetooth pairing button, as well as a \"party mode\" button labeled TWS which allows users who own multiple Soundcore speakers to pair up to 100 speakers together! (This is something I will test in the future, and will be sure to edit this review if I remember lol) And finally there is a BASS button which can enable/disable bass, which IMO is a brilliant feature just for having that functionality available. (it is recommended to keep bass on for it makes the sound quality much better, but it is nice to have that dedicated button)As for sound quality, out of the box it is okay, the highs are decent, but what separates this speaker from other brands is the app. The app is extremely well made, with the ability to having custom EQ settings with some presets that can help those who are not experienced with toggling EQ settings. Another feature I love is that Soundcore works LUM who is the streaming partner of Soundcore. With LUM you have access to smaller less known artists, and I love the idea of not only being able to find new artist, but for those who don't have a music subscription like Spotify, or Amazon Music, Soundcore can allow users a way to stream music all for FREE! My only gripe with the app is the inability to change tracks if you are using a different streaming app, but its a very minor issue, than doesn't change my opinion on this app and speaker.Overall this speaker is worth the money, and I recommend this to anyone who wants another option from these bigger companies that tend to focus on marketing instead of making good speakers. I love this speaker and will be sure to buy more Soundcore products in the near future!","timestamp":"Reviewed in the United States July 30, 2021","profile_id":"AFW4OEVJATBFASN4BJGYRC6IY6CA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3R8KR5JEIQM4F","title":"5.0 out of 5 stars Look no further, just get it. (Update) So nice, I bought it thrice.","author":"Just Me","rating":5,"content":"Quick story. I purchased two Harmon Kardon Go + Play Speakers for my wife. One for my wife's home yoga studio where she teaches and one for her home massage therapy room where she performs licensed massage therapy on her clients. I got them both on sale for 180 each which IMO was a steal. (HK msrp of 400 is insanely inflated, but I would pay up to 220 for these guys)My wife also performs licensed massage therapy at a spa with another owner and teaches yoga once a week at an outside gym. I did not want the HK go+play speakers to travel so I started researching budget speakers on YT. I first tried the Bugani M90 which comes in around $50. It wasn't a terrible speaker, had presence and was sparkly, but the lows/bass imo were completely lacking compared to the reviews. It went back. I then went back and forth on the motion boom and the motion plus. I'm no audiophile, but again, IMO the boom just has that warmth and presence from the bass that the motion plus lacks. It just warms up the room. And with the eq mode app from Soundcore, you can fine tune it to get really really close to the motion plus clarity but still gain the low end bass.Alot are excited that Anker crammed five speakers in the plus, but I would almost be willing to bet in a blind test and listen, if the listener had no visuals and never saw these speakers and heard them playing side by side they would probably go with the boom cause it's a room filler, has low end and just sounds all around fantastic.Looks - honestly the boom is a little ugly and cheap looking with the plasticy body and fugly handle.....But, don't judge a book by its cover. This ugly guy sings.So, the boom is going to go back and forth between my wife's away location at the spa and location at the gym because it pumps enough where she can use it at the gym when teaching. Ambient music used during yoga seems to use a lot of low end frequencies for meditation.Also, Im not losing HK go play money on a speaker if someone takes it. Is the boom as good as her HK go play? Nope. Is it good enough that it can still get the job done at half what I paid for the go play and still bring a smile to my face. Absolutely. For less than a large bill, look no further. The boom is a mini bumper that sounds amazing. Awesome job, Soundcore. Update. Loved this thing so much I purchased another to go back and forth from garage to pool.Update again: Purchased another. Taking the garage/pool one (2nd) and the third one on the stand up paddle boards and linking them up when on the lake with my wife.Also, pairing two of these together puts these speakers in beast mode. Sound linked up together fantastic. If you can, try to catch them on sale when they are 75-80 each. Unbeatable.","timestamp":"Reviewed in the United States January 13, 2021","profile_id":"AGT6C2Q5EXBXLONWA6ZGOSUGSQBA","is_verified":true,"helpful_count":147,"product_attributes":"Color: Black"},{"id":"R43YUOJL54IU7","title":"5.0 out of 5 stars Great speaker since 2022","author":"joe bloew","rating":5,"content":"Great sound, battery life and it's WATERPROOF!","timestamp":"Reviewed in the United States June 19, 2024","profile_id":"AHNLNZBHBWKAZCDCUVHJE366M5DA","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B08LQNL42Z","product_name":"Soundcore Anker Motion Boom Waterproof Bluetooth Speaker with Titanium Drivers, BassUp Technology, IPX7, 24H Playtime, App, Built-in Handle, Outdoor Speaker for Camping, Pool, Beach, Backyard","parse_status_code":12000},"created_at":"2024-08-05 07:54:34","updated_at":"2024-08-05 07:54:40","page":6,"url":"https://www.amazon.com/product-reviews/B08LQNL42Z?reviewerType=all_reviews&pageNumber=6","job_id":"7226133471809269761","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B08LQNL42Z?reviewerType=all_reviews&pageNumber=7","asin":"B08LQNL42Z","page":7,"pages":616,"reviews":[{"id":"R22PQCLT81IQIM","title":"5.0 out of 5 stars Great sound quality and battery life!","author":"JimmieC","rating":5,"content":"This has a wonderful deep and full sound for a portable bluetooth speaker! It gives a healthy amount of bass, while still giving a clear and concise sound that isn't just dominated by bass.I use it to play music samples for my church choir during rehearsals. We rehearse in church, and it gives them a clear sound, but even has the ability to fill a worship space for 1200 people with a nice clear sound that still has depth.I am very impressed with this speaker.","timestamp":"Reviewed in the United States April 29, 2024","profile_id":"AG26QPXIBNVW65A4UTTX3RCVYVJA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1FFN5LQ57F3BW","title":"5.0 out of 5 stars Best bang for your buck on a small bluetooth portable","author":"G Wong","rating":5,"content":"I purchased the Anker Motion Boom Bluetooth Speaker back in 2021 and it still provides excellent sound. The best part is that the battery lasts forever and the bass boost really packs a punch. I've been so happy with this speaker that I recommend it to my family and friends.","timestamp":"Reviewed in the United States May 15, 2024","profile_id":"AGFEVMPF6XCQCHJTANODLYBRSXFQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R2KZB9EM1OJZOY","title":"5.0 out of 5 stars Great sound","author":"Ernie Camacho","rating":5,"content":"Super impressed by the sound this speaker can generate","timestamp":"Reviewed in the United States June 13, 2024","profile_id":"AGCSUK6QXNKOBLXZXRWBSUXM7F6A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1OXH8ZW6A61UM","title":"5.0 out of 5 stars Beautiful sound","author":"Marilyn DeGannes","rating":5,"content":"Love it. Holds the charge for a long while and the sound is great. I am using this in my new gazebo, and I quite pleased with it.","timestamp":"Reviewed in the United States May 27, 2024","profile_id":"AEGGPR6UOZ72IWLYM2SDEU326INA","is_verified":true,"product_attributes":"Color: Black"},{"id":"RI9D4LYVRM60K","title":"5.0 out of 5 stars Great for travel and excellent sound.","author":"Mishka","rating":5,"content":"I like waterproof nature and ease of use by downloading an app. Definitely a great system as long as you have Bluetooth which is how you play sound from your phone, YouTube, etc. 24 hour charge life!! Has 2 different USB with heavy rubber cover for waterproof nature.","timestamp":"Reviewed in the United States May 20, 2024","profile_id":"AHPSTK5NGJTQIHUT6PSGNU3AM5TQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R3P7W765JDYHQ0","title":"5.0 out of 5 stars Soundcore","author":"aimee w.","rating":5,"content":"Awesome","timestamp":"Reviewed in the United States June 21, 2024","profile_id":"AELC4OOOEPYDCYLGTNILWMVCZLGA","is_verified":true,"product_attributes":"Color: Black"},{"id":"RM4U247CJKYPG","title":"5.0 out of 5 stars Buy it","author":"Austin Evans","rating":5,"content":"Incredible volume and bass","timestamp":"Reviewed in the United States June 16, 2024","profile_id":"AFQVR2B7GWYO4KKJSGBJBQJFI4BA","is_verified":true,"product_attributes":"Color: Black"},{"id":"RJA4EU91P465K","title":"5.0 out of 5 stars I REALLY TOP NOTCH QUALITY AND VOLUME SPEAKER","author":"DTR6484","rating":5,"content":"Yes indeed! I was on the fence with this purchase; and I was thinking about spending twice the cost for a better guarantee of loud clean Bluetooth speaker action. I grew up before the EarPods and earbuds current era that makes great sense. But my old school self doesn’t feel right unless I have some blowback from the speakers playing. We had near concert custom made mega speakers and the best vinyl tech possible. The volume was how we escaped into a world of personal intake of the 70’s——So I have had many good Bluetooth speakers that have worked well but still I have been often bummed by the volume if not the integrity of the music when playing from a equalizer from the App Store. Now especially with the lyrics available on Apple Music… it just was a focus upon the EarPods that kept the speakers from working the way this one does. With the brilliance of such EarPods as Jabra and the inclusion of an equalizer specific to the EarPods… things are getting it right and not depending upon third party apps for the boost in bass and sound. This is a great selection for the current selections of awesome new Bluetooth speakers. I have been an Anker fan since I first bought a very small electicity Bluetooth speaker that blew my larger speaker away. Anker either designed this first version of the many too come circular 360 º small speakers that are still excellent. But this is next level for a reasonable price. Less than $100 delivered isabout what I have paid for several name brands that were good but not like this good. The app that you can download is really simple and nothing to worry about having to mess with and go through the pain of exact or weird settings. The basic equalizer setting is perfect. The sound is crisp and loud enough. It still isn’t close to the 7 feet tall speakers of ‘72… but the ability to just play your music from the Apple app makes this very nice. I am betting that the Sonos and the new Sony and JBL all crank massive great volume and texture. But I would not worry about paying an extra chunk of $$ unless you are a total OCD music person who has no limits. My brother is like that and he doesn’t even shop for the Sam reason that he goes to the brand new and continues upgrading. But even though I spend a considerable amount on new products that are? This time I really feel that this was a great deal and bravo to Anker. They just keep getting better and stay affordable.","timestamp":"Reviewed in the United States July 11, 2021","profile_id":"AF7T7ZHBGF24JVDBTF6T73MTLY3Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"RIBFSQX772DZP","title":"4.0 out of 5 stars Works great","author":"Jewels58","rating":4,"content":"My husband loves this. Uses it out in the garage and around the pool. I also bought the case that goes with it. Very glad I did.","timestamp":"Reviewed in the United States May 3, 2024","profile_id":"AFPTVIKCCFD6Q4QC7ABLBG2IQP4Q","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"RY5040EGLZE77","title":"5.0 out of 5 stars Load music lovers","author":"jeri bishop","rating":5,"content":"You can listen to music for a long time before you have to charge","timestamp":"Reviewed in the United States June 7, 2024","profile_id":"AH5ASDZ2VRRB3AGS3RHMCHYWWBJQ","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B08LQNL42Z","product_name":"Soundcore Anker Motion Boom Waterproof Bluetooth Speaker with Titanium Drivers, BassUp Technology, IPX7, 24H Playtime, App, Built-in Handle, Outdoor Speaker for Camping, Pool, Beach, Backyard","parse_status_code":12000},"created_at":"2024-08-05 07:54:34","updated_at":"2024-08-05 07:54:41","page":7,"url":"https://www.amazon.com/product-reviews/B08LQNL42Z?reviewerType=all_reviews&pageNumber=7","job_id":"7226133471809269761","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B08LQNL42Z?reviewerType=all_reviews&pageNumber=8","asin":"B08LQNL42Z","page":8,"pages":616,"reviews":[{"id":"R244POB6X33ZCB","title":"4.0 out of 5 stars Impressive sound for a little guy, but no headphone jack","author":"BeansOfDoom27","rating":4,"content":"I was amazed by the quality of the sound from this little speaker. The bass, treble and mids are all relatively good for a high quality sound system. I'm not an audiophile, so the sound quality is good enough for me. My only gripe is that it doesn't have a headphone jack, which surprised me seeing as phones these days that have a headphone jack do very well with liquid submersion, and could've easily been added as one of the ports behind the rubber door in the back with the USB ports. That way, the port is still protected from liquid and dust anyway. There's also no mention of the fact that this speaker doesn't have a headphone jack, which would've been nice to know before I bought it. Also, as another reviewer here mentioned, I, too find it weird that there's no backlighting for the play/pause button as well as the volume up and down buttons, which definitely makes adjusting the volume a bit cumbersome.","timestamp":"Reviewed in the United States December 5, 2023","profile_id":"AHWXXOQJTMJQCL57GMS7X4KKHAHA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R3I2T6V2W1CS3N","title":"4.0 out of 5 stars Really great sound for the price. A couple of things kept me from giving it five stars though.","author":"Kindle Customer","rating":4,"content":"I’ve had this for three months now, and here are my thoughts.First off, this sounds amazing! I love Anker products. I have used their keyboards, charging cables, wall chargers, and headphones. I’ve had my, Anker Soundcore Life 2 Neo headphones, for almost three years now. I’m pretty picky about sound quality, but also on a bit of a budget. Back in 2020, my husband got me the headphones, which I thought I would keep for a few months, and replace with something better. Three years later, and I’m still happy with them, so I thought, i’ve been happy with all of my other purchases from this company, especially my headphones, this has great reviews, so why not take a chance on this speaker? Oh. It was on sale too! That also helped me decide.Last week was the Super Bowl, and my husband and I listened to the game on the speaker. It sounded great! I listen to a wide variety of music, and so far, this speaker has performed pretty well. I’m also surprised at how long the battery lasts in this thing.Now, here are a couple of things that I don’t like about this speaker. First of all, unlike with the headphones that I have, where you can skip backwards and forwards through the tracks, you’re not able to do this with the speaker. That’s kind of inconvenient if my phone is in a different room, and I’d like to skip a track or something.The only other complaint that I have about this speaker is, I wish that it was easier to adjust the sound, and the equalizer.I wish that there were buttons to do it on the speakers, or Sliders that were easier to use with voiceover through the app. I am totally blind, and if you don’t like the presets, it’s kind of hard to get it adjusted just right.Thanks to the reviewer who posted a diagram of how it should be adjusted for optimum sound, my husband, who is cited, was able to do it for me through the app.Overall, I am very pleased with this speaker. I’m glad I didn’t waste big money on a Bose. My daughter has one, and I think this little speaker sounds better than her way more expensive one.","timestamp":"Reviewed in the United States February 19, 2023","profile_id":"AEYIVZMSSWUGEELX53QPMIQGNXSA","is_verified":true,"helpful_count":19,"product_attributes":"Color: Black"},{"id":"R2I9P86A719KBK","title":"5.0 out of 5 stars A Powerhouse of Sound!","author":"TK","rating":5,"content":"Titanium Drivers for Crisp Sound (5/5):The titanium drivers in this speaker produce crisp and clear audio, allowing you to enjoy your music, podcasts, and calls with outstanding clarity and precision. The sound quality is truly impressive for a portable speaker.BassUp Technology (5/5):The BassUp technology takes your listening experience to the next level. It enhances the bass response, providing deep, rich, and punchy low frequencies that bring your music to life. The result is a well-balanced and immersive audio experience.Waterproof and Durable (5/5):The waterproof rating ensures that you can take this speaker to the pool, beach, or any outdoor adventure without worry. It's built to withstand splashes, rain, and even full immersion in water, making it a rugged and reliable companion.Long Battery Life (5/5):The extended battery life of the Soundcore Motion Boom allows you to enjoy your music for hours on end. Whether you're on a camping trip or hosting a backyard BBQ, this speaker keeps the party going.Dual Pairing (5/5):The ability to pair two Motion Boom speakers together for stereo sound is a fantastic feature. It creates a wider soundstage and enhances the overall listening experience, making it perfect for larger gatherings.Sturdy Build (5/5):The speaker's build quality is top-notch. It feels solid and durable, ready to withstand the rigors of outdoor use and travel. The rubberized exterior provides extra protection.Intuitive Controls (5/5):The control buttons are easy to use, allowing you to adjust volume, skip tracks, and activate voice assistants with ease. The built-in microphone for hands-free calling is a convenient addition.One thing is I wish you could turn off the startup and turn off sounds or at least adjust the volume of it. It is very loud every time.","timestamp":"Reviewed in the United States September 17, 2023","profile_id":"AGCWDULZQA36GD3J42HTAKFAKPGA","is_verified":true,"helpful_count":7,"product_attributes":"Color: Black"},{"id":"R3IQX56G827Q1D","title":"5.0 out of 5 stars Loud AF 🔊","author":"Matthew Kaminski","rating":5,"content":"Very very good durable Bluetooth speaker very loud with good base and for the price you can't be disappointed fast charging and good battery life as well waterproof this thing's almost louder than my surround sound system to my TV you might even be able to use it as one it's that good if your TV has Bluetooth capabilities it would make a good soundbar or just all around a good Bluetooth speaker can't go wrong or just all around a good Bluetooth speaker can't go wrong","timestamp":"Reviewed in the United States April 21, 2024","profile_id":"AF27QLULBQ5CVND5CD25KEO6W65Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"R12LAOBDYCGQ4B","title":"5.0 out of 5 stars No regrets; I love mine","author":"Susan Fletcher","rating":5,"content":"Easy to use, sounds great, long-life battery, good range. Rock solid construction, nice quality. I have mine paired with my desktop computer. As soon as I turn the power on it connects. My computer is on one far end of the house and I can carry this into rooms on the opposite side without losing Bluetooth signal. I can even carry it outside so I can listen to music while working outdoors. It surpassed my expectations. Looks nice, too. I've found the size happens to be perfect for the in-wall shelves in the bathroom too and would look right at home there permanently to mask my singing in the shower with real music. ; )","timestamp":"Reviewed in the United States March 15, 2024","profile_id":"AGMNET33VOKQ75RPMOCQ4RSZX72A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2B529I76DPWUO","title":"5.0 out of 5 stars Absolutely mind-blowing sound for such a compact unit","author":"Jason A. Kentros","rating":5,"content":"This speaker is one of the most impressive in terms of bang for the buck and the amount of sound it puts out for its size that I've ever seen/heard. It has great battery life, it's very lightweight and fills a fairly large-sized room with crystal clear highs and impressive bass response. Additionally, Anker is an EXCELLENT company whose customer service is commendable. They helped me with a problem my son encountered with a different product with very little \"paperwork\" or effort on my part. Nothing is more refreshing and impressive to me than a company that stands by its products and focuses on customer satisfaction. I HIGHLY recommend this speaker as your new go-to party boombox!**NOTE: I have not tested whether it is actually waterproof and don't intend to find out.","timestamp":"Reviewed in the United States February 19, 2024","profile_id":"AFPDT52ESRJZZH7OCYADRUKZGTIQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"R33IOPEJR155XX","title":"5.0 out of 5 stars Great Bluetooth speaker","author":"Rozwell97","rating":5,"content":"This was recommended by a friend and I am very happy with it. Great sound for the price! I use it in the garage, the yard and even in my classic Chevy Nova. It really has a lot of base and surprising volume for the money. I just tell Siri on my iPhone what to play and it has pretty good range, I can have it about 100 feet from my phone. Will buy another.","timestamp":"Reviewed in the United States April 21, 2024","profile_id":"AHDRBBH7AXWQVVUPKDFBBQZAEBAA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1KHRALEKTJFO","title":"5.0 out of 5 stars Great speaker","author":"Jeanette Trottier","rating":5,"content":"This speaker is so nice it works so well, connects fast, sound is very clear, isnt to big, this is the best speaker I’ve used.","timestamp":"Reviewed in the United States May 19, 2024","profile_id":"AGRVVBZ3EMZUWT6UT3B7SJZARS4A","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R2QTT6TVJBPXW0","title":"5.0 out of 5 stars 2nd Time Around","author":"AbolishKlausSchwab","rating":5,"content":"I bought one a year ago so I can’t speak on longevity but it became an appendage, basically. The little effer went EVERYWHERE with me, rain, snow and sunshine. Until I lost it and bought a 2nd one. Sound is fantastic for my needs. I’ve started dance parties outside the beer pubs with this thing, accompanied by Pandora. I think this new one has more robust sound but it may just be true love. Five stars and recommended again and again.","timestamp":"Reviewed in the United States April 12, 2024","profile_id":"AF6LU33V4KLNEELFKFXGQUG6I26Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3DA0KY4YJ5AIE","title":"4.0 out of 5 stars I would say the sound is mid-level","author":"Onur Can","rating":4,"content":"Expensive price for performance","timestamp":"Reviewed in the United States May 8, 2024","profile_id":"AHYSAU6YPRSXPCHGBCZBR4SQR6GQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B08LQNL42Z","product_name":"Soundcore Anker Motion Boom Waterproof Bluetooth Speaker with Titanium Drivers, BassUp Technology, IPX7, 24H Playtime, App, Built-in Handle, Outdoor Speaker for Camping, Pool, Beach, Backyard","parse_status_code":12000},"created_at":"2024-08-05 07:54:34","updated_at":"2024-08-05 07:54:42","page":8,"url":"https://www.amazon.com/product-reviews/B08LQNL42Z?reviewerType=all_reviews&pageNumber=8","job_id":"7226133471809269761","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B08LQNL42Z?reviewerType=all_reviews&pageNumber=9","asin":"B08LQNL42Z","page":9,"pages":616,"reviews":[{"id":"RBDQYVX5FWD0T","title":"5.0 out of 5 stars It’s been great","author":"Mj reviewin","rating":5,"content":"After almost 4 month of usage Im happy with it, this is my second Anker speaker and this was a really good upgrade the bass is really good I used it at outdoor yesterday and for open basketball court It is no that great but when it comes to your room is really good like it really boom, battery is great but remember this 24 hours is not at full volume but still great batery I would buy it again no brainer.Also there is two songs (Am I living,Superheroes both produced by Metro Boomin)that with standard equalizer in some parts of the song sound weird I set up on equalizer voice or treble and it is goes away ***********. JBL Charge 5 vs Anker Motion BoomJBL has better sound like voices are more clearly but Anker has more Bass , I get my Anker just for $80 so then I think either one is a great choice","timestamp":"Reviewed in the United States January 16, 2024","profile_id":"AGGDLYRBECLQWTXVGFK7CZE3MYZA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R14BXDXQJFJFLC","title":"5.0 out of 5 stars Wow. An extreme value!","author":"Justin Time","rating":5,"content":"Is this the greatest thing I've ever heard? Nope. HOWEVER For the price this is an extreme value and in a lot of instances \"good enough\". I find in bluetooth speakers I'm normally hoping for either more clarity, more volume, or more bass.So indoors the volume on this thing far exceeds your needs. I like it loud and I am not shy about turning up the volume. I can say inside this thing has more volume and I wouldn't turn it up all the way. Part of the reason is it starts to distort some, not horrible but it's there.When being used at 75% volume which is plenty loud it maintains clarity and its loud everything below 75% is very nice. Highs lows and mids are present and accounted for.The bass... I can say it does have a nice meaty bottom end to it, but.... It's nice bass for two passive radiators, and two 3 inch drivers or whatever they are. Meaning it won't and can't compare to my home theater setup with a 15\" sub. I don't want to dismiss this though because as I say I'm normally always wanting more bottom end. And while it sounds like deep mids and they are a little muddy hey... They are there!The thing kind of has a cheap feel to it, but hey man the price reflects this. They have put their money where it counts which is in the hardware itself. While it feels cheap it's perfectly functional and has a usable feel. Meaning scratch the outside... Meh. I don't care. Drop it and would it shatter or crack... Maybe but I doubt it.I've been trying everything I can think of for the ultimate speaker that is still reasonably portable but still puts it out. I own a Minirig 2.1 setup and that is the gold standard, however it's fiddly to setup and cart around. I've auditioned a Marshall Tufton, and Stockwell, most of the Jbl lineup, Bose, and all of them have failed in some area or another. The Tufton was great but at 11 pounds it just isn't realistic to cart around. I'm just looking for something I can grab and take it to the pool and not worry about it, be able to jam all day, and it doesn't leave me wanting for sound... I know pretty much just perfection. This speaker may very well be the one. It's not perfect but for a grab and go and at the price it is 100% impossible to fault this thing. She is a real sweetheart.Go get you one or two and proceed to use and abuse it. I don't think you'll be sorry.","timestamp":"Reviewed in the United States March 1, 2021","profile_id":"AEV2GPVCOBMUSTZSAOOPR6PZ637A","is_verified":true,"helpful_count":10,"product_attributes":"Color: Black"},{"id":"RWOPJTC871K9B","title":"5.0 out of 5 stars Awesome speaker","author":"Cory B.","rating":5,"content":"Robust design and the fact it floats is perfect for kayaking. Use it all the time in the shower","timestamp":"Reviewed in the United States May 21, 2024","profile_id":"AEKKOFX3BDT3VKYVQZ4VHS4YIE7Q","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R3ACL22DP1BFKK","title":"5.0 out of 5 stars Good Little Speaker","author":"H","rating":5,"content":"I bought this to replace an Aiwa Exos-3. It's a good speaker. Not heavy, easy to fit into small places, and not bad for using at home. The Bluetooth connectivity is good. It hasn't disconnected while playing. I still haven't figured out the buttons, since the same ones are for skipping tracks and the volume, so I just use my phone. The battery lasts a lonnnnng time.","timestamp":"Reviewed in the United States April 24, 2024","profile_id":"AGYI2UHKF4NQ52KSPYVHQAMOKVWA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R19054Z2MI3VLK","title":"5.0 out of 5 stars Fantastic sound","author":"junior","rating":5,"content":"Compact boom box I'll be enjoying this speaker everywhere","timestamp":"Reviewed in the United States May 26, 2024","profile_id":"AFFH5NZ7JLYZ4SYNILMLINQL675Q","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R2W0IEZG6ALJD","title":"4.0 out of 5 stars Great gift","author":"L_Write","rating":4,"content":"Gifted this speaker for a older family member. The buttons were easy to see and use and the handle is very useful. The sound is standard but filled the room nicely!","timestamp":"Reviewed in the United States March 27, 2024","profile_id":"AGTXC6I6NPYFQWA434EPTOHHIYFQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R12XW1BWH5UJ7N","title":"5.0 out of 5 stars The Best Bluetooth Speaker on Amazon for under 100.00","author":"Joe K.","rating":5,"content":"I am an audio visual installer, I like to get the best quality at the lowest price!!I Bought (5) 4.5 star plus rated speakers to Compare Quality and Sound. …priced from 50-100 dollars.I was looking for a great sounding speaker for both indoors and outdoors that had great sound for less than a hundred bucks. I have owned many portable Bluetooth speakers over the years that I have spent upwards of $500 for There are so many options available on Amazon. I bought five different speakers ranging from $50-$100. This Anker speaker with integrated handle was tops ! If you download their app, you can customize the equalizer sound for the type of music you’re listening to. Which made the speaker sound so much better than out of the box. None of the other speakers had this option. Many of the other speakers Highlighted dancing lights, multi directional sound, and the ability to hook up multiple speakers for party mode. Although that sounds great, I need one good mobile speaker that I could take to the park, to the patio, and even to the beach. This speaker has great sound and amazing power for the size. The speaker was far superior to the others— I don’t want to slam other brand names but some of them were by name most of us have heard of. . This speaker is IPX7 waterproof, not splash resistant…it has a charging port to charge your phone if you’re running low on juice, and it has great customizable sound. The other speakers sounded good. But the high end sounded flat on almost all of them, Especially if there was any bass sound present. . This speaker is truly a great value for the price point! Also, the Bluetooth range is great.It’s made very rugged. It’s a little bit bigger than the other speakers but very easy to slip into a bag. I’ve included a picture so you could see a good representation of the size of the speaker while I’m holding it And when you hear the quality you understand why I like it. Don’t forget to install the app to customize the sound to your taste and music. For those of you who don’t know the Anker brand…Rest assured, they make quality products ! I truly hope this helps some people Who don’t like to waste money and wants great value—","timestamp":"Reviewed in the United States July 29, 2021","profile_id":"AEJKGFSYUA7S5VS6UNS6EFQSOI4Q","is_verified":true,"helpful_count":9,"product_attributes":"Color: Black"},{"id":"R3Q94DY1CIC83H","title":"4.0 out of 5 stars Superb audio quality, long battery life","author":"Amazon Customer","rating":4,"content":"I enjoyed the long battery life and amazing audio this speaker produces. From the treble, bass, and overall tones, this speaker really puts out a sound that fills the room and is just as great outdoors. The only downside is the long duration of recharging fully, but was able to last with medium to high volume usage.","timestamp":"Reviewed in the United States February 23, 2024","profile_id":"AEWNWKJYN4GJKBRJYKW2MOVQ2MVQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2J795ROUTLI19","title":"5.0 out of 5 stars BEST SPEAKER FOR LESS THAN 100","author":"Christian park","rating":5,"content":"Very balanced sound. While it can be very loud it still sounds so leveled. Compared to my JBL boom box it holds up very well. I want to get another one for my lady. I’m very happy with this speaker","timestamp":"Reviewed in the United States April 30, 2024","profile_id":"AHLACVO375BYIGKWDLPKZD2OTGWQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2BP9SWV5WC76S","title":"5.0 out of 5 stars Loud","author":"B","rating":5,"content":"Perfect!","timestamp":"Reviewed in the United States May 29, 2024","profile_id":"AF4RURUQ66JFZNMSKFXA6ELW5IXA","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B08LQNL42Z","product_name":"Soundcore Anker Motion Boom Waterproof Bluetooth Speaker with Titanium Drivers, BassUp Technology, IPX7, 24H Playtime, App, Built-in Handle, Outdoor Speaker for Camping, Pool, Beach, Backyard","parse_status_code":12000},"created_at":"2024-08-05 07:54:34","updated_at":"2024-08-05 07:54:43","page":9,"url":"https://www.amazon.com/product-reviews/B08LQNL42Z?reviewerType=all_reviews&pageNumber=9","job_id":"7226133471809269761","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B08LQNL42Z?reviewerType=all_reviews&pageNumber=10","asin":"B08LQNL42Z","page":10,"pages":1,"reviews":[{"id":"R29HXOVZ9UQV81","title":"4.0 out of 5 stars enough BOOM for the buck","author":"jim","rating":4,"content":"To me Anker is synonymous with quality, reliability and value...kinda like a honda. I never feel ripped off buying Anker products.You're looking at this item for the bass and if you've used any of Anker's Soundcore products, you know that they use the passive radiator to great effect and create bass out of 'thin air'! The Motion Boom delivers and even in an outdoor setting, it creates enough bass that even at a pool party for 28 fourteen year olds, there was enough audio entertainment and 'boom' up to 5 yards away. You're not going to 'feel' it from there but it's loud. Subjectively, I'd say you can feel the bass up to 3 yards if your standing in the right places. Indoors is same but you can feel it everywhere.Batterylife is 'so-so'; at ~80% max volume for 4 hours battery went from 100% -> 50%. I was expecting a lot more.Bluetooth connectivity was great, I was wandering around 20-30 yards away and signal/sound never dropped.Sound quality is ok...this one is about going loud and boomy while still delivering solid mids and highs, and to do that you're going to have to use the custom settings in the app. fyi: that bass button isn't as effective as a custom profile. I don't have a Motion+, nor have I ever heard one but I'll take it on review that the audio quality is better over the Motion Boom and I took it on review that the Boom was better for outdoors...and I'm happy with my choice.Build quality; as you expect with all things Anker is very good. Everything feels solid.Warranty: if you've ever had to deal with Anker customer service you know it's awesome!Results: 4 stars. I kinda reserve 5 stars if you can compare to competitor products at 2x-3x the price (in this case JBL Boombox2 or PartyBox100), so my apologies to those of you who think this deserves 5. Also battery life was sus.","timestamp":"Reviewed in the United States June 20, 2022","profile_id":"AHFUIGKW6HPX3VBQNVP2Q4M7U5OA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R32N17RB8V9EBQ","title":"4.0 out of 5 stars Anger afraid to use their name","author":"Placeholder","rating":4,"content":"It's OK but no imput for other media .","timestamp":"Reviewed in the United States April 8, 2024","profile_id":"AHYLFV4BJ36MDGINWYRU53TGCJQQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"RI0B7ESHCK3L","title":"5.0 out of 5 stars Just do it! You won’t regret it","author":"Shane Clancy","rating":5,"content":"This is the Goldilocks of speakers. If you love BASS, quality sound, volume, and battery life you found it. I prefer this to my Tribit Stormbox Blast below 80% volume which is 90% of the time. I’ve had 15+ Bluetooth speakers and unless it’s a BIG and loud space or it needs to be a small speaker, this is the speaker I grab!","timestamp":"Reviewed in the United States April 5, 2024","profile_id":"AEQWJVVBSGKDRTRDUJA5O4BCDUMA","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"R2ORJQ1Z05ABXV","title":"5.0 out of 5 stars Superb sound in a small package, and when you get two... holy cow!","author":"Daniel T Bowman","rating":5,"content":"I purchased my first of these in mid 2021. It has performed admirably, and the battery still lasts many hours. I generally am listening to podcasts or quiet music while working- in that scenario, I can go many workdays before charging it. We have also used it for parties, playing music pretty loudly, and it easily lasts five hours or more. When me or my kids feel like blasting some music, it still works great and the sound is fantastic.In August 2023, we had a large party at our clubhouse, and I thought the one unit alone might not quite cut it. So, I bought a second and paired them... and was blown away, pretty much literally. Together, the volume, base, clarity and stereo sound is vastly improved from the already great single unit. We placed them on each side of a ~30X25 foot room filled with lots of people, and the sound was fantastic, especially after I altered the equalizer on the app. The pair lasted about 5 hours at very high volume playing bass-heavy songs, and still looked to have a good amount of battery left according to the app.I just can't speak highly enough of these units- the sound they produce out of such small, high quality package is incredible.","timestamp":"Reviewed in the United States August 31, 2023","profile_id":"AGVGSDZHQIWJLKWSX2SGGSJX5QTQ","is_verified":true,"helpful_count":11,"product_attributes":"Color: Black"},{"id":"R3ND1YRTVGJD68","title":"5.0 out of 5 stars Setup was a breeze, impressed…","author":"Kaitlin Allison","rating":5,"content":"Was able to get this unboxed, paired, soundcore account made and custom midscoop eq preference added in less than the time it takes to make a cup of coffee… buy it. Now.","timestamp":"Reviewed in the United States April 30, 2024","profile_id":"AHD2QHKSONVGTCKJS2WZXZKBKORA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3F2RK3ZNUZVKO","title":"5.0 out of 5 stars Awesome","author":"Bryan","rating":5,"content":"It's great, and pretty loud too. The sound is awesome, nice base. Easy to change. Id recommend it.","timestamp":"Reviewed in the United States April 30, 2024","profile_id":"AGI32NTGVPE6LLVZHIJVTAMUFOZQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1PLAYSCV96DGD","title":"4.0 out of 5 stars Lots of bass","author":"DeJay","rating":4,"content":"Most reviews say how loud the Motion Boom is but that means different things to different people. To me loud means I can barely hear the guy next to me. These have a good volume and in a closed room they seem louder but you can still talk over the music. You will need the Soundcore app to access the EQ as the base can drown out other parts of the music. I listen to harder rock music and it felt like the drums were drowned out. Even with the EQ I still can't get it just right. My wife listens to other types of music and she likes the sound.The battery life is good so far. You should fully charge it before using however it doesn't come with a charger. They recommend a charger that supplies 5 volts and 2 amps. I checked the ones I had and found I needed to purchase a new one. I really think they should include a charger.The app tries to make you think you need an account to use it but you don't. I don't like the fact that just because I need to use an equalizer, Soundcore needs my personal information. I would review the app separately but you'll need it and as far as I'm concerned, That makes it part of the product. An SD card slot would be nice and you could remove the microphone as I would never use this as a hands free device.It's louder than most speakers it's size (I haven't heard them all) and sounds better at a louder volume than most. I purchased it on sale and despite it's short comings, I still feel it was well worth the 80.00 I paid for it. I may purchase a second one at the regular price to use the stereo pairing feature.","timestamp":"Reviewed in the United States December 26, 2022","profile_id":"AETXSF5UAHE4XQSF3OTQVAIEET4A","is_verified":true,"helpful_count":7,"product_attributes":"Color: Black"},{"id":"R36MNR261AMW8J","title":"4.0 out of 5 stars Great little inexpensive speaker","author":"David Wilson","rating":4,"content":"I don't blast this speaker, so I'm happy with the sound quality. With the Soundcore app it's very customizable, which I appreciate. The midrange and upper ends sound great, and the bottom is definitely there but you have to listen close to hear it at lower volumes. I wanted an inexpensive speaker to use at the exercise classes I teach, and this fits the bill perfectly. I really like the Anker Soundcore products, and always put them at the top of my list when I'm looking for bluetooth audio.","timestamp":"Reviewed in the United States January 5, 2024","profile_id":"AG2GEIV33BCIU6UMUBD5HLX3ECIA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2FFD7AXXVMI3O","title":"4.0 out of 5 stars Sounds great","author":"John Skieczius","rating":4,"content":"It is exsacty what I wanted. However the usbc and usb ports in the back are not clearly indicated which one to use for charging.","timestamp":"Reviewed in the United States March 6, 2024","profile_id":"AGOWQ5FEBE6YQF6QWOJ62RIDQSSQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1H67B9HQOTGNN","title":"5.0 out of 5 stars Amazing product","author":"Marika Loden","rating":5,"content":"It's awesome!!! Sounds great and has loud perfect clear sound.","timestamp":"Reviewed in the United States May 7, 2024","profile_id":"AEPWR6XKQ2W2M7LWFDSZHGKXOWHA","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B08LQNL42Z","product_name":"Soundcore Anker Motion Boom Waterproof Bluetooth Speaker with Titanium Drivers, BassUp Technology, IPX7, 24H Playtime, App, Built-in Handle, Outdoor Speaker for Camping, Pool, Beach, Backyard","parse_status_code":12000},"created_at":"2024-08-05 07:54:34","updated_at":"2024-08-05 07:54:44","page":10,"url":"https://www.amazon.com/product-reviews/B08LQNL42Z?reviewerType=all_reviews&pageNumber=10","job_id":"7226133471809269761","is_render_forced":false,"status_code":200,"parser_type":""}],"job":{"callback_url":null,"client_id":18306,"context":[{"key":"force_headers","value":null},{"key":"force_cookies","value":false},{"key":"check_empty_geo","value":null},{"key":"safe_search","value":true}],"created_at":"2024-08-05 07:54:34","domain":"com","geo_location":null,"id":"7226133471809269761","limit":10,"locale":null,"pages":20,"parse":true,"parser_type":null,"parsing_instructions":null,"browser_instructions":null,"render":null,"url":null,"query":"B08LQNL42Z","source":"amazon_reviews","start_page":1,"status":"done","storage_type":null,"storage_url":null,"subdomain":"www","content_encoding":"utf-8","updated_at":"2024-08-05 07:54:44","user_agent_type":"desktop","session_info":null,"statuses":[],"client_notes":null,"_links":[{"rel":"self","href":"http://data.oxylabs.io/v1/queries/7226133471809269761","method":"GET"},{"rel":"results","href":"http://data.oxylabs.io/v1/queries/7226133471809269761/results","method":"GET"},{"rel":"results-html","href":"http://data.oxylabs.io/v1/queries/7226133471809269761/results?type=raw","method":"GET"},{"rel":"results-parsed","href":"http://data.oxylabs.io/v1/queries/7226133471809269761/results?type=parsed","method":"GET"}]}}