{"results":[{"content":{"url":"https://www.amazon.com/product-reviews/B00FK56KL8?reviewerType=all_reviews&pageNumber=1","asin":"B00FK56KL8","page":1,"pages":7,"reviews":[{"id":"R2OBX6DGK4TP2","title":"5.0 out of 5 stars Adds A New Dimension To Music.","author":"Soundguy","rating":5,"content":"This subwoofer certainly adds body to any speaker system. My Minirig 3 and mini 2 have never sounded so good. Very good low end now and they sound complete. If you crank up the sound outside, this will add back the bass that is missing at higher volumes.","timestamp":"Reviewed in the United States October 13, 2022","profile_id":"AFEHM3FRY7ZV4Y52VEMTJFJUIFGA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R1P4UZWJ5IAVYF","title":"5.0 out of 5 stars Sounds great!","author":"Mark S.","rating":5,"content":"Love the addition to my minirig 3 pair. Notice a big difference. As a side note, it matters where you plug the aux cable into, changes output from the sub. Loving messing around with my system. Several friends now are looking into getting their own system and then we're going to do a link up.","timestamp":"Reviewed in the United States July 27, 2019","profile_id":"AHAW3P3T5ISRD2O24SNNFGZWYDDA","is_verified":true,"helpful_count":5,"product_attributes":"Color: Black"},{"id":"R29BMELD3YUFMW","title":"4.0 out of 5 stars Almost high end sound","author":"Christopher T. Kolb","rating":4,"content":"I first ordered the Minirig 3 speaker and then the subwoofer. Although there were some troubles with delivery of the Minirig 3 (it took nearly 6 weeks to arrive!), I'm very happy with the combination, which I use to play music stored on my laptop, mostly accoustic music of various kinds (classical, Irish and Scottish folk, Indian music, and American pop). Reviews of other Bluetooth speakers rave about \"booming base\" or exclaim over how loud the speakers get. If those kind of endorsements appeal to you, maybe you should look elsewhere. For me, a speaker review that touts \"booming base\" is almost a non-starter. I'd rather have no base at all than base that is boomy. The combination of the Minirig 3 and the Minirig subwoofer play plenty loud, but most importantly they produce very high-end reproduction. Highly recommended. Look for the video review by Todd Parker for an excellent review.","timestamp":"Reviewed in the United States April 17, 2023","profile_id":"AEDK4GS5IWMUOHRHJBP4LA2N5SVA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3O0D6NL9J9A3I","title":"5.0 out of 5 stars A must for the full affect","author":"Z","rating":5,"content":"Adds so much bass to the mini rig 3. a must get!!!","timestamp":"Reviewed in the United States December 16, 2020","profile_id":"AEZCQ54R3Y7DY56XKYPFBPTXCULA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"RAMJPH1EE9S3X","title":"4.0 out of 5 stars Terrible, lacking instructions. Poor UX for interfacing with the sub with more than one Minirig.","author":"E","rating":4,"content":"As with the regular Minirigs, these things are confusing to use with inconsistent instructions/guidance online. Also wish it were wireless. like the Minirigs. The positive side is that these have nowhere near the amount of pairing issues as trying to pair two Minirigs to each other.It's a good portable, battery-powered sub. I'm actually looking forward to using it with other devices as well.","timestamp":"Reviewed in the United States July 4, 2023","profile_id":"AHJWQAPI5WHJ5ABXAHH22EJ35CZQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2G6KPE092X57M","title":"4.0 out of 5 stars A worthy upgrade to a solo minirig","author":"Amazon Customer","rating":4,"content":"I've owned a minirig 3 for a couple years before buying this. It turns an already great portable speaker into a near perfect, slightly less portable setup. Only complaint sound wise is the crossover sometimes feels pretty high. It also triples the size of the setup. Still a great investment, can now fill a medium/large room with great sound.","timestamp":"Reviewed in the United States August 10, 2022","profile_id":"AEO3AH3KCGU5MVZODH77HYNYKEUQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3TQ5USO2B5CNK","title":"4.0 out of 5 stars Only 3 hours of high volume battery life. Great detailed tight bass. Zero response below 50hz","author":"Charles Hodges","rating":4,"content":"Advertised battery life must be like 50% volume on low gain mode or even lower. Anker motion boom has deeper bass. This has detailed bass but lacks bass extension below 50z which ruins some songs","timestamp":"Reviewed in the United States April 7, 2022","profile_id":"AGHSCIPTIH3W5TQMHSVZO3Q6XJCA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3GJFF2JAMCZ6B","title":"Excelente complemento para tu minirig","author":"Mauricio","rating":5,"content":"Lo compre para conectarlo con mi bocina minirig y cambia el sonido por completo el sonido grave que emite es muy bueno, definitivamente vale la pena.","timestamp":"Reviewed in Mexico October 18, 2021","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R24VZIARGPXY09","title":"Great product in all important aspects. But...","author":"javiej","rating":5,"content":"Sound: Best in the portable arena. Great for travel and also for the car (most cars have decent mids and treble but they lack base). This unit will solve it without being tied \"only\" to the car.Still not the best option for home, there is a said in the audio arena \" a sub under 10 inch is not a sub\", and this device is no exception (this is not about volume at all, but it can't be explained with words, you have to experience a 10inch sub even at low levels to understand what I mean ). But still pretty decent for home use (if you can't have a real sub). This device will make the difference between just listening music or really enjoying the sound.Look & feel: Brilliant. It feels premium in all aspects, and the sleeve is absolutely awesome. I didn't expect such a great design so it was a nice surprise.Audio compatibility: Amazing!. I was in doubt because I thought this device was overpriced, but this particular point was the very reason that made me click the \"buy it now\". This brand having their own speakers and not forcing you to use their own with the sub ? and in fact they make it trivial? no app or workarounds neccesary? Resisting the new Apple law to prosecute audio jacks at the cost of adding bluetooth latency, compression and connectivity issues ? ... that's very unique in the portable premium arena and it is the main reason I gave 5 stars. Even if it is not perfect in some other aspects this point is really a 6 star. A portable sub with standard in & out 3.5mm standard audio jacks and no obligatory bs., this is probably the only one. That is really what made me think: Uhm, there is a true audio guy in this company, they are not just tech hipsters, so I'm in.But .. yes there is a but,... the power connector...... why?In a 5V device in 2021 and at this price level it is almost unacceptable to not include a proper usb power connector (ideally usb-c, or at least a miserable micro usb). Instead they give you a 5V barrel without power supply and a ridiculous workaround in the cable for a weird usb with \"PD\" passtrough but no data ... They have invented a solution for a problem that didn't exist!, while creating other problems on the way.Come on at this price level if you say your device can act like a power bank you have to do it properly with a couple of usb connectors as everybody does, and those connectors only cost 1 pound. First thing because using standards cables is good for the planet, and second because accepting standard usb connections rather than a short Frankenstein cable would give us a lot of flexibility for charging and for the placement of the device , which in a sub it is an important thing, specially while travelling which is when you need to improvise those aspects all the time. Not to mention the inconveniences if we lose or break this absurd cable, which for most users it is just a question of time.But no worries nobody is perfect, and fortunately the in&out 3.5mm jacks compensates this point. So that's is a 5 star.","timestamp":"Reviewed in the United Kingdom August 16, 2021","is_verified":true,"helpful_count":4,"product_attributes":"Color: Black"},{"id":"R3I7FPXPHEQEZO","title":"Buenísimos","author":"JUAN","rating":5,"content":"Conectado al Minirig 3 suenan espectacular. Es una, pasada.","timestamp":"Reviewed in Spain August 1, 2021","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B00FK56KL8","product_name":"MINIRIG Subwoofer Portable Rechargeable Bass Speaker - 80 Hour Battery - Black","parse_status_code":12000},"created_at":"2024-08-05 07:50:40","updated_at":"2024-08-05 07:50:43","page":1,"url":"https://www.amazon.com/product-reviews/B00FK56KL8?reviewerType=all_reviews&pageNumber=1","job_id":"7226132491201944577","is_render_forced":false,"status_code":200,"parser_type":""}],"job":{"callback_url":null,"client_id":18306,"context":[{"key":"force_headers","value":null},{"key":"force_cookies","value":false},{"key":"check_empty_geo","value":null},{"key":"safe_search","value":true}],"created_at":"2024-08-05 07:50:40","domain":"com","geo_location":null,"id":"7226132491201944577","limit":10,"locale":null,"pages":20,"parse":true,"parser_type":null,"parsing_instructions":null,"browser_instructions":null,"render":null,"url":null,"query":"B00FK56KL8","source":"amazon_reviews","start_page":1,"status":"faulted","storage_type":null,"storage_url":null,"subdomain":"www","content_encoding":"utf-8","updated_at":"2024-08-05 07:51:18","user_agent_type":"desktop","session_info":null,"statuses":[],"client_notes":null,"_links":[{"rel":"self","href":"http://data.oxylabs.io/v1/queries/7226132491201944577","method":"GET"},{"rel":"results","href":"http://data.oxylabs.io/v1/queries/7226132491201944577/results","method":"GET"},{"rel":"results-html","href":"http://data.oxylabs.io/v1/queries/7226132491201944577/results?type=raw","method":"GET"},{"rel":"results-parsed","href":"http://data.oxylabs.io/v1/queries/7226132491201944577/results?type=parsed","method":"GET"}]}}