{"results":[{"content":{"url":"https://www.amazon.com/product-reviews/B08Q45Q44C?reviewerType=all_reviews&pageNumber=1","asin":"B08Q45Q44C","page":1,"pages":343,"reviews":[{"id":"R1FUDJ9R6PAE56","title":"5.0 out of 5 stars Where have you been all my life?","author":"astrostar","rating":5,"content":"Outstanding! The TRELAB HD77 is a great little unit for our family. I enjoy music that I download on my iphone and can now share it with the whole family. The speaker is a perfect size, solid and well built. The quality of the music, tone and volume, it puts out is really unbelievable given the size and cost of the unit. After initially charging, the pairing process was a simple piece of cake; turn the unit on, go to settings and select bluetooth on the iphone, tap the TRELAB HD77 and you're done. I couldn't be happier, and while the price is this low, I will probably go ahead and add another unit since they will work together.","timestamp":"Reviewed in the United States July 8, 2024","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"R394CRPM9QXJI0","title":"5.0 out of 5 stars Blown away","author":"Martin f.","rating":5,"content":"I had a JBL speaker before and it was amazing but this speaker is just like a JBL speaker but a little bit better. Got it and I immediately got it on and paired which is super simple and easy. I put some heavy bass music on and omg the bass is amazing and the clarity from the speakers omg and yes it's 360 of sound and clarity and bass. Highly recommend and it's amazing for the price and the quality, size and everything is top notch. Highly recommend.","timestamp":"Reviewed in the United States June 26, 2024","is_verified":true,"helpful_count":11,"product_attributes":"Color: Black"},{"id":"R144CLIFTGPI8J","title":"5.0 out of 5 stars You need this speaker in your life if you like loud music","author":"Hmm","rating":5,"content":"What a great affordable speaker. I’d blown out two previous smaller portable speakers from a different manufacturer within 1 year! This baby is portable, cordless and comes with a power charging cord. Its made very well. It operates perfect while plugged into the charging port as well, without compromising the speaker or battery. Looks like it could take a lickin & keep on tickin.. I like the lights on either ends and the sound quality is amazing, the thumping bass has me back in 1989 LOL! I’m a very happy camper and impressed with this speaker. I sing karaoke and blue tooth through it. It’s perfect, LOVESSSSS ; )","timestamp":"Reviewed in the United States June 27, 2024","is_verified":true,"helpful_count":3,"product_attributes":"Color: Black"},{"id":"R1THBA0MHV6YX3","title":"4.0 out of 5 stars It makes noise I guess.","author":"kevron75","rating":4,"content":"I was expecting quite a bit more sound out of this guy for the price and size. It is very anemic sounding with very little low end bass. We have an old $20 RadioShack Bluetooth speaker that blows this away.Then there's the pairing. While you technically can pair multiple devices, you cannot switch between them if more than one device is present. For instance, my wife and I have both paired our phones. We paired hers first, then mine. If she is within range, it will always pair with hers. No problem, right? Wrong. If we want to switch to my phone, she has to turn her Bluetooth off on her phone. There's no way to override it and pair to mine instead. Even putting it back in pairing mode won't let us switch.The only reason this gets 2 stars is because the battery lasts forever. We use it almost nightly for about an hour, and have only had to charge it once in the 3 months we've owned it.Bottom line, if battery life is your highest priority, then this might be a good buy. If you want something that sounds good, and is easy to use, look elsewhere.Edit* bumping up to 4 stars. The company reached out to help remedy the issues. Fantastic customer support!","timestamp":"Reviewed in the United States June 29, 2024","is_verified":true,"helpful_count":5,"product_attributes":"Color: Black"},{"id":"RSTRL57GR6DO2","title":"5.0 out of 5 stars Great Bluetooth speaker!","author":"Christian C.","rating":5,"content":"The TREBLAB HD77 - Wireless Bluetooth Speaker is awesome! I really like this speaker and it works perfectly. It has great sound, looks great and easy to operate and holds a charge for a good long time and its 30watts! And plus the price was just right. Over all a wonderful purchase! Happy customer here!","timestamp":"Reviewed in the United States June 2, 2024","is_verified":true,"helpful_count":8,"product_attributes":"Color: Black"},{"id":"R20OAXKMFNBVDJ","title":"5.0 out of 5 stars Super sound, super gift.","author":"Richins Reviews","rating":5,"content":"The media could not be loaded. This Christmas, I gifted my husband a wireless Bluetooth speaker, and it has been nothing short of spectacular, earning a well-deserved 5-star review. Since he unwrapped it, the speaker has become a daily feature in our home, providing a constant backdrop of his favorite tunes.The speaker’s sound quality is outstanding. The built-in subwoofers deliver deep, rich bass that can be felt as much as heard, creating an immersive listening experience. Whether it’s for background music during dinner or the centerpiece at a small gathering, the speaker fills our space with clear, vibrant sound.One of the best features is its sheer loudness without any distortion. It’s impressive how it maintains clarity and quality even at high volumes, making it perfect for both indoor and outdoor use.Connecting devices to the speaker has been a breeze. The Bluetooth pairing process is straightforward and hassle-free, allowing my husband to easily link his phone or laptop within seconds. This ease of use adds to the overall enjoyment and functionality of the speaker.The design deserves a mention too; it’s sleek, modern, and fits beautifully into our living space. It’s portable as well, so we can move it around the house or take it outside.In summary, this wireless Bluetooth speaker with subwoofers has been a fantastic purchase. It offers excellent sound quality, ease of use, and versatility, making it an ideal gift for anyone who loves music. It’s certainly enhanced our daily life with its superb audio performance.","timestamp":"Reviewed in the United States December 30, 2023","is_verified":true,"helpful_count":24,"product_attributes":"Color: Black"},{"id":"R1AM5FK6VPUW1C","title":"5.0 out of 5 stars Doesn't come with its own charge cable","author":"Amber p.","rating":5,"content":"Doesn't come with its own charging cord n for the price it should have one included.. it's DC 5V AND ID MUCH RATHER USE A CORD PROPERLY MADE FOR MY PRODUCT WITH THE CORRECT VOLTAGE boxHas an aux adaptergreat sound quality gets loud not boom box loud thoughCute n portable but also sorta looks like a coffee cupId rate it a 4* or 3.5* out of 5* but I'm marking 5 star so its seen more often","timestamp":"Reviewed in the United States July 18, 2024","is_verified":true,"product_attributes":"Color: Black"},{"id":"R9P4ZYSF5Q3GI","title":"3.0 out of 5 stars Works well enough for pop music, not great for rock or anything heavy","author":"Bryce","rating":3,"content":"I originally rated this a 2 star item since it didn't sound so great out of the box. I put a fair amount of research into this speaker and it's really not as good as I was hoping, but it's not necessarily bad - it all depends on what music you plan to listen to. Rock music or anything with a bit of heaviness to it seems to end up sounding a bit flat and muddled when all instruments are kicking in. But it works very well for pop music and anything with a bit more breathing space. It has decent bass and volume, although the highs sound a bit tinny and in some cases appeared to distort when listening to rockier music.I also made the mistake of listening to the speaker at half volume. The speaker sounds best at higher volumes, when it's used for background music it sounds much flatter, it seems to need the volume to make the different frequencies stand out more clearly from one another.Overall if you can get it for a good price then it's not the worst option but there are better options out there, although they may cost you another $30 more than this one.","timestamp":"Reviewed in the United States July 27, 2024","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"RAM3MRE8O6F2A","title":"5.0 out of 5 stars Finally! Great Speakers EXCELLENT Price!","author":"Tecups","rating":5,"content":"OK so it's my first day with them.But sometimes you just know when a relationship is gonna work out right.I needed a pair of portable TWS speakers. I've bought and returned a couple when my go to speaker (I'm really accident prone) was unavailable to order. I ended up finding TREBLAB during Prime Days. They came today!!! 90% charged so I put them right to work. One in the front yard and one on the back yard. Perfection!Easy to set up, clear connection at a good bit of distance and I can hear my music or my documentaries from everywhere....EVERYWHERE! And now so can the neighbors and I don't care if they like my music or my history documentaries. I'm the happiest woman in the world right now and I got a great deal on a \"new to me brand\" I checked into it they've been around since 2015....How was I so far out of the loop not to know about TREBLAB!!!!Great product great sound great look!!!My new go to!Oh and I dropped the first speaker as soon as I got it out of the box. Had to put them to the test I guess!","timestamp":"Reviewed in the United States July 18, 2024","is_verified":true,"product_attributes":"Color: Black"},{"id":"RCZZML131HYDF","title":"4.0 out of 5 stars So far, Really Good","author":"TLL","rating":4,"content":"Just got it today and took outside to use while gardening. The volume was great! You could turn it up and hear all over the yard. There was No distortion with the high volume either. The sound was much clearer than my old bluetooth speaker, which just died. I had the old one for almost 10 years and used it outside mostly and it took a lot of abuse. I am hoping this one will hold up as well.","timestamp":"Reviewed in the United States July 23, 2024","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B08Q45Q44C","product_name":"TREBLAB HD77 - Wireless Bluetooth Speaker - 30W Stereo, 20H Battery, IPX6 Waterproof, TWS Mode, Portable Speaker with Shockproof/Dustproof Body","parse_status_code":12000},"created_at":"2024-08-05 07:37:35","updated_at":"2024-08-05 07:37:37","page":1,"url":"https://www.amazon.com/product-reviews/B08Q45Q44C?reviewerType=all_reviews&pageNumber=1","job_id":"7226129195577907201","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"parse_status_code":12003},"created_at":"2024-08-05 07:37:35","updated_at":"2024-08-05 07:37:37","page":2,"url":"https://www.amazon.com/product-reviews/B08Q45Q44C?reviewerType=all_reviews&pageNumber=2","job_id":"7226129195577907201","is_render_forced":false,"status_code":404,"parser_type":""}],"job":{"callback_url":null,"client_id":18306,"context":[{"key":"force_headers","value":null},{"key":"force_cookies","value":false},{"key":"check_empty_geo","value":null},{"key":"safe_search","value":true}],"created_at":"2024-08-05 07:37:35","domain":"com","geo_location":null,"id":"7226129195577907201","limit":10,"locale":null,"pages":20,"parse":true,"parser_type":null,"parsing_instructions":null,"browser_instructions":null,"render":null,"url":null,"query":"B08Q45Q44C","source":"amazon_reviews","start_page":1,"status":"faulted","storage_type":null,"storage_url":null,"subdomain":"www","content_encoding":"utf-8","updated_at":"2024-08-05 07:37:37","user_agent_type":"desktop","session_info":null,"statuses":[],"client_notes":null,"_links":[{"rel":"self","href":"http://data.oxylabs.io/v1/queries/7226129195577907201","method":"GET"},{"rel":"results","href":"http://data.oxylabs.io/v1/queries/7226129195577907201/results","method":"GET"},{"rel":"results-html","href":"http://data.oxylabs.io/v1/queries/7226129195577907201/results?type=raw","method":"GET"},{"rel":"results-parsed","href":"http://data.oxylabs.io/v1/queries/7226129195577907201/results?type=parsed","method":"GET"}]}}