{"results":[{"content":{"url":"https://www.amazon.com/product-reviews/B09GJMPRYW?reviewerType=all_reviews&pageNumber=1","asin":"B09GJMPRYW","page":1,"pages":299,"reviews":[{"id":"RAZ6J396ABA0X","title":"5.0 out of 5 stars Fantastic sound quality and portability","author":"Kassandra","rating":5,"content":"The JBL Flip 6 Bluetooth speaker is an absolute winner! This speaker delivers exceptional sound quality with deep bass and crystal-clear highs that make my music sound fantastic, whether I’m indoors or out. The 360-degree sound really fills the space and creates an immersive listening experience.One of the best features is its portability. The compact size makes it super easy to take anywhere, and it fits perfectly in my backpack or on a small shelf. Despite its small size, it packs a powerful punch and can get surprisingly loud without any distortion.The Bluetooth connectivity is seamless and has a good range, allowing me to play music from my phone without any interruptions. The battery life is impressive too, lasting for hours on a single charge, which is perfect for long outings or parties.Another big plus is its durability. The Flip 6 is waterproof and rugged, so I never worry about taking it to the beach or poolside. It’s built to withstand splashes and even the occasional drop.Overall, the JBL Flip 6 is a top-notch Bluetooth speaker that combines great sound, portability, and durability. I highly recommend it to anyone looking for a reliable and high-quality speaker!","timestamp":"Reviewed in the United States June 13, 2024","profile_id":"AEFKX5OGOXDNDSPYOJOET63AUZPQ","is_verified":true,"helpful_count":9,"product_attributes":"Color: BlackStyle: Flip 6"},{"id":"R260UY3O2FGTRG","title":"5.0 out of 5 stars Great speaker","author":"Kari Maddox","rating":5,"content":"These will always be my favorite speakers. This is the third I have bought of these. After years of one JB Flip, it finally gave out on me and I bought another. I have dropped one of these in a deep sink at work and after a couple days it was right back to playing as clear as before and was functioning just fine. This one was one I bought for my dad for Father’s Day. He loved the Camo color and of course when he tested it out it gave really strong and clear sound. The Bluetooth connected easily, and from my experience with these speakers, for me it was worth the money. I known it will last for years.","timestamp":"Reviewed in the United States July 27, 2024","profile_id":"AFVQGGIXGMFQGPFQFNZOYMFWEKOA","is_verified":true,"helpful_count":1,"product_attributes":"Color: CamoStyle: Flip 6"},{"id":"RVXOZ0RVT0SU5","title":"5.0 out of 5 stars IN LOVE","author":"Israt Ahmed","rating":5,"content":"in love. color and design absolutely gorgeous. sound quality and volume. bluetooth connectivity. durable. amazing value for money. super portable size. holdable shape. my favorite speaker so far","timestamp":"Reviewed in the United States July 31, 2024","profile_id":"AF75N5EJWHNT25UPQAS6FYOANPOA","is_verified":true,"product_attributes":"Color: PinkStyle: Flip 6"},{"id":"R2D3F5CB8TDT0C","title":"5.0 out of 5 stars Works great","author":"Shinobu","rating":5,"content":"I bought this for my bf and he loves it. The battery life is great for parties or a day at the beach. I can say the sound is clean, crisp, and loud.The only CON is that it doesn't have much range so keep that in mind if you are purchasing. We paired it with his phone the first time and he was walking around during the party so the music kept cutting in and out. Just have your devise ( like your laptop ) paired close. =)","timestamp":"Reviewed in the United States July 19, 2024","profile_id":"AHDRBXDBWX52QBYQ6I7YYB2MEHIQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: BlueStyle: Flip 6"},{"id":"R8Q857TW6UHAJ","title":"5.0 out of 5 stars Perfect for everywhere","author":"Amazon Customer","rating":5,"content":"I purchased this for my husband for a special gift and this was perfect and amazing it’s not bulky and you charge it up like your phone also don’t let size discourage you this JBL is perfect size and volume is fantastic. Comes in different colors and it can go anywhere , also blue tooth connectivity. This you won’t regret","timestamp":"Reviewed in the United States July 23, 2024","profile_id":"AHJSWOYIT27K7IXAZLEP6F6JNZRQ","is_verified":true,"product_attributes":"Color: TealStyle: Flip 6"},{"id":"R3IHAMQG6HU1YF","title":"4.0 out of 5 stars The performance you get in this small profile is world class","author":"Amazon Customer","rating":4,"content":"Pros:Sound quality in a smaller space is outstanding for its sizeFlawless pairing and BT distance is more than you would need in and outdoor spaceVery durable, water prof in shallow depthsPortable in nearly every scenario.Able to find used on Marketplace as low as $50180 degree sound dispersion with low attenuation outside the forward facing speakersCons:Battery life if playing above 65% volume is not greatWon't connect to and JBL with Connect + so only Flip 5 and up with Party Boost will pair.At lower volume the bass is perfectly balanced and falls short as volume is increased.Larger areas can be a bit challenging without 2 of these little sound monsters.Charging does take a bit of time from dead to full charge.It does not float so if you loose it in the lake or river its probably gone for good.","timestamp":"Reviewed in the United States July 30, 2024","profile_id":"AHDCNFXPBUB4KQXMN4OIYU52OJ3A","is_verified":true,"helpful_count":2,"product_attributes":"Color: CamoStyle: Flip 6"},{"id":"R2DR6FLQQ9661Q","title":"5.0 out of 5 stars Perfect!","author":"Sonya","rating":5,"content":"I love everything about this speaker. The tone, easy to use, great for outdoors OR indoors. Compact and charge lasts!","timestamp":"Reviewed in the United States July 31, 2024","profile_id":"AGPMPEVSCNAJGNKVSKRL27E4UC2Q","is_verified":true,"helpful_count":1,"product_attributes":"Color: BlueStyle: Flip 6"},{"id":"RY1NRL2ZT5UZE","title":"5.0 out of 5 stars Big poolside hit!","author":"Kimberly McGrath","rating":5,"content":"Love everything about this. The sound is amazing. One of the best features is someone else brought a JBL to my pool and turned it on and it picked up what mine was playing so we had it on two speakers it was fantastic.I love how lightweight and compact it is. It's also really attractive. One of the best things about the number six version is that it is waterproof. Perfect for poolside... just incase of an accident.","timestamp":"Reviewed in the United States July 28, 2024","profile_id":"AH7B43UPY4IMLDG6NO3UJSARUTHQ","is_verified":true,"product_attributes":"Color: GreyStyle: Flip 6"},{"id":"RILMKXRAW75NM","title":"5.0 out of 5 stars Sounds excellent outdoors","author":"Austin Yde","rating":5,"content":"This speaker has definitely exceeded my expectations in terms of audio quality. It does a have a few imperfections, but overall I think it deserves 5 stars. The mids and highs get drowned out a bit by the bass when indoors. However, I’ve found that when outside, the OP bass overcompensates for the fact that bass does not carry as well in open space and this speaker sounds spot on. It gets pretty loud, but I did expect it to have a bit more, but the speaker is much smaller than I expected. That might just be me. This feels very well constructed and is fairly heavy. Highly recommend for audiophiles looking for an outdoor speaker that you want to bring with you anywhere.","timestamp":"Reviewed in the United States July 21, 2024","profile_id":"AF3PVTN5RKAL3R2VZTNN6W5N3BIQ","is_verified":true,"product_attributes":"Color: GreyStyle: Flip 6"},{"id":"R1L69GMOAWA48D","title":"5.0 out of 5 stars No Competition","author":"Nicholas","rating":5,"content":"JBL Flip 6 Bluetooth speaker. I’ve been meaning to do a proper review of this speaker for a while now, but finding the time to do so has been difficult. As I mentioned before in a previous post, JBL’s Bluetooth speakers are excellent. As someone who prefers a HiFi setup (individual components like a receiver, CD player, turntable, bookshelf speakers, etc.), I have never been a fan of Bluetooth speakers. I prefer the definition, clarify, and instrument separation you find in a good pair of passive bookshelf speakers powered by a clean amplifier or receiver, and that preference has not changed. But being able to easily take your music with you wherever you go does have its benefits. I’ve been through quite a few Bluetooth speakers over the years, mainly Ultimate Ears speakers, and I couldn’t believe how poor the quality of sound was from those speakers. I pretty much gave up on Bluetooth speakers until I decided to try out the JBL Flip 6. For such a small speaker, I could not believe how powerful and clean the sound was. I’ve since tried out the JBL Charge 5, the JBL Xtreme 3, and even the JBL Boombox 3, and each one of those speakers produces great sound. The JBL Boombox 3 is monstrous, and no one really needs that kind of sound unless you’re entertaining guests in a small or medium-sized venue. At the end of the day, I will always prefer to unwind with a CD or vinyl record played through my stereo receiver and bookshelf speakers at home, and a Bluetooth speaker will never match the clarity and definition of a great pair of passive bookshelf or tower speakers fed by a high-quality amplifier or receiver, but JBL’s Bluetooth speakers are a good investment if you want to be able to take your music with you. Again, I recommend the Flip 6, but if you’re able to spend a little more money I recommend the Charge 5 or Xtreme 3.I photographed my Flip 6 perched on two books for scale and also for the promotion of literacy. You know I can’t help myself. By the way, both of those books in the photo are superb.","timestamp":"Reviewed in the United States April 27, 2024","profile_id":"AGZQIVFUCTPC4TGGHIGE3RURP6AA","is_verified":true,"helpful_count":11,"product_attributes":"Color: BlackStyle: Flip 6"}],"page_type":"Question","asin_in_url":"B09GJMPRYW","product_name":"JBL Flip 6 - Portable Bluetooth Speaker, powerful sound and deep bass, IPX7 waterproof, 12 hours of playtime, JBL PartyBoost for multiple speaker pairing for home, outdoor and travel (Grey)","parse_status_code":12000},"created_at":"2024-08-05 07:27:45","updated_at":"2024-08-05 07:27:47","page":1,"url":"https://www.amazon.com/product-reviews/B09GJMPRYW?reviewerType=all_reviews&pageNumber=1","job_id":"7226126722855368705","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B09GJMPRYW?reviewerType=all_reviews&pageNumber=2","asin":"B09GJMPRYW","page":2,"pages":299,"reviews":[{"id":"R26RZ8E1ZACJ3F","title":"5.0 out of 5 stars Soo happy I bought this 😊","author":"Sami","rating":5,"content":"This is a powerful little speaker, didn't realize how powerful until I turned up the volume And about scared myself lol. Sounds great super portable nice base just all around good good product. I even bought a case for it to match.Pairing was a breeze, Wi-Fi synced right up, right out of the box plug and play got to love that. Love that I got it on sale from prime Days, so glad I did. You just can't go wrong with JBL. I got the teal in the flip six and the case, super happy.","timestamp":"Reviewed in the United States July 25, 2024","profile_id":"AFCJC6S7MIKK5TFVSVMTKMCJZNAA","is_verified":true,"product_attributes":"Color: TealStyle: Flip 6"},{"id":"R25LSZOVWL6J2M","title":"5.0 out of 5 stars Great sound for low price","author":"Pwalli","rating":5,"content":"I purchased this speaker to replace my wireless polk audio speaker which stopped working with the app. This speaker is awesome and has a nice low end with a nice strong range in volume. When fully charged it will play for a very long time on a charge, it has never lost power on me even on loud volumes. It's very easy to use and connects very easily with blue tooth with no issues. For the money you can't beat it, I wouldn't hesitate to buy another JBL","timestamp":"Reviewed in the United States July 25, 2024","profile_id":"AF5XKC7TPESV66I3MV72727KJQ6A","is_verified":true,"product_attributes":"Color: GreyStyle: Flip 6"},{"id":"RXDJI13S0RP8O","title":"5.0 out of 5 stars Flip 6 - great bluetooth speaker!","author":"Robert Estes","rating":5,"content":"I already own a Flip 4 and knew these smallish speakers delivered amazing sound. The only issue I have is that the Flip 6 and Flip 4 cannot be connected together. The Flip 6 uses PartyBoost, while the Flip 4 uses Connect+. This is my fault for not doing the research before purchasing. I'll have one speaker for pool side and another for inside.","timestamp":"Reviewed in the United States July 30, 2024","profile_id":"AFJXZEREQBWMEDJPLRHN4AUXWBEA","is_verified":true,"product_attributes":"Color: WhiteStyle: Flip 6"},{"id":"RVQGQ3BMVNPPU","title":"5.0 out of 5 stars Small yet powerful little speakers that sound great!!!","author":"The pc builder","rating":5,"content":"So let start off by I’m old school when it comes to selecting speaker. I have a massive surround system that sound great! I stumbled across the little speaker by accident. So I was doing a cell phone upgrade and they asked if I wanted a Bluetooth speaker versus 2 wireless stands… I opted for the Bluetooth speaker as I had 2 wireless stands that work great. So I hooked this little flip 6 up and was amazed by the sound of this little thing. So I was doing a bit of research and finding that I could hook other speakers. So I opted to pick up another flip 6 and put them into stereo mode. I was floored by the sound out of these little speakers and the stereo field was amazing too!!! So then I was wanting to see how the charge 5 would stack up and then combine them. The one charge 5 has an edge on the bass but the mids and highs of the flip 6 held there ground and sounded a bit better to me. Now I starting thinking of 2.1 sound and this is where everything just shined very bright. Have the best of both worlds highs mids and lows in 3 small speakers!!! Some of the music that I demonstrate in this set up was Rush - The Weapon.. this has some really nice percussion section with some stereo left to right separation. I also played Led Zeppelin’s- Stairway To Heaven for the same reasons or the stereo left to right separation and over rounded sound. Great news it passes with flying colors and I give these 5 stars all day long. I’d like to pick up the extreme 3 and give it a go in this set up as it has the AUX jack that would make it useful enough to hook up external AM/FM with USB and SD card. In closing don’t overlook these speaker I really enjoy my little speaker and I’m sure you’ll love too!!!! Update with about a week of playing some music and experimenting. The flip 6 turn on its end with tweeters up will produce the best sound and great sound stage. It does better in the vertical position cause the woofer and tweeter vertically aligned give better sound stage hence the vertical axis. Now pair it with a second and you’ll have killer stereo mode. And the charge 5 to the center and you will love the sound as it acts like a sub reinforcement.","timestamp":"Reviewed in the United States February 19, 2024","profile_id":"AFPGGENH3QGVQQIBUDQY26SDVVKA","is_verified":true,"helpful_count":7,"product_attributes":"Color: BlackStyle: Flip 6"},{"id":"RICY2N2338FM6","title":"5.0 out of 5 stars Way better base than the JBL Flip 4","author":"Anthony Russell","rating":5,"content":"I've had no problems with it. I got it to upgrade from the 4 and I was surprised how much stronger the bass is on the 6. The sound it makes when it turns on and off is also a lot quieter as a bonus. There is one issue that I've had where the sound becomes distorted and crackly, but I found that having it connect to one Bluetooth device at a time fixes that.","timestamp":"Reviewed in the United States July 24, 2024","profile_id":"AFKVBM7KXNQ3CSMNRUPM5A4VF4DA","is_verified":true,"product_attributes":"Color: BlackStyle: Flip 6"},{"id":"R37GBKIIIVVJDM","title":"5.0 out of 5 stars The best sounding and loudest JBL Flip!","author":"Alex Y. Yoon","rating":5,"content":"This Flip 6 is the best one among all other Flip models. Perhaps with that new tweeter that they have added, it became the best sounding and loudest flip of all. Anyway, it is an awesome bluetooth speaker, not just in JBL line up, but among all other reputable name brands speakers.I am absolutely happy with the purchase and the quality of the speaker.","timestamp":"Reviewed in the United States July 25, 2024","profile_id":"AGGIR5S4YQMG4IKWU3A7K3BQ56ZA","is_verified":true,"product_attributes":"Color: BlackStyle: Flip 6"},{"id":"R2B9JIWN8IDLIS","title":"5.0 out of 5 stars Indestructible and great speaker for the value","author":"Timothy Sutton","rating":5,"content":"I bought mine for work and it lasts about 6-7 hours on a full charge and with the original charging cord, it charges faster. Last week it fell in the engine compartment and the fan hit it and still works like a champ! Only thing I would say negative is I wish it would stay charged all day but for this price, you can’t beat it!","timestamp":"Reviewed in the United States July 24, 2024","profile_id":"AETYJGZLMESSWFS23PADSS2EPF4A","is_verified":true,"helpful_count":2,"product_attributes":"Color: RedStyle: Flip 6"},{"id":"R21GC0ENXVOA4O","title":"5.0 out of 5 stars Just WOW","author":"hipperz","rating":5,"content":"BIG sound for a small bluetooth speaker!! proves that size don't matter!!I love this speaker it's waterproof and taking it to the beach is easy peasy! couldn't ask for a better speaker! AND got it on PRIME DAY, even a bigger plus!","timestamp":"Reviewed in the United States July 31, 2024","profile_id":"AELZLFSFEI7TKNYXFGFXYXXYUIBA","is_verified":true,"product_attributes":"Color: CamoStyle: Flip 6"},{"id":"R14MA1UDS9JNYZ","title":"5.0 out of 5 stars Buen Producto","author":"Daniel","rating":5,"content":"Vengo de usar un parlante genérico y se nota la calidad de este, tanto en los materiales como en el audio, los bajos suenan muy bien. siento que si deben mejorar la duración de la batería, pero por la calidad vale la pena.","timestamp":"Reviewed in the United States July 31, 2024","profile_id":"AEVYOC4QN52ZQXC5K4FC6ZZYGHJQ","is_verified":true,"product_attributes":"Color: GreyStyle: Flip 6"},{"id":"R1HUJ309VQAYBF","title":"5.0 out of 5 stars Great sound for compact bluetooth","author":"brian","rating":5,"content":"This has a very nice sound for a small, portable, Bluetooth speaker. We use this when we don't want to put on the full backyard speakers or on a bike ride. It's also perfect for the side of the hot tub - neighbors would agree! With the sound of the jets, we would have the outdoor speakers louder which could disturb the neighbors. We can set this right by the tub for great personalized sound. Has held up very well, have had for a few months.","timestamp":"Reviewed in the United States July 10, 2024","profile_id":"AGPXNUX2K7WALFH5XVO4E2BRG74Q","is_verified":true,"helpful_count":1,"product_attributes":"Color: BlackStyle: Flip 6"}],"page_type":"Question","asin_in_url":"B09GJMPRYW","product_name":"JBL Flip 6 - Portable Bluetooth Speaker, powerful sound and deep bass, IPX7 waterproof, 12 hours of playtime, JBL PartyBoost for multiple speaker pairing for home, outdoor and travel (Grey)","parse_status_code":12000},"created_at":"2024-08-05 07:27:45","updated_at":"2024-08-05 07:27:48","page":2,"url":"https://www.amazon.com/product-reviews/B09GJMPRYW?reviewerType=all_reviews&pageNumber=2","job_id":"7226126722855368705","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B09GJMPRYW?reviewerType=all_reviews&pageNumber=3","asin":"B09GJMPRYW","page":3,"pages":299,"reviews":[{"id":"R39ZYIVAETHPCE","title":"5.0 out of 5 stars Very clear","author":"Andrew","rating":5,"content":"I have to admit that most of my listening is done in the bathroom at low volume with my phone as the source. But the sound has no flaws that jump out at me, even on occasional times it’s louder.","timestamp":"Reviewed in the United States August 2, 2024","profile_id":"AHML4KROG556KPEHQ5GC26NFLAQA","is_verified":true,"product_attributes":"Color: BlackStyle: Flip 6"},{"id":"RP1D3UH9MH13F","title":"5.0 out of 5 stars Just what I wanted","author":"Michele R Marquardt","rating":5,"content":"I was going to buy another brand that was twice the price, and my son said to get this one. He said at work in the oil field, they have one of these that is great. So I tried it. It’s perfect. The sound is great, it gets loud if you need, and It keeps a charge for a very long time and it didn’t break the bank.","timestamp":"Reviewed in the United States July 18, 2024","profile_id":"AFD7OGYKW5G3O4O4FGGPOXKS4DYA","is_verified":true,"product_attributes":"Color: GreyStyle: Flip 6"},{"id":"R211355OKBBVZ8","title":"5.0 out of 5 stars Prime Day STEAL!","author":"lauralynn000","rating":5,"content":"Awesome speaker to get on prime day (about 30% off)! VERY competitive with a BOSE speaker I have that was over double the price. Bluetooth connectivity was easy, and there is an optional companion app that is also very easy to download and navigate, should you choose to. Would definitely purchase again or purchase additional units!","timestamp":"Reviewed in the United States July 22, 2024","profile_id":"AFGOFYS6HE77OI56GB2HWMT3Q6JQ","is_verified":true,"product_attributes":"Color: WhiteStyle: Flip 6"},{"id":"R387RR05GKN6QV","title":"5.0 out of 5 stars Great for backyard sound","author":"Melisa Green","rating":5,"content":"We bought (2) to sync for use in our backyard/patio/pool area and so far it has been great! So easy to sync to bluetooth and to each other, and for the price the sound is great!","timestamp":"Reviewed in the United States August 2, 2024","profile_id":"AGCKQ37YRLUBGCSQ5IIM7SHPXYRA","is_verified":true,"product_attributes":"Color: RedStyle: Flip 6"},{"id":"RLZXHX3S2CXL3","title":"5.0 out of 5 stars Big sound from small package","author":"Robert Karstein","rating":5,"content":"Love the sound quality and volume from this tiny wonder. The portability and 12 hr run time put this little Bluetooth speaker at the top of my recommended list. Got it on prime days sale for $90!","timestamp":"Reviewed in the United States July 31, 2024","profile_id":"AFFJZQO6K6OFAKPBNVHM2XDNDSMA","is_verified":true,"product_attributes":"Color: BlackStyle: Flip 6"},{"id":"R3EXUEST03BLSX","title":"5.0 out of 5 stars love it!","author":"Scott A. Wimmer","rating":5,"content":"I love this, and wish that I could have had one many years ago. I now have music in the shower! The sound is great, and the bass really comes through (clearly; no distortion). JBL has always served me well, from my first stereo system speakers up to now. You cannot beat them.","timestamp":"Reviewed in the United States July 24, 2024","profile_id":"AHQI6BUOWQZY5XCIJ235PLUTB4VQ","is_verified":true,"product_attributes":"Color: CamoStyle: Flip 6"},{"id":"R2BU8B5XRE8ASD","title":"5.0 out of 5 stars Bass and crisp sound","author":"Clayton Moraes","rating":5,"content":"I never write a review but this one needs to be at the top.I highly recommend this item if you lice music and all it's glory.If you like bass and loud this is your device.If you're in doubt for buying it, doubt no more just buy it.Have a great day 😀","timestamp":"Reviewed in the United States July 22, 2024","profile_id":"AF4UVF3AYNAFIQCUCOOTNNU2Q4EQ","is_verified":true,"product_attributes":"Color: TealStyle: Flip 6"},{"id":"RO01R9PZZ5K4A","title":"5.0 out of 5 stars Great upgrade","author":"Angelo Valdez","rating":5,"content":"The sound quality is great, super easy to set up, and it’s very portable. I tried it out as soon as I got it and the sound exceeded my expectations within the first 10 sec. For a relatively smallish speaker, it packs a punch. This was the perfect upgrade from my JBL flip 3.","timestamp":"Reviewed in the United States July 19, 2024","profile_id":"AHH366QOFM7KZUAGXIW6NEERYGGQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: BlackStyle: Flip 6"},{"id":"RWC4349CRRW5D","title":"5.0 out of 5 stars Quality speaker (JBL flip 6)","author":"Tom R","rating":5,"content":"I dont know where people get off writing bad reviews criticizing this thing. It is compact and is loud as hell for its size. I haven't owned it for long so the battery life remains to be seen but I would definitely recommend it. As a bonus I was able to get it under $100 for prime day.","timestamp":"Reviewed in the United States July 17, 2024","profile_id":"AG7P5D56WALZK4VERSQBVC4MJGMQ","is_verified":true,"product_attributes":"Color: BlackStyle: Flip 6"},{"id":"R3H5SJ1R5JJKGB","title":"5.0 out of 5 stars JBL Flip 6 stands tall","author":"luigi leon","rating":5,"content":"Ok so I was debating buying the Flip 6 or the Sony ULT, after unboxing and listening to a bunch of different songs and genres. I can not be happier with the JBL, The volume levels are insane this thing cranks the volume out. Second the bass in this thing is nuts sounds incredible and if you mess around wit the app you’ll be able to find the perfect balance for your tastes. Overall I don’t regret this purchase this speaker is amazing and is the perfect size and weight to carry around","timestamp":"Reviewed in the United States July 2, 2024","profile_id":"AEPNK4SPBUJWWOPXAWDXOUAS5IYQ","is_verified":true,"product_attributes":"Color: CamoStyle: Flip 6"}],"page_type":"Question","asin_in_url":"B09GJMPRYW","product_name":"JBL Flip 6 - Portable Bluetooth Speaker, powerful sound and deep bass, IPX7 waterproof, 12 hours of playtime, JBL PartyBoost for multiple speaker pairing for home, outdoor and travel (Grey)","parse_status_code":12000},"created_at":"2024-08-05 07:27:45","updated_at":"2024-08-05 07:27:49","page":3,"url":"https://www.amazon.com/product-reviews/B09GJMPRYW?reviewerType=all_reviews&pageNumber=3","job_id":"7226126722855368705","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B09GJMPRYW?reviewerType=all_reviews&pageNumber=4","asin":"B09GJMPRYW","page":4,"pages":299,"reviews":[{"id":"RIQG6BZOSLHWD","title":"5.0 out of 5 stars Love this Speaker","author":"Texas H.","rating":5,"content":"Ordered something off brand first, immediately returned it. JBL has a crisp but deep sound and it works just perfectly. Easy to take anywhere. We take to the pool and has been splashed with no worries at all. It’s loud enough too for us all to listen to at our community pool.","timestamp":"Reviewed in the United States July 16, 2024","profile_id":"AGX576PRIOBQ2TTID5ECVP57HSWA","is_verified":true,"product_attributes":"Color: BlackStyle: Flip 6"},{"id":"R3K6OSO8ET1RNO","title":"5.0 out of 5 stars Gran sonido y bajos por su tamaño","author":"Andres","rating":5,"content":"Tiene una gran fidelidad en el sonido y el sistema de bajos muy bueno. Logra un volumen más q adecuado para ambientes domésticos y para fiestas (adolescentes) se puede conectar varios, ideal comprar 2 o 3 para este uso o alguno más grande.","timestamp":"Reviewed in the United States July 20, 2024","profile_id":"AGZY6JDOMMMXFEI3OFS27KOW4JSQ","is_verified":true,"product_attributes":"Color: WhiteStyle: Flip 6"},{"id":"RYF8YO9JQD085","title":"5.0 out of 5 stars Wonderfully fun and elegant little speaker device.","author":"CJ","rating":5,"content":"Excellent sound. Good base. I listen to a lot of “oldie” vocals — from Frank Sinatra to Lou Rawls — and many more current singers. I do feel Frank is right in the room singing to me. 😂 The JBL6 sound is better than the earlier JBL’s. I congratulate the developers! Thank you.P.S. Of course, I would like longer battery life. Who wouldn’t ? Sometimes I don’t realize how long I have had the JBL on and forget to charge. Once you have reached the limit, everything just stops. Period.","timestamp":"Reviewed in the United States June 22, 2024","profile_id":"AFPIZ2D5SWJSR25T2A4OMPTIVUQA","is_verified":true,"product_attributes":"Color: BlueStyle: Flip 6"},{"id":"R1IXK1JJABHT2D","title":"5.0 out of 5 stars Amazing","author":"Katy","rating":5,"content":"Love this. The sound quality is so good, the charge lasts ages, and I love the red color. It's expensive but you get your money's worth.","timestamp":"Reviewed in the United States July 28, 2024","profile_id":"AH2NPXCVKFGJSONI6EZAAPA3K5FQ","is_verified":true,"product_attributes":"Color: RedStyle: Flip 6"},{"id":"R15WWZ3JQ76NYC","title":"4.0 out of 5 stars Get what you pay for I guess.","author":"Jimmy C.","rating":4,"content":"I returned this product to try the Sony Srs-xe200 instead. It was supposed be 200 watts but not even close, maybe that’s how much power it drains but sure doesn’t perform like it. I should’ve kept the j b l! The Sony maybe a little clearer on the mid and highs but lacks bass dramatically!","timestamp":"Reviewed in the United States July 22, 2024","profile_id":"AEDTYTBESUKXOSF7ZFZUSQVGZKOQ","is_verified":true,"product_attributes":"Color: BlackStyle: Flip 6"},{"id":"R2U13N9POB37ML","title":"5.0 out of 5 stars PERFECT!","author":"KierstineKinard","rating":5,"content":"I have 3 of these speakers in my office (one on each of my coworkers/my desk) and they link together and sound so nice! There is a very few moments where one loses sound for a few seconds but it comes right back on. Other than that I have no problems with these speakers and LOVE THEM","timestamp":"Reviewed in the United States July 9, 2024","profile_id":"AHZI3WPD7K7NI3BXFHMOYEACMW2Q","is_verified":true,"product_attributes":"Color: TealStyle: Flip 6"},{"id":"R10YMC6EWZHJ82","title":"5.0 out of 5 stars Sounds great","author":"Overall not good product!!!","rating":5,"content":"The out put of Bluetooth sound is amazing. Also last the the 12 hrs with charging it.","timestamp":"Reviewed in the United States July 30, 2024","profile_id":"AHNJHJGKIHAR3KSTUNVACEZQRKOA","is_verified":true,"product_attributes":"Color: PinkStyle: Flip 6"},{"id":"R2ZYYVPBMRCNHX","title":"5.0 out of 5 stars JBL speaker","author":"Helen R.","rating":5,"content":"I love this. It’s just the right size to take anywhere you wanna go in the sound is amazing.","timestamp":"Reviewed in the United States July 28, 2024","profile_id":"AEL3XCWVYUUVWCGM7W44JSPMTVIA","is_verified":true,"product_attributes":"Color: BlackStyle: Flip 6"},{"id":"R2PNWAIK8MWBGZ","title":"5.0 out of 5 stars Speaker with great sound.","author":"Sheri Towry","rating":5,"content":"Our son in law was using one of these speakers at his house. My husband loves his rock n roll, but had not been listening as much since being home and retired. So I got this for him for Father's Day. He loves it. He puts it on in the morning while having coffee and takes it outside when he is by the pool, or working in the yard. He is very happy with this speaker.","timestamp":"Reviewed in the United States June 29, 2024","profile_id":"AGDYQOAT5ZDSIERMFSBFFMC237JQ","is_verified":true,"product_attributes":"Color: CamoStyle: Flip 6"},{"id":"R24GU86S0UTDD3","title":"5.0 out of 5 stars Perfect Portable Speaker","author":"Kirsten A","rating":5,"content":"Love this product. Great sound quality and easy to take on the go with me!","timestamp":"Reviewed in the United States August 2, 2024","profile_id":"AE743S55YELNTXFG2MKUFYKM3YYA","is_verified":true,"product_attributes":"Color: PinkStyle: Flip 6"}],"page_type":"Question","asin_in_url":"B09GJMPRYW","product_name":"JBL Flip 6 - Portable Bluetooth Speaker, powerful sound and deep bass, IPX7 waterproof, 12 hours of playtime, JBL PartyBoost for multiple speaker pairing for home, outdoor and travel (Grey)","parse_status_code":12000},"created_at":"2024-08-05 07:27:45","updated_at":"2024-08-05 07:27:50","page":4,"url":"https://www.amazon.com/product-reviews/B09GJMPRYW?reviewerType=all_reviews&pageNumber=4","job_id":"7226126722855368705","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B09GJMPRYW?reviewerType=all_reviews&pageNumber=5","asin":"B09GJMPRYW","page":5,"pages":299,"reviews":[{"id":"R1KYSSDBP62N1X","title":"5.0 out of 5 stars Great sound.","author":"Jane Bidwell","rating":5,"content":"Love this speaker. It is small but pretty impressive. The bass is good and the mids are clear. Got it on Prime Day, so very reasonable too.","timestamp":"Reviewed in the United States July 24, 2024","profile_id":"AEYJL7G7EI4OHKVHYQVKE2K3CCUQ","is_verified":true,"product_attributes":"Color: PinkStyle: Flip 6"},{"id":"RY4KT4Z0KZENP","title":"5.0 out of 5 stars Amazing speaker!","author":"Haim Yaakovi","rating":5,"content":"High quality sound! Comfortable to use and most important the battery is great!","timestamp":"Reviewed in the United States July 29, 2024","profile_id":"AEDXXPYXMDSYTHDMP2P32ZSH3SVA","is_verified":true,"product_attributes":"Color: BlackStyle: Flip 6"},{"id":"RH71MF40V9K55","title":"5.0 out of 5 stars 4 Hour lifespan if it's cranked up","author":"Amazon Customer","rating":5,"content":"I love this product the sound is awesome the only downside is it doesn't have a very good lifespan if it's cranked up for very long But if you do least listen to it At a medium volume It will play for about 12 hours but if you're down at the beach and trying to make yourself heard you got about a 4-Hour life","timestamp":"Reviewed in the United States July 2, 2024","profile_id":"AEAJGENPBRYWAP6WJK5B7BXJQKHA","is_verified":true,"product_attributes":"Color: BlackStyle: Flip 6"},{"id":"R14Y88CDKO3KYX","title":"5.0 out of 5 stars sound of voices","author":"David Edens","rating":5,"content":"Quality of singing voices was a surprise. If the volume is low so the bass is not over driven the sound is amazing for something so small !","timestamp":"Reviewed in the United States July 19, 2024","profile_id":"AFGYNKTBYWA3VSF5GAYVZ3UAS3RA","is_verified":true,"product_attributes":"Color: GreyStyle: Flip 6"},{"id":"R3SDM5X268R9QX","title":"5.0 out of 5 stars Same as flip 5 just better.","author":"Elizabeth","rating":5,"content":"Good sound, minor sound distortion at max volume. Louder than flip 6.","timestamp":"Reviewed in the United States July 30, 2024","profile_id":"AEAEZOKTA2NGQSLOWU2ZPQKJFSSA","is_verified":true,"product_attributes":"Color: PinkStyle: Flip 6"},{"id":"R1F4B5T0YT3OU","title":"5.0 out of 5 stars Great sound","author":"Betty In Ohio","rating":5,"content":"Great sound. Easy to operate and charge. Nice compact size. Would recommend.","timestamp":"Reviewed in the United States August 2, 2024","profile_id":"AG4DFNGKSMPEIXGANVLF6EHFUIQQ","is_verified":true,"product_attributes":"Color: RedStyle: Flip 6"},{"id":"R3A4M0JFG4FNQ5","title":"5.0 out of 5 stars These speakers are great! But they are expensive!","author":"Amazon Customer","rating":5,"content":"I ordered two of them and they both work great, I used in for my grandkids pool party. They are expensive.","timestamp":"Reviewed in the United States July 23, 2024","profile_id":"AFCXPLBNN3RIPP6NLU3HRL6YIKMA","is_verified":true,"product_attributes":"Color: BlackStyle: Flip 6"},{"id":"R1UNBF6RKSMD6D","title":"5.0 out of 5 stars Love this little Speaker!","author":"LEIGH ANN PICARIELLO","rating":5,"content":"Great sound and long lasting battery. Portable and can take anywhere!","timestamp":"Reviewed in the United States July 26, 2024","profile_id":"AFMHRJKV4TCXM46J5CN7KPABR76Q","is_verified":true,"product_attributes":"Color: GreenStyle: Flip 6"},{"id":"RRNXDSRVFL7GQ","title":"5.0 out of 5 stars Bass boomin","author":"Tbaddie","rating":5,"content":"This is the perfect size and the perfect color it was easy to set up and easy to connect to bluetooth and the price was great","timestamp":"Reviewed in the United States July 17, 2024","profile_id":"AFNK73OBIHYGZ6VYGJILDKZLP7PA","is_verified":true,"product_attributes":"Color: PinkStyle: Flip 6"},{"id":"R3FMD4TUUMD3EO","title":"5.0 out of 5 stars Great Product","author":"seija curtin","rating":5,"content":"Easy to sync to the bluetooth! Easy to operate and charge. A lasting charge. Great engineering, quality, and sound. I am very pleased with this product.","timestamp":"Reviewed in the United States July 19, 2024","profile_id":"AGF7L46GQOI5PBC3XHFIYE7TBBFQ","is_verified":true,"product_attributes":"Color: BlackStyle: Flip 6"}],"page_type":"Question","asin_in_url":"B09GJMPRYW","product_name":"JBL Flip 6 - Portable Bluetooth Speaker, powerful sound and deep bass, IPX7 waterproof, 12 hours of playtime, JBL PartyBoost for multiple speaker pairing for home, outdoor and travel (Grey)","parse_status_code":12000},"created_at":"2024-08-05 07:27:45","updated_at":"2024-08-05 07:28:09","page":5,"url":"https://www.amazon.com/product-reviews/B09GJMPRYW?reviewerType=all_reviews&pageNumber=5","job_id":"7226126722855368705","is_render_forced":false,"status_code":200,"parser_type":""}],"job":{"callback_url":null,"client_id":18306,"context":[{"key":"force_headers","value":null},{"key":"force_cookies","value":false},{"key":"check_empty_geo","value":null},{"key":"safe_search","value":true}],"created_at":"2024-08-05 07:27:45","domain":"com","geo_location":null,"id":"7226126722855368705","limit":10,"locale":null,"pages":20,"parse":true,"parser_type":null,"parsing_instructions":null,"browser_instructions":null,"render":null,"url":null,"query":"B09GJMPRYW","source":"amazon_reviews","start_page":1,"status":"faulted","storage_type":null,"storage_url":null,"subdomain":"www","content_encoding":"utf-8","updated_at":"2024-08-05 07:28:40","user_agent_type":"desktop","session_info":null,"statuses":[],"client_notes":null,"_links":[{"rel":"self","href":"http://data.oxylabs.io/v1/queries/7226126722855368705","method":"GET"},{"rel":"results","href":"http://data.oxylabs.io/v1/queries/7226126722855368705/results","method":"GET"},{"rel":"results-html","href":"http://data.oxylabs.io/v1/queries/7226126722855368705/results?type=raw","method":"GET"},{"rel":"results-parsed","href":"http://data.oxylabs.io/v1/queries/7226126722855368705/results?type=parsed","method":"GET"}]}}