{"results":[{"content":{"url":"https://www.amazon.com/product-reviews/B0CY6TTR3C?reviewerType=all_reviews&pageNumber=1","asin":"B0CY6TTR3C","page":1,"pages":8,"reviews":[{"id":"RZSR6HETN19GU","title":"5.0 out of 5 stars Big sound in a portable package","author":"James Donlon","rating":5,"content":"Easy setup like other Sonos experience. Very pleased that the sound is so full for a small speaker. Bought two of these so I can integrate with my other Sonos speakers, spreading sound around the house and on occasion outside. This speaker is great for such flexibility! I also put these two Roam 2 speakers in a stereo pair in a single room and am super impressed by the sound. Worth thinking about two of these as an alternative to more pricey Sonos options for your room. You will get pretty good sound plus flexibility/portability (at the expense of volume and depth of bass sound). Battery life is great, and I like the way the speakers sleep or power down when unplugged and idle for awhile, but stay up and awake if plugged in. The updated Sonos app keeps track of these even when powered off and picks them right up when powered on. Sonos is a great system and these Roam 2 speakers are a great addition for a portable option.","timestamp":"Reviewed in the United States July 27, 2024","profile_id":"AEKPQRCBV3DNLRZCMJSGQMSGSLAA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R3H92JQGC81CG3","title":"5.0 out of 5 stars sound quality, light","author":"Kiribiru","rating":5,"content":"great sound, and I love the shape, elegantfirst I was just looking for bluetooth speaker I went to the store and compared a bunch (Bose, jbl,ult etc....) and I liked the Bose the most but then I noticed this came out I decided to give It a shot, I like the sound more, lightness and the shapespeaker is plenty loud for being near it I cared more for sound quality than loudness because I just want to have something near me at highquality, even sitting outside I have it at 60% and its plantyI didn't care for wifi was thinking is it even worth it extra dollars for that but noticed I pretty much at home only use it over wifi, sonos app on my pixel phone, or airplay on my MacBooksomething I didn't understand its Trueplay I was like whatever its one of those gimmick things that you don't notice difference or subtle - I had it off I was outside and speaker seemed a little flat to me so I turned up the bass in sonos app, next morning I took it to the shower and I couldn't hear vocals because how strong bass was then I was like I should turn down the bass for closed space and then I was like wait lets turn Trueplay on, and it was perfect now I keep it on turns down bass in the bathroom so the sound is clear, and turns bass up outside so the speaker does not seem flat amazing this feature alone is such a game changeranyways I am keeping it and after so much research I am really satisfied that I put a little extra money","timestamp":"Reviewed in the United States May 23, 2024","profile_id":"AHACMARBEBMCS6ZOLMBFB4FY6QJA","is_verified":true,"helpful_count":20,"product_attributes":"Color: White"},{"id":"R1OS5DF32WEJSP","title":"1.0 out of 5 stars Amazing Speaker, Horrible Experience","author":"Matthew Keefe","rating":1,"content":"What can I say. I love Sonos, had the original PlayBar since it was released. Numerous speakers around the house, Sonos Move for outdoors and decided to pick up a Roam for travel. The speaker sounds amazing, especially for its size... however I can't add it to the Sonos ecosystem. Its a lone item, but whats worse is my other speakers are also missing from the mobile app now. I'm not alone in this, but unfortunately Sonos doesn't seem to care about it. Sadly this one will be going back, its too expensive for solely being a Bluetooth speaker.","timestamp":"Reviewed in the United States July 16, 2024","profile_id":"AFNZEBTUZMRH3OPVX7NYYD5ZH6SA","is_verified":true,"helpful_count":5,"product_attributes":"Color: Black"},{"id":"RZ3JZ2VUDV1OA","title":"4.0 out of 5 stars Underwhelming performance","author":"M. Alvarez","rating":4,"content":"So, the positives right up front. Very small and portable. Simplistic but stylish. Easy to use and setup. Love the dedicated Bluetooth. Comes well packaged from Sonos. Very small and for its size, puts out good volume.Now the potential cons. I have a Sonos Arc and the Sonos Move (1st Gen). Got them both for a great sale price and the sound quality never ceases to impress me. Especially the Move, which even at very high volumes plays great music from rock, country and rap. I bought the roam to be more portable than my Move, which I use on the deck, poolside or at small gatherings. The Roam was more for hiking, beach trips and casual listening washing the car, etc. I have to say I am not impressed. It sounds decent at its highest volume although you can tell you’ve reached its limit. I never feel like any of my other Sonos products have hit a limit even at 100% volume. It also sounds almost flat and very mono sounding vs steep or simulated stereo. Worse, it’s okay with rock or country or anything that has very little bass, but don’t try and play any kind of rap or hip hip. The bass is almost non-existent and really makes it feel like you’re pushing the speakers beyond their capabilities.Granted, most small portable like this would have similar issues, but when I listen to my sons JBL Flip 5, which costs less than half the price, I feel like the bass is much richer and the sound is louder, but of relatively similar quality as the Sonos, which is very disappointing. Maybe I’m missing the mark on its intended use, but I don’t think so. For small sound and high portability, it’s okay, but feels overpriced when compared to a couple others for what it offers.Would have considered a slightly larger roam in its 2nd generation for larger speakers or drivers or a dedicated bass port. I’ll have to sample it for a while and along others. I’m on the fence keeping it vs returning it. I’ll update my decision later.UPDATE: okay, after using it down at the beach, I would have to say my opinion has changed some. While I still would like a bit more volume, it’s pretty good for small spaces and close to me or around the pool or campfire. Sound has grown on me for most music and I recognize what it is for its ultra portability. Battery life is good and it’s been easy to pair. Loud enough to enjoy, but not so loud as to annoy others around me at the beach. I bought it at full price for $179. If you wait for Prime Day or other major sales days, it drops to $143, which is a much more reasonable price where it’s worth it.","timestamp":"Reviewed in the United States July 8, 2024","profile_id":"AEFLVYVERRDW3B3YBXQF7SKRBXHA","is_verified":true,"helpful_count":7,"product_attributes":"Color: White"},{"id":"R2TKUNVXBRW239","title":"5.0 out of 5 stars Awesome product!","author":"Amazon Customer","rating":5,"content":"This is a handy and quality speaker that is portable. I added it to my home system and its great because you can take it outside or on a hike, beach etc. and then bring it back and set on the charger.Great sound quality and nice compact speaker. It is a lot smaller than the Sono One speaker sets I have but nice for small corner, kitchen etc. when on the base charger.","timestamp":"Reviewed in the United States July 10, 2024","profile_id":"AFPIXNRCNG23YJANVUBFHDRLXRCA","is_verified":true,"product_attributes":"Color: White"},{"id":"R2SQIZU6ZJGUX0","title":"5.0 out of 5 stars Probably What Version 1 Should Have Been","author":"KayakUtah","rating":5,"content":"The sound quality is excellent. Setting up and connecting to my wireless network was painless. I was up and running including firmware updates within 2 to 3 minutes. I would have no complaints if this were my first Sonos product or my first Roam, but unfortunately, it isn't. I purchased the first Roam. Connectivity issues and sudden failures plagued it. Hopefully, these updates will correct all of the previous issues.","timestamp":"Reviewed in the United States June 1, 2024","profile_id":"AFWX5FLJCEQMCFEHIPD3MYQH4HYQ","is_verified":true,"helpful_count":8,"product_attributes":"Color: Black"},{"id":"R8REDZOTA6QX7","title":"3.0 out of 5 stars Great sound, but not without flaws","author":"Jason Rives","rating":3,"content":"I use this speaker for the shower, golf trips, and as a laptop speaker. Sounds great and nothing it's size I have heard is this crisp. Size is the key feature here so if you have more room for a larger portable speaker, then there are other options. Using it as a laptop speaker... well bluetooth takes at least 2 full minutes to click on each morning I start my day, so when I join my first meeting, people are talking and I can't hear anything. Biggest flaw, no matter what I do, Amazon Alexa will not connect to this speaker. I have sonos arc, sub, 300s, and a move 2 that are excellent and connected, but this little guy just hangs in the app with Connecting to Amazon. If you are using this as a smart speaker, look at different options.","timestamp":"Reviewed in the United States July 20, 2024","profile_id":"AFARNG7N5ZREPZQ5S43MH2J5ZURA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R1MTCMUNJXDWNA","title":"5.0 out of 5 stars Love this little speaker","author":"Bevab","rating":5,"content":"Got this speaker because it’s waterproof and I can use it around the hot tub. I love it. It’s loud enough to hear over the jets, which is important because we listen to audiobooks. I also love that Alexa is built in. I can tell it to adjust volume, play music, or ask questions.","timestamp":"Reviewed in the United States July 25, 2024","profile_id":"AFCYZDBSA72ES47NZPZNLPNI5XYA","is_verified":true,"product_attributes":"Color: White"},{"id":"R25ZDAM608ESGO","title":"4.0 out of 5 stars Great sound","author":"OC4me","rating":4,"content":"Hard to install once you figure out you need to uninstall what you have and start over.The sound is super good for such a small speaker.","timestamp":"Reviewed in the United States July 22, 2024","profile_id":"AGLEOWARRXLR4SBDVTMNNNCA5ICQ","is_verified":true,"product_attributes":"Color: White"},{"id":"RDQAT1UBC6SK7","title":"4.0 out of 5 stars Almost great","author":"Chris","rating":4,"content":"I love this speaker for its size and sound. It would be a five star product if it was a speakerphone.","timestamp":"Reviewed in the United States July 23, 2024","profile_id":"AECEBLFK55KO4CPI53J27JFYJHCA","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B0CY6TTR3C","product_name":"Sonos Roam 2 - White - Portable Waterproof Bluetooth Speaker","parse_status_code":12000},"created_at":"2024-08-05 07:31:33","updated_at":"2024-08-05 07:31:36","page":1,"url":"https://www.amazon.com/product-reviews/B0CY6TTR3C?reviewerType=all_reviews&pageNumber=1","job_id":"7226127679920025601","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0CY6TTR3C?reviewerType=all_reviews&pageNumber=2","asin":"B0CY6TTR3C","page":2,"pages":8,"reviews":[{"id":"R28AG0KBQ8RCP2","title":"4.0 out of 5 stars Require app is glitchy","author":"P. Rivers","rating":4,"content":"Speaker sounds great, but full functionality requires wifi connection. This version has improved bluetooth connectivity, but can do a stereo pair unless connected via wifi through their glitchy app. Well made and durable.","timestamp":"Reviewed in the United States June 15, 2024","profile_id":"AG2RTZ7V45JKDSXAKBYOL2A6DUIA","is_verified":true,"helpful_count":5,"product_attributes":"Color: Black"},{"id":"R3IYTW673C8QRR","title":"5.0 out of 5 stars Calidad","author":"Facely","rating":5,"content":"Bien hecho y con buena calidad de sonido mi única queja es que no sube mucho","timestamp":"Reviewed in the United States August 3, 2024","profile_id":"AF2OROUQQQORPJL7GHB7JOT2JA5A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R26T4SW7G7UDTH","title":"5.0 out of 5 stars Great little speaker","author":"Sanchez","rating":5,"content":"Happy with this Sonos speaker. Sound is great and it was easy to connect Bluetooth to my phone and to add it to my existing Sonos system. The Sonos app on the other hand still leaves a lot to be desired since their recent update debacle. But, all works well with this speaker and glad I made the investment - replaced a Amazon Tap and much happier with this product.","timestamp":"Reviewed in the United States July 3, 2024","profile_id":"AH2VCRQTQWQ3XVERAB6SANZAZ55A","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R2MHQ3QUU28795","title":"5.0 out of 5 stars Sound is fabulous!","author":"Amazon Customer","rating":5,"content":"I use it to listen to my Pandora channels on my phone. The sound from the Sonos is so so so much better.","timestamp":"Reviewed in the United States July 27, 2024","profile_id":"AFCUBDWJIFKVUYMOBPNTQYJXOG6Q","is_verified":true,"product_attributes":"Color: White"},{"id":"R2VZWBIVDS35LC","title":"4.0 out of 5 stars Muy buena calidad ! Buena Marca !","author":"Robin1961","rating":4,"content":"Tengo que bajar la aplicación . Es muy bueno !","timestamp":"Reviewed in the United States June 24, 2024","profile_id":"AGZAHUUFF57JDS4TXYVDXAPIOFCA","is_verified":true,"product_attributes":"Color: White"},{"id":"R1WH8FQN16XBQW","title":"5.0 out of 5 stars Upgraded from original roam","author":"sprint45","rating":5,"content":"Works perfect, took advantage of the prime sale to upgrade from the original roam.","timestamp":"Reviewed in the United States August 2, 2024","profile_id":"AH74V2NKRI67AT6TFDBS3EU6XSTA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3670JPAPVCWPR","title":"5.0 out of 5 stars Incredible Bass!","author":"Ross Hartung","rating":5,"content":"Love how compact it is with a full frequency spectrum, great for watching TV shows when my wife is sleeping as I can have the speaker right next to me, no more getting told to turn the TV down at night, reasonably priced. I can control all my Sonos speakers from my phone, very easy to use!","timestamp":"Reviewed in the United States July 1, 2024","profile_id":"AG6RTXZYSIWSEZWFGUQBOAAI6B2Q","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R1MC610M3FY27O","title":"5.0 out of 5 stars Great deal.","author":"Mark W.","rating":5,"content":"The quality of sound this thing puts out is great. Good bass.","timestamp":"Reviewed in the United States July 27, 2024","profile_id":"AGD7EGZ7IURUOQZ4AWTQFHNERTXQ","is_verified":true,"product_attributes":"Color: White"},{"id":"R1GJG5OXK356V9","title":"5.0 out of 5 stars Perfect for golf cart and back patio","author":"Mark Tichenor","rating":5,"content":"Bought this for a small portable speaker for golf cart and back patio. Paired seamlessly with other Sonos speakers in the house. Fits perfectly with magnetic mount holder on my golf cart to add some music to golf practice on the course.","timestamp":"Reviewed in the United States July 8, 2024","profile_id":"AH2TKFQCTBNCD26VK3VLV2WOX2QQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R31C3HNWK8Y9XZ","title":"5.0 out of 5 stars Very easy to connect to I-phone","author":"Amazon Customer","rating":5,"content":"Excellent product, plenty of volume for outside use.","timestamp":"Reviewed in the United States July 27, 2024","profile_id":"AGCWGHHYAXY6A7L7WVJFCPKDQYCA","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B0CY6TTR3C","product_name":"Sonos Roam 2 - White - Portable Waterproof Bluetooth Speaker","parse_status_code":12000},"created_at":"2024-08-05 07:31:33","updated_at":"2024-08-05 07:31:37","page":2,"url":"https://www.amazon.com/product-reviews/B0CY6TTR3C?reviewerType=all_reviews&pageNumber=2","job_id":"7226127679920025601","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0CY6TTR3C?reviewerType=all_reviews&pageNumber=3","asin":"B0CY6TTR3C","page":3,"pages":8,"reviews":[{"id":"R2ASHOZAFZSQ4S","title":"5.0 out of 5 stars Sound & clarity","author":"Vanessa","rating":5,"content":"Love this speaker! Excellent sound & clarity! You won’t regret it👌👌","timestamp":"Reviewed in the United States July 25, 2024","profile_id":"AGBGJFV3XQYO7WXQWVN3TS2ZNWDA","is_verified":true,"product_attributes":"Color: White"},{"id":"R1SWE2T6R0Y3W2","title":"3.0 out of 5 stars Great sound, awful setup process","author":"M. Bertrand","rating":3,"content":"The sound quality is great for its size, noticeably better than the old Amazon Tap it's replacing.However, the setup process was a nightmare using the Sonos app on Android. Initial pairing failed 3x in a row before finally succeeding on the 4th try. Setting up Amazon Alexa was even worse. The Sonos app kept hanging when trying to sign in w/Amazon. After I uninstalled the Amazon Shopping app, the Sonos app was finally able to sign in w/Amazon and complete the Alexa integration setup.5 stars for sound quality, 1 star for the setup process.","timestamp":"Reviewed in the United States June 23, 2024","profile_id":"AEWS6FRXILGAV2NJZF2YWJ5EXWMQ","is_verified":true,"helpful_count":6,"product_attributes":"Color: Black"},{"id":"R3T1413MSZ7USL","title":"5.0 out of 5 stars Packs a punch!","author":"kuriouskoala","rating":5,"content":"This speaker is incredible for traveling and listening to music while showering. The new layout of the buttons are much better and should been designed this way from the beginning. If you have a Sonos system already then this a great addition to pair it up and have music playing in another room","timestamp":"Reviewed in the United States June 19, 2024","profile_id":"AFRAK2QTNYYE3LVHCUY7UR3RS25A","is_verified":true,"helpful_count":2,"product_attributes":"Color: White"},{"id":"RXCK7CTAB3Z0B","title":"5.0 out of 5 stars Sounds great","author":"MusclyGeek","rating":5,"content":"The Roam 2 compares favorably to Apple HomePod and HomePod Mini. (Yes, I’m an Apple Fanboy. I worked at Apple for 13 years and love the quality and innovative design.) I guess the Roam 2 is brand new and I’m glad I gave it a shot (even with no ratings on Amazon). I wanted a waterproof AirPlay speaker to use in the shower or outdoors, and the Roam 2 delivers. Setup was slick and easy. Native SONOS app is impressive. I just got it today, so hopefully my experience will continue to impress.","timestamp":"Reviewed in the United States May 25, 2024","profile_id":"AGJUTNKNJOYWB425T7DHDIMPMU6A","is_verified":true,"helpful_count":4,"product_attributes":"Color: Black"},{"id":"R239JBOEB96UHX","title":"3.0 out of 5 stars Poor battery doesn't last more than 6 hours","author":"Matt","rating":3,"content":"Battery doesn't work for long","timestamp":"Reviewed in the United States August 2, 2024","profile_id":"AG4YINWJT73AA2SMVLUW4UEJ5C5Q","is_verified":true,"product_attributes":"Color: White"},{"id":"R26XMA3V252Y0N","title":"3.0 out of 5 stars Size in pics was misleading.","author":"Robert Kammler","rating":3,"content":"I’m not sure whose hand they used for the pic on the website, but it must’ve been a toddler.The sound is good, especially for the size, but Bose is better and bigger for the price. The only advantage is you can pair it with your existing Sonos system.","timestamp":"Reviewed in the United States June 17, 2024","profile_id":"AGOQEIE32II3PWEL37EYENDXCYLQ","is_verified":true,"helpful_count":4,"product_attributes":"Color: White"},{"id":"R29CQKUH9IX84Q","title":"5.0 out of 5 stars Better than the Sonos Roam 1","author":"Noah","rating":5,"content":"I can immediately tell the connectivity is way better than the Roam 1 and the addition of the extra Bluetooth button has restored my sanity figuring out how to use it (which is a low bar to cross for any portable speaker). Happy with the upgrade thus far!","timestamp":"Reviewed in the United States May 23, 2024","profile_id":"AGO45GVK437UE7TWQPFZVH7ZCDLQ","is_verified":true,"helpful_count":5,"product_attributes":"Color: Black"},{"id":"R256C71VGHJDG9","title":"2.0 out of 5 stars Great Sound, worst app/speaker setup ever","author":"J. Davenport","rating":2,"content":"Hands down the worst experience I've ever had setting up a speaker.Had multiple errors 'setting up' speaker with current Sonos systemA nearly $200 speaker should just work. I've had better functionality and usage out of a $20 bluetooth speaker.Just read the apology letter sent out from the CEO for their 'May 7th Update'... nearly 3 months later.Sounds great (when it doesn't drop out; frequently)This is my last Sonos purchase.","timestamp":"Reviewed in the United States July 25, 2024","profile_id":"AHE6C3FZW6WNTONXWVSFZNSZ7VFA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R1RCUCWF1S3XO7","title":"5.0 out of 5 stars Great sound…","author":"Steven Tessler","rating":5,"content":"Funky power button","timestamp":"Reviewed in the United States June 10, 2024","profile_id":"AFP337EBTTQQGVFVSFZAZVFHVB5Q","is_verified":true,"helpful_count":1,"product_attributes":"Color: White"},{"id":"R3BCKKZJC9DGT","title":"2.0 out of 5 stars Disappointed you cannot use as a speaker/mic for FaceTime or other calls.","author":"Mark Chriest","rating":2,"content":"The speaker sounds great. The setup interface is easy. The big flaw is that this cannot function as a speaker/mic for phone calls or FaceTime calls. Kind of a big miss and really not even something I thought to check before buying. Every other speaker has that ability","timestamp":"Reviewed in the United States June 24, 2024","profile_id":"AH2RW3DQUKDKSKQ6GCI4LMHD2BZQ","is_verified":true,"helpful_count":3,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B0CY6TTR3C","product_name":"Sonos Roam 2 - White - Portable Waterproof Bluetooth Speaker","parse_status_code":12000},"created_at":"2024-08-05 07:31:33","updated_at":"2024-08-05 07:31:38","page":3,"url":"https://www.amazon.com/product-reviews/B0CY6TTR3C?reviewerType=all_reviews&pageNumber=3","job_id":"7226127679920025601","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0CY6TTR3C?reviewerType=all_reviews&pageNumber=4","asin":"B0CY6TTR3C","page":4,"pages":8,"reviews":[{"id":"R1OXT1RPQAJG60","title":"1.0 out of 5 stars Should be called \"Don't Roam\"","author":"OceanicOpps","rating":1,"content":"What is the point of having a BlueTooth speaker which you cannot Roam with? These sounded OK when on my countertop at home, but lo and behold when I took them in our RV they would not work. You could connect to one of them, but not both. In fact I could connect to both at the same time but I could only flip between them for output.What a joke! Even speakers 1/10th the cost allow you to connect multiple speakers via bluetooth and the so called king of connection Sonos cannot even make a Roam ROAM!If you want these in your home, get something that is less expensive, if you want them to roam, get something else. Long story short, Sonos lost my business forever.","timestamp":"Reviewed in the United States August 2, 2024","profile_id":"AHOQSAB4KP2DMFHHOH6WLC6XBHLA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R27YV94AZ877B3","title":"1.0 out of 5 stars Sonos is a mess","author":"T Walsh","rating":1,"content":"This product showed up with no charger. So it’s essentially useless unless you order a separate charger.Also, Sonos recently decided to completely revamp their software and it’s a complete mess. There is also no way to use the equipment without the app. So now I have thousands of dollars worth of Sonos equipment around the house and it’s all been useless for weeks.Stay far away from Sonos! There are so many better options!","timestamp":"Reviewed in the United States July 27, 2024","profile_id":"AGZEE5KUXYIC5ALLXBZRJ7A7242A","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"R2DAM8AKATQG1D","title":"1.0 out of 5 stars Aweful app","author":"Placeholder","rating":1,"content":"Sonos destroyed my roam and all other speakers with a software update. I can’t even use my new roams. The company seems lost and unable to recover.","timestamp":"Reviewed in the United States July 26, 2024","profile_id":"AHTLYHQKPID6UMAF33CRXODQJVNQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: White"},{"id":"R1ANS7IKMB4U0S","title":"1.0 out of 5 stars Does not work with other Sonos speakers","author":"Dominic Sauer","rating":1,"content":"It will not connect to the rest of my Sonia system. The app shows a constant error message. Based on the reviews here, it seems this is a common issue. Terrible product, and ever since Sonos updated their app, Sonos in general has sucked. If you’re looking at buying Sonos speakers, just don’t do it","timestamp":"Reviewed in the United States June 13, 2024","profile_id":"AHPGMPGMLQ5H2GJDB2444JIGKSNA","is_verified":true,"helpful_count":17,"product_attributes":"Color: Black"},{"id":"RMJNP14ENJLS4","title":"1.0 out of 5 stars Wtf","author":"Tim Davis","rating":1,"content":"I don’t know what Sonos has done but since they “upgraded” their system it is terrible. I bought the Roam 2 because I thought it would be a good addition to my existing system but it doesn’t connect half the time and I get a message to try again later. I want to hear my music NOW!","timestamp":"Reviewed in the United States June 8, 2024","profile_id":"AHOBPPN6BTU2STCWDIWH2GBM4KGA","is_verified":true,"helpful_count":12,"product_attributes":"Color: Black"},{"id":"RVWAKG39KUY4S","title":"1.0 out of 5 stars Bluetooth","author":"hemal","rating":1,"content":"Thought connecting to bluetooth would be good in this version but it wasnt","timestamp":"Reviewed in the United States June 26, 2024","profile_id":"AH6ZOQ65RLUFPQ7WBMWBWBXL4TSA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2VJGR4ZI7H9B6","title":"4.0 out of 5 stars Great sound, poor policy","author":"E.Swope","rating":4,"content":"The sound quality on the Sonois Roam 2 is very very good. It has great tonality and an expansive sound stage, one which is tailored to your listening area. I have tried a lot of mobile blue tooth speakers, and this is one of the best in terms of audio quality, which is, absolutely, one of the most impot5rant factors, really the most important. I would compare it only to the Klipsch, B & O, Devialet.So why did I rate it 4 stars?1. I find it insulting or worse when a piece of equipment in this price range is so intrusive, puts so much effort into violating your privacy. Install the app and you will have none. I fully intend to uninstall rhe app. I may even do a full reset on my phone, but having installed it and created an accoujnt I asm already on a list they wil undoubtedly be selling.You can set up blue tooth without the app, but not wifi. Having connected to blue tooth I had to reset the speaker to install the app. It took me hou4rs, much like the B & O, which I was unhappy with for exactly the same reasons.*IF* you use th3 app you can not use a music player. I personally hate listening to music on my phone. In fact, I needed to make a call but couldn't because I was using the speaker, and it completely drained the battery on my phone. (Wifi and blue tooth will do that) make a call and could not because I was using the speaker. It also completely drained my phone's battery.2. Using a player would not have given me the benefits I get on many other blue tooth speakers because the Roam does not process lossless blue tooth codecs. You lose detail in transmission. Not everyone cares about this but most audiophile listeners do, so for a company of this quality, producing equipment in this price range, it is surprising and disappointing.No aptx, aptx hd or ldac.It does do some tricks if you have other Sonos speakers, like casting to the speaker in the next room.3. IPX rating questionable. The port is open, uncovered. I would not take this speaker to the beach, or even out ion the rain.With or without the app? The app does get you spatial tuning, BUT, besides issues already mentioned I lost the DAC on my FIIO, in addition to lossless blue tooth.In sum, the sound is very good but I feel that you pay a high price for it in terms of intrusiveness.I do not feel as though I would be sacrificing a great deal if I listened to my Klipsch instead, on my FIIO, weith location... turned off on my phone. We all have our priorities. Mine is most definitely sound quality, and this speaker do3es sound very good but I hzavwe to question some of their choices, to include not using lossless blue tooth codecs.","timestamp":"Reviewed in the United States June 18, 2024","profile_id":"AGASAFHLQKQP7RNG76TKN4GPBJBQ","is_verified":false,"product_attributes":"Color: White"},{"id":"RU984OCJ1IVM6","title":"3.0 out of 5 stars The hardware is great, but the SONOS app is horrible.","author":"diamond dave","rating":3,"content":"SONOS Roam is a great little Bluetooth speaker. The size is easy to carry around, and it has really good sound for such a small form factor. The Alexa integration is also very good - you can power up the speaker and ask Alexa to play anything through connected services like Spotify or other music libraries and it does what you expect it to do - play music! The real let down is in in the recent overhaul of the Sonos app. Unfortunately, Sonos took a very good functioning S2 app and ruined it when they relaunched the app to handle the new Sonos Ace headphones. They've been working on re-adding features for the last two months and it's starting to improve, but very slowly. So buyer beware - you may want to wait until they get the app back to a more solid state before you jump into a Roam. However, the Roam does work well with Bluetooth and Airplay, so for now that's a great way to still play music.","timestamp":"Reviewed in the United States July 30, 2024","profile_id":"AH2NLQV3HKYPSPZJAU2FGCUV37GA","is_verified":false,"product_attributes":"Color: Black"},{"id":"R34ZOX7VQX89KV","title":"4.0 out of 5 stars Great sound but took a while to set up.","author":"Customer Review of Product","rating":4,"content":"This sounds really good, especially given the size. I use it strictly as a standalone speaker. I do not have a Sonos system. This took a while to set up with bluetooth, get the app running, etc., but it's been great. Batteries don't need charge as much as expected. Overall, I'm pleased with this choice.","timestamp":"Reviewed in the United States July 30, 2024","profile_id":"AEZT4HG44IGDNV27CFNZGAZ5E2WA","is_verified":false,"product_attributes":"Color: Black"},{"id":"R1HEUYF9LJM6GR","title":"4.0 out of 5 stars Great sound and app capabilities","author":"Tuam Lis","rating":4,"content":"This Sonos speaker is compact yet has great clarity. The app helps makes for a featured rich speaker. The unit did have some difficulty setting up and reconnecting to the phonw but it always easily reconnected to my home wifi without issue. Overall, the unit is simple in design and easy to transport.","timestamp":"Reviewed in the United States July 27, 2024","profile_id":"AEETJZIQWEQTMBPOKILEMGECTGBA","is_verified":false,"product_attributes":"Color: White"}],"page_type":"Question","asin_in_url":"B0CY6TTR3C","product_name":"Sonos Roam 2 - White - Portable Waterproof Bluetooth Speaker","parse_status_code":12000},"created_at":"2024-08-05 07:31:33","updated_at":"2024-08-05 07:31:39","page":4,"url":"https://www.amazon.com/product-reviews/B0CY6TTR3C?reviewerType=all_reviews&pageNumber=4","job_id":"7226127679920025601","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0CY6TTR3C?reviewerType=all_reviews&pageNumber=5","asin":"B0CY6TTR3C","page":5,"pages":8,"reviews":[{"id":"R2YE8KKVZGETCW","title":"4.0 out of 5 stars Quality speaker","author":"SC","rating":4,"content":"OK I'll start with the elephant in the room... Either great reviews or poor reviews. The speaker is very good with rich bass and very clean sound production. The volume is good but it's a 7 inch device so it's not going to blow you out of the room. The first thing people say is that it is amazing for it's size. I agree and appreciate it for the amazing sound and portability. This is easy competition for Beats pill or the Bose versions in this size group and better in many ways. One of the ways is the tech. Also known as the bad reviews, at least for now. They need to update some areas with the software and the app. This needs to work perfect for what it cost (I hope you hear me Sonos!). If they fix the connectivity and wifi issues this is a winner. If you want a great piece of hardware with stand alone function it's a winner. For owners of other Sonos products having issues, they owe you an apology and a quick solution. I use it alone and have not added it to my system for this reason. I hope you can make a decision to buy or wait based on this info. I am happy but if I were trying to add this to my Sonos 1 I would not be.","timestamp":"Reviewed in the United States June 12, 2024","profile_id":"AGSZPUV3HVYEEYXWLNDAMC4ODM5Q","is_verified":false,"helpful_count":4,"product_attributes":"Color: Black"},{"id":"R1DBB66MWM8VVZ","title":"4.0 out of 5 stars Great sound quality!","author":"JK","rating":4,"content":"I used to love my Sonos Move.About 6 months ago it decided not to work with Alexa any more.I've reset it. Updated the App., shaken it like an Etcha Sketch, etc.Alexa responds, but nothing ever comes through.I got this \"Roam 2\" to replace the \"Move\".This unit is fantastic!-It is smaller!-USB-C charging!-Sound quality is great!It paired with my phone, and connected to the Sonos AppIt works with Sonos Apps and Voice controls!Alexa works partially.When I ask for music or radio, she tells me \"Sorry, music and radio playback are not supported on this device\".Very disappointing.I can see the device on Amazon, in my devices.Not what I was looking for.The Sonos voice controls get me most of what I want.I'll use them for now, until I can figure out how to make Alexa work for music.Overall, I still like this device.While I'm disappointed in the non working Amazon/Alexa interface, the sound quality is great!I'll continue to use it.","timestamp":"Reviewed in the United States June 11, 2024","profile_id":"AHW72CRG4MUGUQDHPR4ZUQQ25FFA","is_verified":false,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R34DJDV144SW9O","title":"4.0 out of 5 stars Only one issue that I have had with this","author":"K.","rating":4,"content":"To program the alexa voice, I have to uninstall Amazon and alexa apps from the device. Only to allow it to use web interface and then you can reinstall.Other then that sound quality is great and plenty loud to use around a group of approx 50 people groups.Plenty of battery life to use say around the beach.I have actually started to look at what others Sonos items that I can use around the house.","timestamp":"Reviewed in the United States July 6, 2024","profile_id":"AHSF2D23Q5TLMDKY466IVIPXIFRQ","is_verified":false,"product_attributes":"Color: Black"},{"id":"R3BTPB766QV96G","title":"3.0 out of 5 stars Middle of the road","author":"J.G.","rating":3,"content":"So I’ll start off by saying I wanted to compare this with the other competitor that I have heard, those B0$& guys. I was impressed with the low end of this speaker for its compact small size, but other than that, I can’t say that I would recommend on sound quality. The high end is completely missing and adjusting via the setting does virtually nothing. I want to qualify that with the fact I understand I’m not getting a live performance out of this thing but there really is no high end. I did t have any issues connecting to the product via Bluetooth as other have stated but if that is the case a software update should fix those. I had and issue at first hooking Apple Music into it but a reboot of my phone and the speaker fixed that. Its small size makes it versatile and it surely feels like a quality product. Battery life is good while overall performance is meh middle of the road. I have heard great things about Sonos products but I’m not sold yet.","timestamp":"Reviewed in the United States June 14, 2024","profile_id":"AFA34467RZQ7UBJVQG2TQ3JJDYFQ","is_verified":false,"product_attributes":"Color: Black"},{"id":"R2IMH43T72G8IG","title":"4.0 out of 5 stars Requires an app to setup and control but supports spotify connect","author":"ralfwolf","rating":4,"content":"A bit more complicated to setup than simple bluetooth speaker but that's because it supports wifi and spotify connect. What that means is you can play through the speaker without needing to keep a phone within bluetooth range. Keep in mind that it still ties up the spotify account but not the phone itself. Overall the sound quality is decent although a bit lacking in bass. Given the size of the speaker that's not a surprise but might not be good enough for some people.","timestamp":"Reviewed in the United States June 24, 2024","profile_id":"AFXYUG75FJNUK43VD22FS366H46A","is_verified":false,"product_attributes":"Color: Black"},{"id":"RREJBMWBR7Y7K","title":"4.0 out of 5 stars Good product. Very loud.","author":"Just Some Guy","rating":4,"content":"The media could not be loaded. This is a pretty nice portable speaker. I've used Sonos speakers in the past and was pretty impressed with those. This speaker in particular though, I have to honestly say is not quite as good as some other Sonos I have used in the past. Pairing over Bluetooth is simple, as with like any other Bluetooth speaker or other device. Pairing is the same. But like the other Sonos speakers this is also made specifically to work with the Sonos App in which you can connect multiple speakers throughout a home. That works well but I struggle to see why that'd be important on a portable speaker. I suppose it is nice to have the option. The sound is very good. It can get loud enough for a whole room. The trembles and mids are nice and clear. The bass is loud too (but I did notice some mudding at higher volume which is honestly to be expected with a portable speaker like this.) I took off the one star for this.Overall I think this is a very good speaker and people who want the Sonos app connectivity will love this. But I took off the one star because the sound is about the same as some other premium Bluetooth speakers that cost significantly less. That being said, this is still a good pick for people who want that app connectivity or just like the Sonos brand. I am satisfied with it.","timestamp":"Reviewed in the United States June 11, 2024","profile_id":"AFS2T4U7QKGVSZ6AFT3ZNA7DY2IA","is_verified":false,"product_attributes":"Color: Black"},{"id":"R1VMQ01EWO6TC4","title":"5.0 out of 5 stars Great sound in a small package, perfect to supplement your existing Sonos system","author":"bumblebee","rating":5,"content":"I wanted a portable speaker for when I'm out on the back patio and want to listen to music, and this ended up being perfect since it ties in with the speakers in my kitchen and living rooms. Setup was pretty straightforward, but I did need to reboot it a couple times to get it to properly play in sync with the other speakers. I think that may have just been a one-time thing, since it's worked perfectly every other time I've sent music to it.In terms of sound, it's pretty good. It doesn't have a super rich bass, compared to my other Sonos speakers, but it's still decent. I use the overture from Tron: Legacy as a test track, so I have a reference I can compare on each speaker I listen on, and it does miss some of the really rich deep notes when the music swells at around 1:35.All that said, this isn't a one-speaker-replacement for an amazing sound system. It's a portable speaker that sounds pretty great, which is suitable for taking outdoors and can sync with your existing Sonos system, and it excels at that. I mostly use it as a small portable speaker playing jazz on my back patio during family get-togethers or dinner, and to supplement my existing Sonos system, and it is perfect for that.","timestamp":"Reviewed in the United States July 13, 2024","profile_id":"AH2DY3SGYMCGUSFYXZLQO2S7XLBQ","is_verified":false,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"RFFIZESY3YJNW","title":"5.0 out of 5 stars Portability","author":"lang red","rating":5,"content":"𝘁𝗹;𝗱𝗿: Excellent sound, compact, waterproof, stable Bluetooth, long battery, elegant design, no Google Assistant.┈╍┄┈┄╍─╍┄┈┄╍─╍┄┈┄╍─╍┄┈┄╍─╍┄┈┄╍┈𝗜𝗺𝗽𝗿𝗲𝘀𝘀𝗶𝗼𝗻𝘀:🎵 The sound quality is excellent with clear highs and deep bass. It’s loud and powerful for its compact size, delivering consistent audio performance both indoors and outdoors.🌍 Portability is a strong point; it's lightweight, easy to carry, and the compact design is perfect for travel. The waterproof feature is a nice bonus or poolside use.📶 Bluetooth connectivity is generally stable and reliable, with an easy pairing process and quick setup.🔋 Battery life is impressive, lasting for extended use without frequent charges. The fast charging capability is also appreciated.🎨 The design is elegant and modern; it has a robust build quality with a premium feel.🤖 It doesn’t support Google Assistant (as far as I can tell), which might be a downside if you want to add it to a Google Home ecosystem.Overall, a pretty compact and robust sounding portable speaker.","timestamp":"Reviewed in the United States July 28, 2024","profile_id":"AEKT67NXHKRDKXCHE5DDECCIBBEQ","is_verified":false,"product_attributes":"Color: White"},{"id":"R19FQOL0LFI9SO","title":"5.0 out of 5 stars Big sound, little bar","author":"Staple","rating":5,"content":"Ordered this to use for a satellite speaker for some home automation. In this case, I used Home Assistant to connect to the Sonos Roam 2 and send audio. In my case, I have the speaker plugged into trickle charge as I mostly have power where it’s at, but the battery as a little battery back up so I can continue to control it even when there is no power at that location. Battery life is about as you would expect for something of that size. Nothing too stellar but nothing that’s gonna drop off ridiculously quick either.Sound quality wise, this lives up to the Sonos name. Sound was rich and full with no issues at any of the extremes. Adjustability and control are exactly as Sonos advertises and they work great. While there is a microphone included, I did not test that feature, though I would imagine, it should work.It also has Bluetooth and that seems to work well. It pairs nicely and you can send audio to it just fine. Range is about as expected with no problems that I experienced.About the only thing that should be noted is it really wants a high-speed USB-C charger. And my case I trickle charge it over an old-school USB charger and it warns me, but it sits plugged in most of the time so it’s OK. If you want to charge it faster though you’re going to need to use a proper USB-C charger.","timestamp":"Reviewed in the United States July 2, 2024","profile_id":"AHNR76YHIEJ2R73EOK6VHX22YYVA","is_verified":false,"product_attributes":"Color: Black"},{"id":"RU79QLFXORT1Q","title":"5.0 out of 5 stars The Roam 2 Sounds Incredible, Best Shower/Small Speaker Out There","author":"Super Duper","rating":5,"content":"The SONOS ROAM 2 deserves a chance. Sonos knows they did some things on SONOS Roam 1 that made people unhappy. The SONOS ROAM 2 fixes all of that.Bluetooth out the box: The 2 has a dedicated On Button and Bluetooth Button. You can Bluetooth straight out the box. The first one required you to do Wi-fi setup.Perfect Shower Speaker: It is IPX67 which allows it to be submerged in 3 ft of water for 30 minutes. And the trueplay makes it the best shower speaker. It’ll adjust the acoustic and the bass to sound amazing in the shower where usually there’s echoy walls. True play takes care of that. If you take it to the beach, it’ll put all the drivers on blast and make sure you can hear it in an open environment. Wifi and smart features allows it to be used in the shower without your iphone too!SONOS Integration: The integration is the best thing ever. I can listen to music anywhere around the house through wifi. And when I get back into the house I can go and hold the play button and it’ll transfer what I’m listening to on the bigger sound system (i.e. SONOS arc, more to be added soon.)SOUND QUALITY: It’s the best speaker at this size. I’ve had comparable speakers and I’ve only been impressed with Bose. This gives bose a run for it’s money, integration, and pure beauty. It’s bass is full and the high mids and lows are all there. Sound is full. A speaker this size call fill up a small room, and you can throw in your bag.Dislike: You can only pair two roams together if you are on Wifi","timestamp":"Reviewed in the United States June 13, 2024","profile_id":"AF3IHGT3ELBCS2XLX3V4PB3IQJRA","is_verified":false,"helpful_count":1,"product_attributes":"Color: White"}],"page_type":"Question","asin_in_url":"B0CY6TTR3C","product_name":"Sonos Roam 2 - White - Portable Waterproof Bluetooth Speaker","parse_status_code":12000},"created_at":"2024-08-05 07:31:33","updated_at":"2024-08-05 07:31:40","page":5,"url":"https://www.amazon.com/product-reviews/B0CY6TTR3C?reviewerType=all_reviews&pageNumber=5","job_id":"7226127679920025601","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0CY6TTR3C?reviewerType=all_reviews&pageNumber=6","asin":"B0CY6TTR3C","page":6,"pages":8,"reviews":[{"id":"R36CS9J6BN22IN","title":"5.0 out of 5 stars Great portable speaker","author":"Ryan","rating":5,"content":"The overall sound and performance of this speaker has met all of my expectations. The sound is clear and precise. I haven’t had any issues with connectivity. Nor have I truly use the “waterproof” claim to its fullest. I have yet to charge the device as it is very long lasting and doesn’t need to charge often. Overall a great speaker, a little high of the price tag relative to other ones on the market but still a good purchase.","timestamp":"Reviewed in the United States July 24, 2024","profile_id":"AEFBU3WL3DLPPRUMH7JPDLYEU6DA","is_verified":false,"product_attributes":"Color: White"},{"id":"R27103M6E5FW38","title":"5.0 out of 5 stars Worth It If You Have Other Sonos Speakers","author":"RyH","rating":5,"content":"If you have another Sonos speaker(s), I'd add this if you are wanting a portable speaker as well. This speaker sounds good, not quite as nice as the Sonos 1 but when they are paired together I can't really tell the difference. I'm not an aficionado by any means but when I had these two playing together, it made me go \"Oh, I should get another Sonos 1, that'd sound real nice\". Initial set up with Bluetooth was simple, but getting it to pair with my Sonos 1 took a couple minutes, a WTF, and a phone restart to get everything synced up. I wish charging status light would stay on while charging, mine doesn't even with the status light enabled in app. Also wish battery % wasn't buried so far down the app, it should be right there on the main screen in the app. Is this the best speaker at this size and price, I don't know but probably not.. I know you can get a good bluetooth speaker for less than this. Does that speaker play well with another Sonos speaker? No. If you're invested in the Sono ecosystem, I think you would like this. Though it can be a little glitchy, I still really like it.","timestamp":"Reviewed in the United States June 24, 2024","profile_id":"AGTQ4EP7OMWCFWITD5TJEGREPCCQ","is_verified":false,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R2Z1BCRD54ISPP","title":"5.0 out of 5 stars Exelent","author":"Xinyi Pang","rating":5,"content":"Todo menos su app","timestamp":"Reviewed in the United States July 29, 2024","profile_id":"AEID4Z2NJXQJVNKS73AHGLG6YH7Q","is_verified":false,"product_attributes":"Color: Black"},{"id":"R3JHNBGIYHR8AN","title":"5.0 out of 5 stars Super sound and portability, and easy integration with other Sonos devices.","author":"VonPhillips","rating":5,"content":"We have a house full of Sonos devices from speakers to their amplifier so I was happy to have the chance to give this Roam 2 speaker a try. My plan is to use it primarily on our back porch so I liked that it’s rechargeable and easily portable and is waterproof just in case we leave is out and it gets some moisture on it. Like all the other Sonos devices we have, the sound it top rate. It really performs like a much larger speaker and will easily fill a large room at adequate volume. The bass output is especially impressive for the size, most likely due to the Trueplay technology it uses.In terms of operation, the directions were clear and simple and we had it connected to our WiFi network and the Sonos app in no time. I ordered the white version since all our others are white, and I think it looks great. That said,black might be the better choice is you plan to take it to the beach, etc.Overall, delighted with the performance and am happy to have this addition to our home audio network.","timestamp":"Reviewed in the United States June 15, 2024","profile_id":"AFKLQ3HGT34CX66IWOTPAA3POHQQ","is_verified":false,"product_attributes":"Color: White"},{"id":"RJFBNJKX05C8K","title":"5.0 out of 5 stars Fantastic!","author":"MKR","rating":5,"content":"I am usually drawn to Bose products. I have also used the JBL charge speakers. I took a flyer on this one, and I am glad I did. The sound is very, very good. For jazz, it is refined, revealing the highs of a tinkling cymbal to steady bass lines; the sound is well-articulated. For something like Beyonce's Cowboy Carter, it revealed the lower nuances in her voice and a pleasantly booming bass. Overall, I found that the sound was fuller and richer at higher volumes, something I did not expect. It is absolutely stunning in a large room out by the pool. At lower volumes in my office, it feels slightly underpowered. At high volumes in my office...well, I don't get much done. I love this little thing! I had no trouble connecting to Bluetooth, either, and battery life is crazy. I used it from 10 am to 4 pm yesterday without any problems and it's still going today. THUMBS UP!!","timestamp":"Reviewed in the United States June 10, 2024","profile_id":"AF3YPD7XDWF5U4YFDNZRJYH6VIEA","is_verified":false,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"RYOFIOP3QJNCN","title":"5.0 out of 5 stars Small in size and decent sound","author":"Marsh","rating":5,"content":"As soon as I received this speaker, i went about setting it up for bluetooth and the ios app connecting to my apple music account. The setup for bluetooth and wifi was quite straightforward except for the requirement to set up a sonos account to use the app (no skip button sesems to be available). The sound quality is quite solid for the size of the speaker. (for reference i own ihome and megaboom speakers).This speaker is quite easy to handle ergonomically with button placement quite ideal and easily accessible. in my opinion this is a decent buy and good enough to bear the sonos name brand.","timestamp":"Reviewed in the United States June 8, 2024","profile_id":"AGEWQNK345BQQMTWOGNDOY2KJO7Q","is_verified":false,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R3M105QNTX0GU4","title":"2.0 out of 5 stars Nice sound, terrible app and experience","author":"Albert","rating":2,"content":"The sound is pretty good for a bedroom or small area if outside. The setup process took a good 30 minutes. The app is terrible, you are forced to create a Sonos account just to use a bluetooth speaker. There's no way to set it up without making an account and agreeing to their terms and marketing emails, so red flag there. The app consistently stops responding and is not reliable, yet it's pushed by Sonos. This is too pricey and too poor of an experience overall for me to recommend.","timestamp":"Reviewed in the United States August 1, 2024","profile_id":"AE5SOLZVPU4TZ3V3BTYFINI62MRQ","is_verified":false,"product_attributes":"Color: White"},{"id":"R38SRY384C7MD6","title":"1.0 out of 5 stars Sonos is failing big time right now","author":"Dan Rose","rating":1,"content":"7.25.24We know that too many of you have experienced significant problems with our new app which rolled out on May 7, and I want to begin by personally apologizing for disappointing you. There isn’t an employee at Sonos who isn’t pained by having let you down, and I assure you that fixing the app for all of our customers and partners has been and continues to be our number one priority.We developed the new app to create a better experience, with the ability to drive more innovation in the future, and with the knowledge that it would get better over time. However, since launch we have found a number of issues. Fixing these issues has delayed our prior plan to quickly incorporate missing features and functionality.Since May 7, we have released new software updates approximately every two weeks, each making significant and meaningful improvements, adding features and fixing bugs. Please see the release notes for Sonos software updates for detailed information on what has been released to date.While these software updates have enabled the majority of our customers to have a robust experience using the Sonos app, there is more work to be done. We have prioritized the following improvements in our next phase of software updates:July and August:- Improving the stability when adding new products- Implementing Music Library configuration, browse, search, and playAugust and September:- Improving Volume responsiveness- User interface improvements based on customer feedback- Improving overall system stability and error handlingSeptember:- Improving Alarm consistency and reliabilitySeptember and October:- Restoring edit mode for Playlists and the Queue- Improving functionality in settings- We plan to continue releasing new software updates on a bi-weekly cadence. With each release, we will share detailed notes on what we’ve addressed and what we’re working on next in our Community.We deeply appreciate your patience as we address these issues. We know we have work to do to earn back your trust and are working hard to do just that.Sincerely,Patrick SpenceCEO","timestamp":"Reviewed in the United States July 26, 2024","profile_id":"AH47NM66X4C4PLOTQQV2MOBRAZ6Q","is_verified":false,"product_attributes":"Color: Black"},{"id":"RCO41VXNH80RT","title":"5.0 out of 5 stars Could just be my favorite speaker!","author":"Denise","rating":5,"content":"Great sound in a small package! Mids and highs shine. Bass is just right in my opinion. You can tailor your sound using the Sonos App. I had a little trouble syncing my speaker to the app because you need to make sure the speaker is in set up mode (meaning the green light needs to be lit). My speaker came in pairing mode so I was confused when I couldn't sync to the app. I had to factory reset the speaker to get the app to recognize the speaker. After that I was up and running. This is a high end speaker to say the least! Beautiful....I love it!","timestamp":"Reviewed in the United States June 11, 2024","profile_id":"AEO3COEYZSG44DHOKFQVYDLQMGNQ","is_verified":false,"helpful_count":2,"product_attributes":"Color: White"},{"id":"R34EGLEE16312P","title":"5.0 out of 5 stars Power packed speakers!","author":"Chinmay Deshpande","rating":5,"content":"This is an amazing bluetooth speaker one can have - its very convenient to move 0 light weigh yet a power packed speaker.The sound quality is amazing and the best part is it connects very easily with BT.There is no hassle to connect and it has a good range of bluetooth connectivity with the device. The controls on the back side make it very easy to operate the speakers. The battery life is very good - and the sound output is really great.Perfect for pool parties or even indoor music listening. I have been really liking this and very happy with these bluetooth speakers.","timestamp":"Reviewed in the United States June 12, 2024","profile_id":"AFL3NOSBDUZDGYTBVWHOC2WOTTQA","is_verified":false,"helpful_count":1,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B0CY6TTR3C","product_name":"Sonos Roam 2 - White - Portable Waterproof Bluetooth Speaker","parse_status_code":12000},"created_at":"2024-08-05 07:31:33","updated_at":"2024-08-05 07:31:41","page":6,"url":"https://www.amazon.com/product-reviews/B0CY6TTR3C?reviewerType=all_reviews&pageNumber=6","job_id":"7226127679920025601","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0CY6TTR3C?reviewerType=all_reviews&pageNumber=7","asin":"B0CY6TTR3C","page":7,"pages":8,"reviews":[{"id":"R2BR5E17GI6P9I","title":"5.0 out of 5 stars Smart Speaker and Bluetooth Speaker | Apple Exclusive?","author":"JARELLANO","rating":5,"content":"Highly Recommended and great value for the money.What I like:1. Is smart speaker that can be controlled via Alexa2. Excellent audio quality3. Small footprint4. Great battery Life5. In addition to works as traditional bluetooth speaker, also can play music via WiFi and therefore you can be farther away from your source device, this is a great bonus!What can be done better:Box has the label \"Made for iPhone, iPad, iPod\". This is not stated anywhere in their website. I use Android and while I think that the sound is excellent, I can only imagine that if I had an Apple device, the experience would be better.","timestamp":"Reviewed in the United States June 23, 2024","profile_id":"AGIJ3LI2UMAKDP4XPVNHOZWM2XIQ","is_verified":false,"product_attributes":"Color: Black"},{"id":"R1VF0LMF23DRLR","title":"5.0 out of 5 stars Great sound in a small package","author":"David Lowe","rating":5,"content":"This Sonos speaker really delivers.It has great sound and easy connectivity via bluetooth.I don't have other Sonos speakers so I cannot evaluate its ability to connect to other Sonos speakers but it does work with Androids media output feature which allows multiple speakers. It works fine using the native Android OS.Overall, this speaker delivers great sound quality in a speaker that is not too big or bulky.","timestamp":"Reviewed in the United States June 20, 2024","profile_id":"AGFIFOWHQ5ICDULACEUY5RXBYZJA","is_verified":false,"product_attributes":"Color: White"},{"id":"R1TPD896CIQ8UM","title":"5.0 out of 5 stars This little speaker really does sound great","author":"JAMES VANDERSCHAAF","rating":5,"content":"The media could not be loaded. Very nice speaker that integrates into the wifi and the bluetooth works great as well. I like the voice option control with it as too. It's a very small speaker, but it does sound very good.","timestamp":"Reviewed in the United States June 16, 2024","profile_id":"AGL4QCERHNPCLTHTCSBGQ4WROZXA","is_verified":false,"helpful_count":2,"product_attributes":"Color: White"},{"id":"R9FMTN2NH076W","title":"1.0 out of 5 stars Don't buy Sonos!","author":"Kanigetts","rating":1,"content":"The software is so glitchy as to be unusable. Updates brick your speakers. You have been warned.","timestamp":"Reviewed in the United States July 29, 2024","profile_id":"AEQQ34KRGGWJL5FV75KYCBQB7V3A","is_verified":false,"product_attributes":"Color: Black"},{"id":"RERGCQ3PLJUTJ","title":"1.0 out of 5 stars Buyer beware WiFi connection and Customer Service horrible","author":"Road Runner","rating":1,"content":"I bought this speaker 6 months ago, barely used it. It will not connect to WiFi despite hours of waiting for customer service to assist. After I finally got a customer service agent, reset device several times, it connected once and hasn’t connected since. Seller said go to Sonos. Sonos is impossible to get customer service agent been trying for 3 days. No one calls you back, chat line tells you contact support number but Sonos has NO support! Don’t waste your money buying this. Not worth the money. Stick with Bose!","timestamp":"Reviewed in the United States June 2, 2024","profile_id":"AEGCJLZHMRVLF55FNZBSFVM2Y5PA","is_verified":false,"helpful_count":8,"product_attributes":"Color: White"},{"id":"R25VEKRF5EV836","title":"1.0 out of 5 stars Horrible service","author":"Linda T.","rating":1,"content":"I could not link to other Sonos Roam speakers or bluetooth - Spent 1 1/2 chat hours with Sonos support and 5 hours live (each time waiting for 1 hr before connented to a person) Got disconnected both times and they not try to reconnect - they both had my email and cell number. 6 1/2 hrs and no resolution -Worst service I have ever dealt with and will not reccomend to anyone.Poor service will eventually collapse a company - especially this bad.Jim T","timestamp":"Reviewed in the United States May 24, 2024","profile_id":"AEECURQVZUBV4HKCK3M74UANCFKA","is_verified":false,"helpful_count":19,"product_attributes":"Color: Black"},{"id":"R34PNR72XAULLC","title":"1.0 out of 5 stars Cannot pair two of these without wi-fi.","author":"jdawz","rating":1,"content":"Amazing that they made an outdoor, portable waterproof speaker that cannot pair at all unless you are in wi-fi. 55 minute wait for tech support only to find out you are out of luck with two of these without wifi. If you only want one speaker it is ok but the JBL Flip 6 at $99 is just as good.","timestamp":"Reviewed in the United States May 22, 2024","profile_id":"AFNED7OI2U3V2GPP6XHXMYQY5R6Q","is_verified":false,"helpful_count":12,"product_attributes":"Color: White"},{"id":"R1GHYH6N4V9BRB","title":"1.0 out of 5 stars Spotty Qi charging and connectivity","author":"TheMeiers","rating":1,"content":"Not consistent qi charging and bluetooth a pain to connect. Megaboom much better.","timestamp":"Reviewed in the United States May 24, 2024","profile_id":"AFW6USPKXJEMNISGCXPG2BFMALAQ","is_verified":false,"helpful_count":4,"product_attributes":"Color: Black"},{"id":"R3A3WH9V0BRMHE","title":"Wow really impressed with this","author":"Gary G","rating":5,"content":"I was very skeptical of getting this, but wanted a portable unit. I love the fact that it automatically adjusts its sounds based on where it's placed. The sound is vibrant, and a big step up in my opinion from my 12 year old Bose portable speaker.","timestamp":"Reviewed in Canada August 2, 2024","is_verified":true,"product_attributes":"Color: White"},{"id":"R1RWJ77PY6YWW0","title":"Awesome portable speaker!","author":"White City","rating":5,"content":"I was looking for a really nice sounding portable speaker, I really wanted AirPlay. The options are obviously limited. Basically I wanted a HomePod mini on batteries… This actually sounds better but considering it’s twice the price I guess it should.","timestamp":"Reviewed in Canada July 25, 2024","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B0CY6TTR3C","product_name":"Sonos Roam 2 - White - Portable Waterproof Bluetooth Speaker","parse_status_code":12000},"created_at":"2024-08-05 07:31:33","updated_at":"2024-08-05 07:31:43","page":7,"url":"https://www.amazon.com/product-reviews/B0CY6TTR3C?reviewerType=all_reviews&pageNumber=7","job_id":"7226127679920025601","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0CY6TTR3C?reviewerType=all_reviews&pageNumber=8","asin":"B0CY6TTR3C","page":8,"pages":1,"reviews":[{"id":"R2G7TV3M36DC96","title":"Great sound quality","author":"Krista M MacLean","rating":5,"content":"Easy to use portable bluetooth speaker that is small enough to take pretty much everywhere while still delivering big sound. Can be linked to other Sonos speakers to play throughout your home and beyond.","timestamp":"Reviewed in Canada July 22, 2024","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3EVFFCN9WQ4Y5","title":"Bocina de gran calidad","author":"Poly","rating":5,"content":"Un muy buen producto a buen precio, con muy buena fidelidad","timestamp":"Reviewed in Mexico July 31, 2024","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2WSX4UJM22UAT","title":"Sonos complicando lo que ya era facil de usar","author":"Raul","rating":3,"content":"En general es un producto de buena calidad. Se siente solido y el diseño es de lo mejor que he visto en altavoces portátiles, pues su forma triangular ayuda mucho a lograr una buena dispersión del sonido en diferentes posiciones. La batería tiene buena duración y el tiempo de carga es razonable.Una de las novedades de este producto en comparación con la generación anterior es que Sonos incluyó un botón físico para alternar a la conexión Bluetooth, lo cual en teoría debería facilitar su uso cuando no se puede o no se quiere usar la conexión wifi. Sin embargo, cada que enciendes el altavoz inicia en modo wifi y cambiar al modo Bluetooth te tomará al menos 30 segundos, lo cual pudiera no parecer mucho pero se siente una eternidad cuando lo comparas con cualquier otra bocina que enciendes y al instante se conecta a la fuente de audio.Algo que debes saber si eres nuevo en el ecosistema Sonos es que no todas las apps de streaming tienen soporte nativo para escucharlas mediante WiFi a través de un altavoz conectado a tu red. Si usas aplicaciones como Amazon Músic, Tidal o Qobuz primero tendrás que conectarlas a la app de Sonos para poder escuchar a través de WiFi. Hasta ahora solo en Spotify he logrado seleccionar los altavoces de Sonos sin pasar por su aplicación, pero el caso de YouTube merece una mención especial, pues la app de Sonos no la soporta y la única forma de escuchar el audio es en el modo Bluetooth, lo cual implica pasar por el calvario de alternar la conexión. A menos que tú app favorita sea Spotify o seas usuario de iPhone y tengas acceso a AirPlay, te recomendaría evitar los altavoces de Sonos.Siendo usuario de Android, al final terminé extrañando mi antigua Bose Soundlink Flex, la cual no ofrece las ventajas de la conexión wifi pero resulta mucho más sencilla de usar, simplemente la prendes y está lista para empezar a escuchar lo que quieras desde dónde quieras. Además, Soundlink Flex tiene más potencia en los graves y la duración de su batería es muy buena.","timestamp":"Reviewed in Mexico July 28, 2024","is_verified":true,"product_attributes":"Color: Black"},{"id":"RHC9BYZRK6GS6","title":"Kicks out the tunes","author":"David Somers","rating":5,"content":"I love this thing lol 😂","timestamp":"Reviewed in Canada August 2, 2024","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3LTR33AXX4RSX","title":"Qualité et son =A1","author":"jean-guy bouchard","rating":5,"content":"Très bon produit. Son fantastique. Il me suit partout.","timestamp":"Reviewed in Canada July 30, 2024","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1J7R81BPL3GIE","title":"Very convenient..","author":"Sharon Hayward","rating":5,"content":"The sound quality and versatility of this unit is wonderful!","timestamp":"Reviewed in Canada July 12, 2024","is_verified":true,"product_attributes":"Color: White"}],"page_type":"Question","asin_in_url":"B0CY6TTR3C","product_name":"Sonos Roam 2 - White - Portable Waterproof Bluetooth Speaker","parse_status_code":12000},"created_at":"2024-08-05 07:31:33","updated_at":"2024-08-05 07:31:44","page":8,"url":"https://www.amazon.com/product-reviews/B0CY6TTR3C?reviewerType=all_reviews&pageNumber=8","job_id":"7226127679920025601","is_render_forced":false,"status_code":200,"parser_type":""}],"job":{"callback_url":null,"client_id":18306,"context":[{"key":"force_headers","value":null},{"key":"force_cookies","value":false},{"key":"check_empty_geo","value":null},{"key":"safe_search","value":true}],"created_at":"2024-08-05 07:31:33","domain":"com","geo_location":null,"id":"7226127679920025601","limit":10,"locale":null,"pages":20,"parse":true,"parser_type":null,"parsing_instructions":null,"browser_instructions":null,"render":null,"url":null,"query":"B0CY6TTR3C","source":"amazon_reviews","start_page":1,"status":"done","storage_type":null,"storage_url":null,"subdomain":"www","content_encoding":"utf-8","updated_at":"2024-08-05 07:31:44","user_agent_type":"desktop","session_info":null,"statuses":[],"client_notes":null,"_links":[{"rel":"self","href":"http://data.oxylabs.io/v1/queries/7226127679920025601","method":"GET"},{"rel":"results","href":"http://data.oxylabs.io/v1/queries/7226127679920025601/results","method":"GET"},{"rel":"results-html","href":"http://data.oxylabs.io/v1/queries/7226127679920025601/results?type=raw","method":"GET"},{"rel":"results-parsed","href":"http://data.oxylabs.io/v1/queries/7226127679920025601/results?type=parsed","method":"GET"}]}}